--avatar

-- key
local __key_map = {
  id = 1,    --变身卡id-int 
  list_name = 2,    --变身卡列表名称-string 
  name = 3,    --变身卡名称-string 
  color = 4,    --变身卡品质-int 
  hero_id = 5,    --资源id-int 
  icon = 6,    --变身卡icon-int 
  limit = 7,    --是否已经界限突破-int 
  description = 8,    --变身卡描述-string 
  talk = 9,    --变身卡气泡说话-string 
  fashion_attr_1 = 10,    --基础属性类型1-int 
  fashion_value_1 = 11,    --基础属性值1-int 
  fashion_attr_2 = 12,    --基础属性类型2-int 
  fashion_value_2 = 13,    --基础属性值2-int 
  levelup_base = 14,    --初始等级-int 
  levelup_cost = 15,    --升级模板-int 
  skill_3_unlock = 16,    --合击解锁等级-int 
  show_id = 17,    --图鉴id-string 
  is_show = 18,    --图鉴是否显示-int 
  fake = 19,    --假战力-int 
  batch = 20,    --期数-int 
  xaxis = 21,    --X轴偏移-int 
  yaxis = 22,    --Y轴偏移-int 

}

-- data
local avatar = {
    _data = {
        [1] = {0,"0","0",0,0,0,0,"0","我要一统三国，成为盖世英雄！",0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [2] = {1106,"    曹仁    变身卡","曹仁变身卡",5,106,106,0,"主角曹仁变身卡，穿戴之后可以拥有曹仁变身卡技能、天赋、神兵特性，同时拥有张郃变身卡，曹冲变身卡，乐进变身卡，典韦（红变身卡）可以激活额外属性。","敌军围困万千重，我自岿然不动！",1,1200,17,40,1,0,0,"13|14|15|117",1,2400000,1,-20,20,},
        [3] = {1110,"    张郃    变身卡","张郃变身卡",5,110,110,0,"主角张郃变身卡，穿戴之后可以拥有张郃变身卡技能、天赋、神兵特性，同时拥有曹仁变身卡，乐进变身卡，于禁变身卡，夏侯惇（红）变身卡可以激活额外属性。","用兵之道，变化万千。",7,9000,19,50,1,0,0,"1|2|13|97",1,2400000,1,0,0,},
        [4] = {1113,"    乐进    变身卡","乐进变身卡",4,113,113,0,"主角乐进变身卡，穿戴之后可以拥有乐进变身卡技能、天赋、神兵特性，同时拥有张郃变身卡，曹仁变身卡，于禁变身卡，可以激活额外属性。","看我先登城头，立下首功！",17,40,20,50,1,0,0,"1|3|15",1,800000,1,-20,-20,},
        [5] = {1115,"    曹冲    变身卡","曹冲变身卡",4,115,115,0,"主角曹冲变身卡，穿戴之后可以拥有曹冲变身卡技能、天赋、神兵特性，同时拥有曹仁变身卡，张辽变身卡，于禁变身卡，徐晃变身卡，可以激活额外属性。","父亲，父亲，看冲儿的！",16,40,20,50,1,0,0,"14|16|30|32",1,800000,1,10,50,},
        [6] = {1119,"    于禁    变身卡","于禁变身卡",4,119,119,0,"主角于禁变身卡，穿戴之后可以拥有于禁变身卡技能、天赋、神兵特性，同时拥有张郃变身卡，曹冲变身卡，乐进变身卡，可以激活额外属性。","稳重行军，百战不殆。",16,40,18,40,1,0,0,"2|3|16",1,800000,1,20,0,},
        [7] = {1109,"    张辽    变身卡","张辽变身卡",5,109,109,0,"主角张辽变身卡，穿戴之后可以拥有张辽变身卡技能、天赋、神兵特性，同时拥有甄姬变身卡，曹冲变身卡，甄姬（红）变身卡可以激活额外属性。","没想到吧！",1,1200,17,40,1,0,0,"29|30|145",1,2400000,1,20,0,},
        [8] = {1112,"    甄姬    变身卡","甄姬变身卡",5,112,112,0,"主角甄姬变身卡，穿戴之后可以拥有甄姬变身卡技能、天赋、神兵特性，同时拥有张辽变身卡，徐晃变身卡，曹丕（红）变身卡可以激活额外属性。","凌波微步，罗袜生尘。",7,9000,20,50,1,0,0,"29|31|93",1,2400000,1,20,20,},
        [9] = {1114,"    徐晃    变身卡","徐晃变身卡",4,114,114,0,"主角徐晃变身卡，穿戴之后可以拥有徐晃变身卡技能、天赋、神兵特性，同时拥有甄姬变身卡，许褚变身卡，张春华变身卡，曹冲变身卡，可以激活额外属性。","截其援，断其粮，贼可擒也！",17,40,20,50,1,0,0,"31|32|63|64",1,800000,1,0,0,},
        [10] = {1104,"    郭嘉    变身卡","郭嘉变身卡",5,104,104,0,"主角郭嘉变身卡，穿戴之后可以拥有郭嘉变身卡技能、天赋、神兵特性，同时拥有夏侯惇变身卡，曹植变身卡，荀彧（红）变身卡可以激活额外属性。","咳，咳……",1,1200,17,40,1,0,0,"45|46|113",1,2400000,1,0,0,},
        [11] = {1105,"  夏侯惇  变身卡","夏侯惇变身卡",5,105,105,0,"主角夏侯惇变身卡，穿戴之后可以拥有夏侯惇变身卡技能、天赋、神兵特性，同时拥有郭嘉变身卡，夏侯渊变身卡，张辽（红）变身卡可以激活额外属性。","以彼之道，还施彼身！",7,9000,20,50,1,0,0,"45|47|133",1,2400000,1,0,0,},
        [12] = {1116,"    曹植    变身卡","曹植变身卡",4,116,116,0,"主角曹植变身卡，穿戴之后可以拥有曹植变身卡技能、天赋、神兵特性，同时拥有郭嘉变身卡，荀彧变身卡，夏侯渊变身卡，张春华变身卡，可以激活额外属性。","本是同根生，相煎何太急！",17,40,20,50,1,0,0,"46|48|78|80",1,800000,1,20,0,},
        [13] = {1117,"  夏侯渊  变身卡","夏侯渊变身卡",4,117,117,0,"主角夏侯渊变身卡，穿戴之后可以拥有夏侯渊变身卡技能、天赋、神兵特性，同时拥有夏侯惇变身卡，曹植变身卡，可以激活额外属性。","孤善于千里袭人！",16,40,20,50,1,0,0,"47|48",1,800000,1,20,0,},
        [14] = {1107,"    典韦    变身卡","典韦变身卡",5,107,107,0,"主角典韦变身卡，穿戴之后可以拥有典韦变身卡技能、天赋、神兵特性，同时拥有许褚变身卡，张春华变身卡，许褚（红）变身卡可以激活额外属性。","主公！快走……",1,1200,17,40,1,0,0,"61|62|101",1,2400000,1,0,0,},
        [15] = {1108,"    许褚    变身卡","许褚变身卡",5,108,108,0,"主角许褚变身卡，穿戴之后可以拥有许褚变身卡技能、天赋、神兵特性，同时拥有典韦变身卡，徐晃，曹仁（红）变身卡，可以激活额外属性。","谁来和我大战三百回合！",7,9000,20,50,1,0,0,"61|63|141",1,2400000,1,-40,0,},
        [16] = {1118,"  张春华  变身卡","张春华变身卡",4,118,118,0,"主角张春华变身卡，穿戴之后可以拥有张春华变身卡技能、天赋、神兵特性，同时拥有典韦变身卡，曹丕变身卡，曹植变身卡，徐晃变身卡，可以激活额外属性。","你的死活与我何干！",17,40,20,50,1,0,0,"62|64|79|80",1,800000,1,20,0,},
        [17] = {1102,"    荀彧    变身卡","荀彧变身卡",5,102,102,0,"主角变荀彧身卡，穿戴之后可以拥有荀彧变身卡技能、天赋、神兵特性，同时拥有曹丕变身卡，曹植变身卡，郭嘉（红）变身卡可以激活额外属性。","秉忠贞之志，守谦退之节。",1,1200,17,40,1,0,0,"77|78|129",1,2400000,1,0,0,},
        [18] = {1111,"    曹丕    变身卡","曹丕变身卡",5,111,111,0,"主角曹丕变身卡，穿戴之后可以拥有曹丕变身卡技能、天赋、神兵特性，同时拥有荀彧变身卡，张春华，张郃（红）变身卡，可以激活额外属性。","给我翻过来！",7,9000,20,50,1,0,0,"77|79|121",1,2400000,1,0,-20,},
        [19] = {1205,"    关羽    变身卡","关羽变身卡",5,205,205,0,"主角关羽变身卡，穿戴之后可以拥有关羽变身卡技能、天赋、神兵特性，同时拥有张飞变身卡，祝融变身卡，阿斗变身卡，徐庶（红）变身卡可以激活额外属性。","观尔乃插标卖首。",1,1200,17,40,1,0,0,"17|18|19|130",1,2400000,1,20,-10,},
        [20] = {1206,"    张飞    变身卡","张飞变身卡",5,206,206,0,"主角张飞变身卡，穿戴之后可以拥有张飞变身卡技能、天赋、神兵特性，同时拥有关羽变身卡，孟获变身卡，阿斗变身卡，关羽（红）变身卡可以激活额外属性。","燕人张飞在此！",7,9000,19,50,1,0,0,"4|5|17|94",1,2400000,1,0,-10,},
        [21] = {1213,"    孟获    变身卡","孟获变身卡",4,213,213,0,"主角孟获变身卡，穿戴之后可以拥有孟获变身卡技能、天赋、神兵特性，同时拥有张飞变身卡，祝融变身卡，阿斗变身卡，可以激活额外属性。","背黑锅我来，送死~你去!",17,40,20,50,1,0,0,"4|6|20",1,800000,1,0,-10,},
        [22] = {1214,"    祝融    变身卡","祝融变身卡",4,214,214,0,"主角祝融变身卡，穿戴之后可以拥有祝融变身卡技能、天赋、神兵特性，同时拥有关羽变身卡，黄月英变身卡，孟获变身卡，关银屏变身卡，可以激活额外属性。","亮兵器吧～",16,40,20,50,1,0,0,"18|20|34|36",1,800000,1,0,-10,},
        [23] = {1215,"    阿斗    变身卡","阿斗变身卡",4,215,215,0,"主角阿斗变身卡，穿戴之后可以拥有阿斗变身卡技能、天赋、神兵特性，同时拥有张飞变身卡，关羽变身卡，孟获变身卡，可以激活额外属性。","爱卿可放手一搏。",16,40,18,40,1,0,0,"5|6|19",1,800000,1,30,20,},
        [24] = {1204,"  黄月英  变身卡","黄月英变身卡",5,204,204,0,"主角黄月英变身卡，穿戴之后可以拥有黄月英变身卡技能、天赋、神兵特性，同时拥有徐庶变身卡，祝融，庞统（红）变身卡，可以激活额外属性。","驭巧器，已取先机。",7,9000,20,50,1,0,0,"33|34|122",1,2400000,1,30,0,},
        [25] = {1212,"    徐庶    变身卡","徐庶变身卡",5,212,212,0,"主角徐庶变身卡，穿戴之后可以拥有徐庶变身卡技能、天赋、神兵特性，同时拥有黄月英变身卡，关银屏变身卡，刘备（红）变身卡可以激活额外属性。","一切尽在不言中。",1,1200,17,40,1,0,0,"33|35|114",1,2400000,1,20,-20,},
        [26] = {1217,"  关银屏  变身卡","关银屏变身卡",4,217,217,0,"主角关银屏变身卡，穿戴之后可以拥有关银屏变身卡技能、天赋、神兵特性，同时拥有徐庶变身卡，庞统变身卡，关平变身卡，祝融变身卡，可以激活额外属性。","虎父无犬女！",17,40,20,50,1,0,0,"35|36|67|68",1,800000,1,30,0,},
        [27] = {1207,"    马超    变身卡","马超变身卡",5,207,207,0,"主角马超变身卡，穿戴之后可以拥有变身卡技能、天赋、神兵特性，同时拥有黄忠变身卡，张星彩变身卡，张飞（红）变身卡，可以激活额外属性。","全军突击！！！",1,1200,17,40,1,0,0,"49|50|142",1,2400000,1,10,0,},
        [28] = {1208,"    黄忠    变身卡","黄忠变身卡",5,208,208,0,"主角黄忠变身卡，穿戴之后可以拥有黄忠变身卡技能、天赋、神兵特性，同时拥有马超变身卡，法正变身卡，姜维（红）变身卡可以激活额外属性。","烈弓之下片甲不留！",7,9000,20,50,1,0,0,"49|51|118",1,2400000,1,10,0,},
        [29] = {1216,"  张星彩  变身卡","张星彩变身卡",4,216,216,0,"主角张星彩变身卡，穿戴之后可以拥有张星彩变身卡技能、天赋、神兵特性，同时拥有马超变身卡，刘备变身卡，关平变身卡，法正变身卡，可以激活额外属性。","体察民意，感悟圣心。",17,40,20,50,1,0,0,"50|52|82|84",1,800000,1,30,20,},
        [30] = {1219,"    法正    变身卡","法正变身卡",4,219,219,0,"主角法正变身卡，穿戴之后可以拥有法正变身卡技能、天赋、神兵特性，同时拥有黄忠变身卡，张星彩变身卡，可以激活额外属性。","滴水之恩，涌泉以报！ ",16,40,20,50,1,0,0,"51|52",1,800000,1,0,0,},
        [31] = {1209,"    姜维    变身卡","姜维变身卡",5,209,209,0,"主角姜维变身卡，穿戴之后可以拥有姜维变身卡技能、天赋、神兵特性，同时拥有庞统变身卡，关平变身卡，魏延（红）变身卡可以激活额外属性。","先帝之志，丞相之托，不可忘也！",1,1200,17,40,1,0,0,"65|66|146",1,2400000,1,20,20,},
        [32] = {1211,"    庞统    变身卡","庞统变身卡",5,211,211,0,"主角庞统变身卡，穿戴之后可以拥有庞统变身卡技能、天赋、神兵特性，同时拥有姜维变身卡，关银屏变身卡，马超（红）变身卡可以激活额外属性。","浴火重生！",7,9000,20,50,1,0,0,"65|67|98",1,2400000,1,-70,10,},
        [33] = {1218,"    关平    变身卡","关平变身卡",4,218,218,0,"主角关平变身卡，穿戴之后可以拥有关平变身卡技能、天赋、神兵特性，同时拥有姜维变身卡，魏延变身卡，张星彩变身卡，关银屏变身卡，可以激活额外属性。","龙啸九天，武圣显灵！",17,40,20,50,1,0,0,"66|68|83|84",1,800000,1,0,0,},
        [34] = {1202,"    刘备    变身卡","刘备变身卡",5,202,202,0,"主角刘备变身卡，穿戴之后可以拥有刘备变身卡技能、天赋、神兵特性，同时拥有魏延变身卡，张星彩变身卡，黄月英（红）变身卡可以激活额外属性。","惟贤惟德，仁服于人！",1,1200,17,40,1,0,0,"81|82|134",1,2400000,1,20,0,},
        [35] = {1210,"    魏延    变身卡","魏延变身卡",5,210,210,0,"主角魏延变身卡，穿戴之后可以拥有魏延变身卡技能、天赋、神兵特性，同时拥有刘备变身卡，关平变身卡，黄忠（红）变身卡可以激活额外属性。","哼，也不看看我是何人。",7,9000,20,50,1,0,0,"81|83|102",1,2400000,1,20,-10,},
        [36] = {1304,"    小乔    变身卡","小乔变身卡",5,304,304,0,"主角小乔变身卡，穿戴之后可以拥有小乔变身卡技能、天赋、神兵特性，同时拥有甘宁变身卡，黄盖变身卡，步练师变身卡，鲁肃（红）变身卡可以激活额外属性。","替我挡着~",1,1200,17,40,1,0,0,"21|22|23|131",1,2400000,1,15,-20,},
        [37] = {1308,"    甘宁    变身卡","甘宁变身卡",5,308,308,0,"主角甘宁变身卡，穿戴之后可以拥有甘宁变身卡技能、天赋、神兵特性，同时拥有小乔变身卡，黄盖变身卡，韩当，孙坚（红）变身卡，可以激活额外属性。","接招吧！",7,9000,19,50,1,0,0,"7|8|21|143",1,2400000,1,20,0,},
        [38] = {1314,"    黄盖    变身卡","黄盖变身卡",4,314,314,0,"主角黄盖变身卡，穿戴之后可以拥有黄盖变身卡技能、天赋、神兵特性，同时拥有甘宁变身卡，小乔变身卡，韩当变身卡，可以激活额外属性。","请鞭挞我吧，公瑾！",16,40,18,40,1,0,0,"7|9|23",1,800000,1,10,-20,},
        [39] = {1317,"  步练师  变身卡","步练师变身卡",4,317,317,0,"主角步练师变身卡，穿戴之后可以拥有步练师变身卡技能、天赋、神兵特性，同时拥有小乔变身卡，太史慈变身卡，韩当变身卡，张昭变身卡，可以激活额外属性。","且听臣妾一曲~",16,40,20,50,1,0,0,"22|24|38|40",1,800000,1,-10,20,},
        [40] = {1318,"    韩当    变身卡","韩当变身卡",4,318,318,0,"主角韩当变身卡，穿戴之后可以拥有韩当变身卡技能、天赋、神兵特性，同时拥有甘宁变身卡，黄盖变身卡，步练师变身卡，可以激活额外属性。","吃我一箭！",17,40,20,50,1,0,0,"8|9|24",1,800000,1,0,0,},
        [41] = {1305,"  太史慈  变身卡","太史慈变身卡",5,305,305,0,"主角太史慈变身卡，穿戴之后可以拥有太史慈变身卡技能、天赋、神兵特性，同时拥有陆逊变身卡，步练师变身卡，吕蒙（红）变身卡可以激活额外属性。","我当要替天行道！",1,1200,17,40,1,0,0,"37|38|99",1,2400000,1,15,25,},
        [42] = {1311,"    陆逊    变身卡","陆逊变身卡",5,311,311,0,"主角陆逊变身卡，穿戴之后可以拥有陆逊变身卡技能、天赋、神兵特性，同时拥有太史慈变身卡，张昭变身卡，甘宁（红）可以激活额外属性。","国之大计，审势为先。",1,1200,17,40,1,0,0,"37|39|95",1,2400000,1,-10,-10,},
        [43] = {1315,"    张昭    变身卡","张昭变身卡",4,315,315,0,"主角张昭变身卡，穿戴之后可以拥有张昭变身卡技能、天赋、神兵特性，同时拥有陆逊变身卡，鲁肃变身卡，凌统变身卡，步练师变身卡，可以激活额外属性。","请恕老臣直言！",17,40,20,50,1,0,0,"39|40|71|72",1,800000,1,10,0,},
        [44] = {1306,"    孙权    变身卡","孙权变身卡",5,306,306,0,"主角孙权变身卡，穿戴之后可以拥有孙权变身卡技能、天赋、神兵特性，同时拥有吕蒙变身卡，诸葛瑾变身卡，太史慈（红）变身卡可以激活额外属性。","且慢，容我三思。",1,1200,17,40,1,0,0,"53|54|135",1,2400000,1,0,30,},
        [45] = {1307,"    吕蒙    变身卡","吕蒙变身卡",5,307,307,0,"主角吕蒙变身卡，穿戴之后可以拥有吕蒙变身卡技能、天赋、神兵特性，同时拥有孙权变身卡，周泰变身卡，孙权（红）变身卡可以激活额外属性。","攻城为下，攻心为上。",7,9000,20,50,1,0,0,"53|55|119",1,2400000,1,15,0,},
        [46] = {1316,"    周泰    变身卡","周泰变身卡",4,316,316,0,"主角周泰变身卡，穿戴之后可以拥有周泰变身卡技能、天赋、神兵特性，同时拥有吕蒙变身卡，诸葛瑾变身卡，可以激活额外属性。","哼，这点小伤算什么！",17,40,20,50,1,0,0,"55|56",1,800000,1,60,40,},
        [47] = {1319,"  诸葛瑾  变身卡","诸葛瑾变身卡",4,319,319,0,"主角诸葛瑾变身卡，穿戴之后可以拥有诸葛瑾变身卡技能、天赋、神兵特性，同时拥有孙权变身卡，大乔变身卡，周泰变身卡，凌统变身卡，可以激活额外属性。","明以洞察，哲以保身。",16,40,20,50,1,0,0,"54|56|86|88",1,800000,1,10,0,},
        [48] = {1310,"  孙尚香  变身卡","孙尚香变身卡",5,310,310,0,"主角孙尚香变身卡，穿戴之后可以拥有孙尚香变身卡技能、天赋、神兵特性，同时拥有鲁肃变身卡，凌统，小乔（红）变身卡，可以激活额外属性。","夫君，身体要紧~",1,1200,17,40,1,0,0,"69|70|123",1,2400000,1,-20,-30,},
        [49] = {1312,"    鲁肃    变身卡","鲁肃变身卡",5,312,312,0,"主角鲁肃变身卡，穿戴之后可以拥有鲁肃变身卡技能、天赋、神兵特性，同时拥有孙尚香变身卡，张昭变身卡，大乔（红）变身卡可以激活额外属性。","来来来，见面分一半。",7,9000,20,50,1,0,0,"69|71|115",1,2400000,1,15,-20,},
        [50] = {1313,"    凌统    变身卡","凌统变身卡",4,313,313,0,"主角凌统变身卡，穿戴之后可以拥有凌统变身卡技能、天赋、神兵特性，同时拥有孙尚香变身卡，孙坚变身卡，诸葛瑾变身卡，张昭变身卡，可以激活额外属性。","索命于须臾之间。",17,40,20,50,1,0,0,"70|72|87|88",1,800000,1,40,20,},
        [51] = {1302,"    大乔    变身卡","大乔变身卡",5,302,302,0,"主角大乔变身卡，穿戴之后可以拥有大乔变身卡技能、天赋、神兵特性，同时拥有孙坚变身卡，诸葛瑾变身卡，孙尚香（红）变身卡可以激活额外属性。","旅途劳顿，请休息吧。",1,1200,17,40,1,0,0,"85|86|103",1,2400000,1,25,20,},
        [52] = {1309,"    孙坚    变身卡","孙坚变身卡",5,309,309,0,"主角孙坚变身卡，穿戴之后可以拥有孙坚变身卡技能、天赋、神兵特性，同时拥有大乔变身卡，凌统变身卡，陆逊（红）变身卡可以激活额外属性。","以吾魂魄，保佑吾儿之基业英魂。",7,9000,20,50,1,0,0,"85|87|147",1,2400000,1,-30,0,},
        [53] = {1408,"  公孙瓒  变身卡","公孙瓒变身卡",5,408,408,0,"主角公孙瓒变身卡，穿戴之后可以拥有公孙瓒变身卡技能、天赋、神兵特性，同时拥有于吉变身卡，陈宫变身卡，吕灵雎变身卡，董卓（红）变身卡可以激活额外属性。","众将听令，排好阵势，御敌！",7,9000,19,50,1,0,0,"10|11|25|100",1,2400000,1,20,30,},
        [54] = {1410,"    于吉    变身卡","于吉变身卡",5,410,410,0,"主角于吉变身卡，穿戴之后可以拥有于吉变身卡技能、天赋、神兵特性，同时拥有公孙瓒变身卡，陈宫变身卡，吕灵雎变身卡，贾诩（红）变身卡可以激活额外属性。","如真似幻，扑朔迷离。",1,1200,17,40,1,0,0,"25|26|27|104",1,2400000,1,20,20,},
        [55] = {1416,"    陈宫    变身卡","陈宫变身卡",4,416,416,0,"主角陈宫变身卡，穿戴之后可以拥有陈宫变身卡技能、天赋、神兵特性，同时拥有公孙瓒变身卡，于吉变身卡，吕灵雎变身卡，可以激活额外属性。","如此，霸业可图也~",17,40,20,50,1,0,0,"10|12|27",1,800000,1,0,-10,},
        [56] = {1418,"  吕灵雎  变身卡","吕灵雎变身卡",4,418,418,0,"主角吕灵雎变身卡，穿戴之后可以拥有吕灵雎变身卡技能、天赋、神兵特性，同时拥有公孙瓒变身卡，陈宫变身卡，张让变身卡，可以激活额外属性。","我是你惹不起的小公举！",16,40,18,40,1,0,0,"11|12|28",1,800000,1,30,-10,},
        [57] = {1419,"    张让    变身卡","张让变身卡",4,419,419,0,"主角张让变身卡，穿戴之后可以拥有张让变身卡技能、天赋、神兵特性，同时拥有于吉变身卡，张角变身卡，吕灵雎变身卡，孔融变身卡，可以激活额外属性。","我的大剪刀早已饥渴难耐！",16,40,20,50,1,0,0,"26|28|42|44",1,800000,1,0,20,},
        [58] = {1409,"    张角    变身卡","张角变身卡",5,409,409,0,"主角张角变身卡，穿戴之后可以拥有张角变身卡技能、天赋、神兵特性，同时拥有袁术变身卡，张让，袁术（红）变身卡，可以激活额外属性。","以我之真气，合天地之造化！",1,1200,17,40,1,0,0,"41|42|124",1,2400000,1,10,10,},
        [59] = {1412,"    袁术    变身卡","袁术变身卡",5,412,412,0,"主角袁术变身卡，穿戴之后可以拥有袁术变身卡技能、天赋、神兵特性，同时拥有张角变身卡，孔融变身卡，于吉（红）变身卡可以激活额外属性。","玉玺在手，天下我有！",7,9000,19,50,1,0,0,"41|43|148",1,2400000,1,0,10,},
        [60] = {1417,"    孔融    变身卡","孔融变身卡",4,417,417,0,"主角孔融变身卡，穿戴之后可以拥有孔融变身卡技能、天赋、神兵特性，同时拥有张角变身卡，袁绍变身卡，颜良变身卡，张让变身卡，可以激活额外属性。","谦者，德之柄也，让者，礼之主也。",17,40,20,50,1,0,0,"43|44|75|76",1,800000,1,30,50,},
        [61] = {1406,"    华雄    变身卡","华雄变身卡",5,406,406,0,"主角华雄变身卡，穿戴之后可以拥有华雄变身卡技能、天赋、神兵特性，同时拥有贾诩变身卡，蔡文姬变身卡，华佗（红）变身卡可以激活额外属性。","好大一股酒气啊。",1,1200,17,40,1,0,0,"57|58|116",1,2400000,1,10,20,},
        [62] = {1407,"    贾诩    变身卡","贾诩变身卡",5,407,407,0,"主角贾诩变身卡，穿戴之后可以拥有贾诩变身卡技能、天赋、神兵特性，同时拥有华雄变身卡，文丑变身卡，华雄（红）变身卡可以激活额外属性。","我要你三更死，谁敢留你到五更！",7,9000,20,50,1,0,0,"57|59|120",1,2400000,1,15,10,},
        [63] = {1414,"    文丑    变身卡","文丑变身卡",4,414,414,0,"主角文丑变身卡，穿戴之后可以拥有文丑变身卡技能、天赋、神兵特性，同时拥有贾诩变身卡，蔡文姬变身卡，可以激活额外属性。","吾乃河北上将文丑是也！",17,40,20,50,1,0,0,"59|60",1,800000,1,25,0,},
        [64] = {1415,"  蔡文姬  变身卡","蔡文姬变身卡",4,415,415,0,"主角蔡文姬变身卡，穿戴之后可以拥有蔡文姬变身卡技能、天赋、神兵特性，同时拥有华雄变身卡，华佗变身卡，文丑变身卡，颜良变身卡，可以激活额外属性。","流落异乡愁断肠。",16,40,20,50,1,0,0,"58|60|90|92",1,800000,1,-10,-10,},
        [65] = {1405,"    董卓    变身卡","董卓变身卡",5,405,405,0,"主角董卓变身卡，穿戴之后可以拥有董卓变身卡技能、天赋、神兵特性，同时拥有袁绍变身卡，颜良变身卡，貂蝉（红）变身卡可以激活额外属性。","嘿嘿嘿，美人儿，来，香一个~",1,1200,17,40,1,0,0,"73|74|136",1,2400000,1,0,-30,},
        [66] = {1411,"    袁绍    变身卡","袁绍变身卡",5,411,411,0,"主角袁绍变身卡，穿戴之后可以拥有袁绍变身卡技能、天赋、神兵特性，同时拥有董卓变身卡，孔融，公孙瓒（红）变身卡，可以激活额外属性。","四世三公，名冠天下。",7,9000,20,50,1,0,0,"73|75|144",1,2400000,1,10,0,},
        [67] = {1413,"    颜良    变身卡","颜良变身卡",4,413,413,0,"主角颜良变身卡，穿戴之后可以拥有颜良变身卡技能、天赋、神兵特性，同时拥有董卓变身卡，貂蝉变身卡，孔融变身卡，蔡文姬变身卡，可以激活额外属性。","快来与我等决一死战！",17,40,20,50,1,0,0,"74|76|91|92",1,800000,1,10,20,},
        [68] = {1402,"    华佗    变身卡","华佗变身卡",5,402,402,0,"主角华佗变身卡，穿戴之后可以拥有华佗变身卡技能、天赋、神兵特性，同时拥有貂蝉身卡，蔡文姬变身卡，张角（红）可以激活额外属性。","早睡早起，方能养生！",1,1200,17,40,1,0,0,"89|90|132",1,2400000,1,30,10,},
        [69] = {1404,"    貂蝉    变身卡","貂蝉变身卡",5,404,404,0,"主角貂蝉变身卡，穿戴之后可以拥有貂蝉变身卡技能、天赋、神兵特性，同时拥有华佗变身卡，颜良变身卡，袁绍（红）可以激活额外属性。","夫君，你要替妾身做主啊~",7,9000,20,50,1,0,0,"89|91|96",1,2400000,1,5,0,},
        [70] = {191111,"    曹丕    变身卡","曹丕变身卡",6,111,91111,1,"主角曹丕变身卡，穿戴之后可以拥有曹丕变身卡技能、天赋、神兵特性，同时拥有甄姬、夏侯惇（红）变身卡，曹操变身卡可以激活额外属性。","给我翻过来！",1,1800,17,80,1,0,0,"93|105|161",1,4800000,2,0,-20,},
        [71] = {191205,"    关羽    变身卡","关羽变身卡",6,205,91205,1,"主角关羽变身卡，穿戴之后可以拥有关羽变身卡技能、天赋、神兵特性，同时拥有张飞、马超（红）变身卡可以激活额外属性。","观尔乃插标卖首。",1,1800,17,80,1,0,0,"94|106",1,4800000,2,20,-10,},
        [72] = {191308,"    甘宁    变身卡","甘宁变身卡",6,308,91308,1,"主角甘宁变身卡，穿戴之后可以拥有甘宁变身卡技能、天赋、神兵特性，同时拥有陆逊、吕蒙（红）变身卡，可以激活额外属性。","接招吧！",1,1800,17,80,1,0,0,"95|107",1,4800000,2,20,0,},
        [73] = {191411,"    袁绍    变身卡","袁绍变身卡",6,411,91411,1,"主角袁绍变身卡，穿戴之后可以拥有袁绍变身卡技能、天赋、神兵特性，同时拥有貂蝉、董卓（红）变身卡，可以激活额外属性。","四世三公，名冠天下。",7,13500,20,100,1,0,0,"96|108",1,4800000,2,10,0,},
        [74] = {191105,"  夏侯惇  变身卡","夏侯惇变身卡",6,105,91105,1,"主角夏侯惇变身卡，穿戴之后可以拥有夏侯惇变身卡技能、天赋、神兵特性，同时拥有张郃、曹丕（红）变身卡，可以激活额外属性。","以彼之道，还施彼身！",7,13500,20,100,1,0,0,"97|105",1,4800000,2,0,0,},
        [75] = {191207,"    马超    变身卡","马超变身卡",6,207,91207,1,"主角马超变身卡，穿戴之后可以拥有变身卡技能、天赋、神兵特性，同时拥有庞统、关羽（红）变身卡，可以激活额外属性。","全军突击！！！",7,13500,16,80,1,0,0,"98|106",1,4800000,2,10,0,},
        [76] = {191307,"    吕蒙    变身卡","吕蒙变身卡",6,307,91307,1,"主角吕蒙变身卡，穿戴之后可以拥有吕蒙变身卡技能、天赋、神兵特性，同时拥有太史慈、甘宁（红）变身卡，可以激活额外属性。","攻城为下，攻心为上。",7,13500,17,80,1,0,0,"99|107",1,4800000,2,15,0,},
        [77] = {191405,"    董卓    变身卡","董卓变身卡",6,405,91405,1,"主角董卓变身卡，穿戴之后可以拥有董卓变身卡技能、天赋、神兵特性，同时拥有公孙瓒、袁绍（红）变身卡，可以激活额外属性。","嘿嘿嘿，美人儿，来，香一个~",7,13500,18,80,1,0,0,"100|108",1,4800000,2,0,-30,},
        [78] = {191108,"    许褚    变身卡","许褚变身卡",6,108,91108,1,"主角许褚变身卡，穿戴之后可以拥有许褚变身卡技能、天赋、神兵特性，同时拥有典韦、荀彧（红）变身卡，可以激活额外属性。","谁来和我大战三百回合！",1,1800,17,80,1,0,0,"101|109",1,4800000,2,-40,0,},
        [79] = {191208,"    黄忠    变身卡","黄忠变身卡",6,208,91208,1,"主角黄忠变身卡，穿戴之后可以拥有黄忠变身卡技能、天赋、神兵特性，同时拥有魏延、刘备（红）变身卡，可以激活额外属性。","烈弓之下片甲不留！",1,1800,17,80,1,0,0,"102|110",1,4800000,2,10,0,},
        [80] = {191310,"  孙尚香  变身卡","孙尚香变身卡",6,310,91310,1,"主角孙尚香变身卡，穿戴之后可以拥有孙尚香变身卡技能、天赋、神兵特性，同时拥有大乔、大乔（红）变身卡，可以激活额外属性。","夫君，身体要紧~",1,1800,17,80,1,0,0,"103|111",1,4800000,2,-20,-30,},
        [81] = {191407,"    贾诩    变身卡","贾诩变身卡",6,407,91407,1,"主角贾诩变身卡，穿戴之后可以拥有贾诩变身卡技能、天赋、神兵特性，同时拥有于吉、华佗（红）变身卡，可以激活额外属性。","我要你三更死，谁敢留你到五更！",7,13500,20,100,1,0,0,"104|112",1,4800000,2,15,10,},
        [82] = {191102,"    荀彧    变身卡","荀彧变身卡",6,102,91102,1,"主角荀彧变身卡，穿戴之后可以拥有荀彧变身卡技能、天赋、神兵特性，同时拥有郭嘉、许褚（红）变身卡，可以激活额外属性。","秉忠贞之志，守谦退之节。",1,1800,17,80,1,0,0,"109|113",1,4800000,2,0,0,},
        [83] = {191202,"    刘备    变身卡","刘备变身卡",6,202,91202,1,"主角刘备变身卡，穿戴之后可以拥有刘备变身卡技能、天赋、神兵特性，同时拥有徐庶、黄忠（红）变身卡，赵云变身卡可以激活额外属性。","惟贤惟德，仁服于人！",1,1800,17,80,1,0,0,"110|114|154",1,4800000,2,20,0,},
        [84] = {191302,"    大乔    变身卡","大乔变身卡",6,302,91302,1,"主角大乔变身卡，穿戴之后可以拥有大乔变身卡技能、天赋、神兵特性，同时拥有鲁肃、孙尚香（红）变身卡，可以激活额外属性。","旅途劳顿，请休息吧。",1,1800,17,80,1,0,0,"111|115",1,4800000,2,25,20,},
        [85] = {191402,"    华佗    变身卡","华佗变身卡",6,402,91402,1,"主角华佗变身卡，穿戴之后可以拥有华佗变身卡技能、天赋、神兵特性，同时拥有华雄、贾诩（红），可以激活额外属性。","早睡早起，方能养生！",1,1800,17,80,1,0,0,"112|116",1,4800000,2,30,10,},
        [86] = {191107,"    典韦    变身卡","典韦变身卡",6,107,91107,1,"主角典韦变身卡，穿戴之后可以拥有典韦变身卡技能、天赋、神兵特性，同时拥有曹仁、张郃（红）变身卡，可以激活额外属性。","主公！快走……",1,1800,17,80,1,0,0,"117|125",1,4800000,2,0,0,},
        [87] = {191209,"    姜维    变身卡","姜维变身卡",6,209,91209,1,"主角姜维变身卡，穿戴之后可以拥有姜维变身卡技能、天赋、神兵特性，同时拥有黄忠、庞统（红）变身卡，可以激活额外属性。","先帝之志，丞相之托，不可忘也！",1,1800,17,80,1,0,0,"118|126",1,4800000,2,20,20,},
        [88] = {191306,"   孙权    变身卡","孙权变身卡",6,306,91306,1,"主角孙权变身卡，穿戴之后可以拥有孙权变身卡技能、天赋、神兵特性，同时拥有吕蒙、小乔（红）变身卡，孙策变身卡可以激活额外属性。","且慢，容我三思。",1,1800,17,80,1,0,0,"119|127|155",1,4800000,2,0,30,},
        [89] = {191406,"    华雄    变身卡","华雄变身卡",6,406,91406,1,"主角华雄变身卡，穿戴之后可以拥有华雄变身卡技能、天赋、神兵特性，同时拥有贾诩、袁术（红）变身卡，吕布变身卡可以激活额外属性。","好大一股酒气啊。",1,1800,17,80,1,0,0,"120|128|164",1,4800000,2,10,20,},
        [90] = {191110,"    张郃    变身卡","张郃变身卡",6,110,91110,1,"主角张郃变身卡，穿戴之后可以拥有张郃变身卡技能、天赋、神兵特性，同时拥有曹丕、典韦（红）变身卡，可以激活额外属性。","用兵之道，变化万千。",1,1800,17,80,1,0,0,"121|125",1,4800000,2,0,0,},
        [91] = {191211,"    庞统    变身卡","庞统变身卡",6,211,91211,1,"主角庞统变身卡，穿戴之后可以拥有庞统变身卡技能、天赋、神兵特性，同时拥有黄月英、姜维（红）变身卡可以激活额外属性。","浴火重生！",1,1800,17,80,1,0,0,"122|126",1,4800000,2,-80,10,},
        [92] = {191304,"    小乔    变身卡","小乔变身卡",6,304,91304,1,"主角小乔变身卡，穿戴之后可以拥有小乔变身卡技能、天赋、神兵特性，同时拥有孙尚香、孙权（红）变身卡，周瑜变身卡可以激活额外属性。","替我挡着~",1,1800,17,80,1,0,0,"123|127|163",1,4800000,2,15,-20,},
        [93] = {191412,"    袁术    变身卡","袁术变身卡",6,412,91412,1,"主角袁术变身卡，穿戴之后可以拥有袁术变身卡技能、天赋、神兵特性，同时拥有张角、华雄（红）变身卡，可以激活额外属性。","玉玺在手，天下我有！",1,1800,17,80,1,0,0,"124|128",1,4800000,2,0,10,},
        [94] = {191104,"    郭嘉    变身卡","郭嘉变身卡",6,104,91104,1,"主角郭嘉变身卡，穿戴之后可以拥有郭嘉变身卡技能、天赋、神兵特性，同时拥有荀彧变身卡，张辽（红）变身卡，司马懿变身卡可以激活额外属性。","咳，咳……",1,1800,17,80,1,0,0,"129|137|153",1,4800000,2,0,0,},
        [95] = {191212,"    徐庶    变身卡","徐庶变身卡",6,212,91212,1,"主角徐庶变身卡，穿戴之后可以拥有徐庶变身卡技能、天赋、神兵特性，同时拥有关羽变身卡，黄月英（红）变身卡，诸葛亮变身卡可以激活额外属性。","一切尽在不言中。",1,1800,17,80,1,0,0,"130|138|162",1,4800000,2,20,-20,},
        [96] = {191312,"    鲁肃    变身卡","鲁肃变身卡",6,312,91312,1,"主角鲁肃变身卡，穿戴之后可以拥有鲁肃变身卡技能、天赋、神兵特性，同时拥有小乔变身卡，太史慈（红）变身卡可以激活额外属性。","来来来，见面分一半。",7,13500,20,100,1,0,0,"131|139",1,4800000,2,15,-20,},
        [97] = {191409,"    张角    变身卡","张角变身卡",6,409,91409,1,"主角张角变身卡，穿戴之后可以拥有张角变身卡技能、天赋、神兵特性，同时拥有华佗变身卡，貂蝉（红）变身卡可以激活额外属性。","以我之真气，合天地之造化！",1,1800,17,80,1,0,0,"132|140",1,4800000,2,10,10,},
        [98] = {191109,"    张辽    变身卡","张辽变身卡",6,109,91109,1,"主角张辽变身卡，穿戴之后可以拥有张辽变身卡技能、天赋、神兵特性，同时拥有夏侯惇变身卡，郭嘉（红）变身卡可以激活额外属性。","没想到吧！",1,1800,17,80,1,0,0,"133|137",1,4800000,2,20,0,},
        [99] = {191204,"  黄月英  变身卡","黄月英变身卡",6,204,91204,1,"主角黄月英变身卡，穿戴之后可以拥有黄月英变身卡技能、天赋、神兵特性，同时拥有刘备变身卡，徐庶（红）变身卡，可以激活额外属性。","驭巧器，已取先机。",7,13500,20,100,1,0,0,"134|138",1,4800000,2,30,0,},
        [100] = {191305,"  太史慈  变身卡","太史慈变身卡",6,305,91305,1,"主角太史慈变身卡，穿戴之后可以拥有太史慈变身卡技能、天赋、神兵特性，同时拥有孙权变身卡，鲁肃（红）变身卡，可以激活额外属性。","我当要替天行道！",1,1800,17,80,1,0,0,"135|139",1,4800000,2,15,25,},
        [101] = {191404,"    貂蝉    变身卡","貂蝉变身卡",6,404,91404,1,"主角貂蝉变身卡，穿戴之后可以拥有貂蝉变身卡技能、天赋、神兵特性，同时拥有董卓变身卡，张角（红）变身卡，可以激活额外属性。","夫君，你要替妾身做主啊~",7,13500,20,100,1,0,0,"136|140",1,4800000,2,5,0,},
        [102] = {191106,"    曹仁    变身卡","曹仁变身卡",6,106,91106,1,"主角曹仁变身卡，穿戴之后可以拥有曹仁变身卡技能、天赋、神兵特性，同时拥有许褚变身卡，甄姬（红）变身卡可以激活额外属性。","敌军围困万千重，我自岿然不动！",1,1800,17,80,1,0,0,"141|149",1,4800000,2,-20,20,},
        [103] = {191206,"    张飞    变身卡","张飞变身卡",6,206,91206,1,"主角张飞变身卡，穿戴之后可以拥有张飞变身卡技能、天赋、神兵特性，同时拥有马超变身卡，魏延（红）变身卡可以激活额外属性。","燕人张飞在此！",7,13500,19,100,1,0,0,"142|150",1,4800000,2,0,-10,},
        [104] = {191309,"    孙坚    变身卡","孙坚变身卡",6,309,91309,1,"主角孙坚变身卡，穿戴之后可以拥有孙坚变身卡技能、天赋、神兵特性，同时拥有甘宁变身卡，陆逊（红）变身卡可以激活额外属性。","以吾魂魄，保佑吾儿之基业英魂。",7,13500,20,100,1,0,0,"143|151",1,4800000,2,-30,0,},
        [105] = {191408,"  公孙瓒  变身卡","公孙瓒变身卡",6,408,91408,1,"主角公孙瓒变身卡，穿戴之后可以拥有公孙瓒变身卡技能、天赋、神兵特性，同时拥有袁绍变身卡，于吉（红）变身卡可以激活额外属性。","众将听令，排好阵势，御敌！",7,13500,19,100,1,0,0,"144|152",1,4800000,2,20,30,},
        [106] = {191112,"    甄姬    变身卡","甄姬变身卡",6,112,91112,1,"主角甄姬变身卡，穿戴之后可以拥有甄姬变身卡技能、天赋、神兵特性，同时拥有张辽变身卡，曹仁（红）变身卡，可以激活额外属性。","凌波微步，罗袜生尘。",7,13500,20,100,1,0,0,"145|149",1,4800000,2,20,20,},
        [107] = {191210,"    魏延    变身卡","魏延变身卡",6,210,91210,1,"主角魏延变身卡，穿戴之后可以拥有魏延变身卡技能、天赋、神兵特性，同时拥有姜维变身卡，张飞（红）变身卡，可以激活额外属性。","哼，也不看看我是何人。",7,13500,20,100,1,0,0,"146|150",1,4800000,2,20,-10,},
        [108] = {191311,"    陆逊    变身卡","陆逊变身卡",6,311,91311,1,"主角陆逊变身卡，穿戴之后可以拥有陆逊变身卡技能、天赋、神兵特性，同时拥有孙坚变身卡，孙坚（红）变身卡，可以激活额外属性。","国之大计，审势为先。",1,1800,17,80,1,0,0,"147|151",1,4800000,2,-10,-10,},
        [109] = {191410,"    于吉    变身卡","于吉变身卡",6,410,91410,1,"主角于吉变身卡，穿戴之后可以拥有于吉变身卡技能、天赋、神兵特性，同时拥有袁术变身卡，公孙瓒（红）变身卡，左慈变身卡可以激活额外属性。","如真似幻，扑朔迷离。",1,1800,17,80,1,0,0,"148|152|156",1,4800000,2,20,20,},
        [110] = {1101,"  司马懿  变身卡","司马懿变身卡",6,101,101,0,"主角司马懿变身卡，穿戴之后可以拥有司马懿变身卡技能、天赋、神兵特性。同时拥有曹操变身卡、郭嘉（红）变身卡，可以激活额外属性。","智者务其实，愚者争虚名",1,2400,17,120,1,0,0,"153|157",1,7200000,2,-10,-20,},
        [111] = {1103,"    曹操    变身卡","曹操变身卡",6,103,103,0,"主角曹操变身卡，穿戴之后可以拥有曹操变身卡技能、天赋、神兵特性。同时拥有司马懿变身卡，曹丕（红）变身卡，可以激活额外属性。","宁我负人，毋人负我",7,18000,20,140,1,0,0,"157|161",1,7200000,2,0,0,},
        [112] = {1201,"    赵云    变身卡","赵云变身卡",6,201,201,0,"主角赵云变身卡，穿戴之后可以拥有赵云变身卡技能、天赋、神兵特性。同时拥有诸葛亮变身卡，刘备（红）变身卡，可以激活额外属性。","能进能退，乃真正法器",1,2400,17,120,1,0,0,"154|158",1,7200000,2,0,0,},
        [113] = {1203,"  诸葛亮  变身卡","诸葛亮变身卡",6,203,203,0,"主角诸葛亮变身卡，穿戴之后可以拥有诸葛亮变身卡技能、天赋、神兵特性。同时拥有赵云变身卡，徐庶（红）变身卡，可以激活额外属性。","此计可助我军大获全胜",7,18000,20,140,1,0,0,"158|162",1,7200000,2,0,-20,},
        [114] = {1301,"    孙策    变身卡","孙策变身卡",6,301,301,0,"主角孙策变身卡，穿戴之后可以拥有孙策变身卡技能、天赋、神兵特性。同时拥有周瑜变身卡，孙权（红）变身卡，可以激活额外属性。","江东子弟何惧于天下",1,2400,17,120,1,0,0,"155|159",1,7200000,2,20,-10,},
        [115] = {1303,"    周瑜    变身卡","周瑜变身卡",6,303,303,0,"主角周瑜变身卡，穿戴之后可以拥有周瑜变身卡技能、天赋、神兵特性。同时拥有孙策变身卡，小乔（红）变身卡，可以激活额外属性。","既生瑜何生亮",7,18000,20,140,1,0,0,"159|163",1,7200000,2,20,0,},
        [116] = {1401,"    左慈    变身卡","左慈变身卡",6,401,401,0,"主角左慈变身卡，穿戴之后可以拥有左慈变身卡技能、天赋、神兵特性。同时拥有吕布变身卡，于吉（红）变身卡，可以激活额外属性。","肉眼凡胎，岂能窥视仙人变换",7,18000,20,140,1,0,0,"156|160",1,7200000,2,10,0,},
        [117] = {1403,"    吕布    变身卡","吕布变身卡",6,403,403,0,"主角吕布变身卡，穿戴之后可以拥有吕布变身卡技能、天赋、神兵特性。同时拥有左慈变身卡，华雄（红）变身卡，可以激活额外属性。","谁能挡我？！",1,2400,17,120,1,0,0,"160|164",1,7200000,2,0,-30,},
    }
}

-- index
local __index_id = {
    [0] = 1,
    [1101] = 110,
    [1102] = 17,
    [1103] = 111,
    [1104] = 10,
    [1105] = 11,
    [1106] = 2,
    [1107] = 14,
    [1108] = 15,
    [1109] = 7,
    [1110] = 3,
    [1111] = 18,
    [1112] = 8,
    [1113] = 4,
    [1114] = 9,
    [1115] = 5,
    [1116] = 12,
    [1117] = 13,
    [1118] = 16,
    [1119] = 6,
    [1201] = 112,
    [1202] = 34,
    [1203] = 113,
    [1204] = 24,
    [1205] = 19,
    [1206] = 20,
    [1207] = 27,
    [1208] = 28,
    [1209] = 31,
    [1210] = 35,
    [1211] = 32,
    [1212] = 25,
    [1213] = 21,
    [1214] = 22,
    [1215] = 23,
    [1216] = 29,
    [1217] = 26,
    [1218] = 33,
    [1219] = 30,
    [1301] = 114,
    [1302] = 51,
    [1303] = 115,
    [1304] = 36,
    [1305] = 41,
    [1306] = 44,
    [1307] = 45,
    [1308] = 37,
    [1309] = 52,
    [1310] = 48,
    [1311] = 42,
    [1312] = 49,
    [1313] = 50,
    [1314] = 38,
    [1315] = 43,
    [1316] = 46,
    [1317] = 39,
    [1318] = 40,
    [1319] = 47,
    [1401] = 116,
    [1402] = 68,
    [1403] = 117,
    [1404] = 69,
    [1405] = 65,
    [1406] = 61,
    [1407] = 62,
    [1408] = 53,
    [1409] = 58,
    [1410] = 54,
    [1411] = 66,
    [1412] = 59,
    [1413] = 67,
    [1414] = 63,
    [1415] = 64,
    [1416] = 55,
    [1417] = 60,
    [1418] = 56,
    [1419] = 57,
    [191102] = 82,
    [191104] = 94,
    [191105] = 74,
    [191106] = 102,
    [191107] = 86,
    [191108] = 78,
    [191109] = 98,
    [191110] = 90,
    [191111] = 70,
    [191112] = 106,
    [191202] = 83,
    [191204] = 99,
    [191205] = 71,
    [191206] = 103,
    [191207] = 75,
    [191208] = 79,
    [191209] = 87,
    [191210] = 107,
    [191211] = 91,
    [191212] = 95,
    [191302] = 84,
    [191304] = 92,
    [191305] = 100,
    [191306] = 88,
    [191307] = 76,
    [191308] = 72,
    [191309] = 104,
    [191310] = 80,
    [191311] = 108,
    [191312] = 96,
    [191402] = 85,
    [191404] = 101,
    [191405] = 77,
    [191406] = 89,
    [191407] = 81,
    [191408] = 105,
    [191409] = 97,
    [191410] = 109,
    [191411] = 73,
    [191412] = 93,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in avatar")
        return t._raw[__key_map[k]]
    end
}

-- 
function avatar.length()
    return #avatar._data
end

-- 
function avatar.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function avatar.indexOf(index)
    if index == nil or not avatar._data[index] then
        return nil
    end

    return setmetatable({_raw = avatar._data[index]}, mt)
end

--
function avatar.get(id)
    
    return avatar.indexOf(__index_id[id])
        
end

--
function avatar.set(id, tkey, nvalue)
    local record = avatar.get(id)
    if record then
        local keyIndex = __key_map[tkey]
        if keyIndex then
            record._raw[keyIndex] = nvalue
        end
    end
end

--
function avatar.index()
    return __index_id
end

return avatar