--gemstone

-- key
local __key_map = {
  id = 1,    --id-int 
  name = 2,    --名称-string 
  color = 3,    --品质-int 
  res_id = 4,    --资源id-int 
  bag_description = 5,    --背包描述-string 
  description = 6,    --装备描述-string 
  fragment_id = 7,    --碎片id-int 
  sorting = 8,    --排序-int 
  attribute_type1 = 9,    --属性1类型-int 
  attribute_value1 = 10,    --属性1类型值-int 
  attribute_type2 = 11,    --属性2类型-int 
  attribute_value2 = 12,    --属性2类型值-int 
  attribute_type3 = 13,    --属性3类型-int 
  attribute_value3 = 14,    --属性3类型值-int 
  attribute_type4 = 15,    --属性4类型-int 
  attribute_value4 = 16,    --属性4类型值-int 

}

-- data
local gemstone = {
    _data = {
        [1] = {101,"绿晶攻击宝石",2,101,"晶莹璀璨的宝石，通体绿莹莹，摸起来凉凉的。","绿莹莹晶莹璀璨的宝石，通体绿莹莹，摸起来凉凉的。",8101,60,1,100,0,0,0,0,0,0,},
        [2] = {102,"绿晶防御宝石",2,102,"晶莹璀璨的宝石，通体绿莹莹，摸起来凉凉的。","绿莹莹晶莹璀璨的宝石，通体绿莹莹，摸起来凉凉的。",8102,59,5,50,6,50,0,0,0,0,},
        [3] = {103,"绿晶生命宝石",2,103,"晶莹璀璨的宝石，通体绿莹莹，摸起来凉凉的。","绿莹莹晶莹璀璨的宝石，通体绿莹莹，摸起来凉凉的。",8103,58,7,750,0,0,0,0,0,0,},
        [4] = {104,"绿晶觉醒卷轴",2,104,"孕育绿色宝石的原始卷轴，有不可思议的能量。","孕育绿色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8104,57,1,50,5,25,6,25,7,375,},
        [5] = {201,"蓝晶攻击宝石",3,201,"晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。","晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。",8201,56,1,130,0,0,0,0,0,0,},
        [6] = {202,"蓝晶防御宝石",3,202,"晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。","晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。",8202,55,5,65,6,65,0,0,0,0,},
        [7] = {203,"蓝晶生命宝石",3,203,"晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。","晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。",8203,54,7,975,0,0,0,0,0,0,},
        [8] = {204,"蓝晶觉醒卷轴",3,204,"孕育蓝色宝石的原始卷轴，有不可思议的能量。","孕育蓝色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8204,53,1,70,5,35,6,35,7,525,},
        [9] = {301,"海蓝攻击宝石",3,301,"晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。","晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。",8301,52,1,160,0,0,0,0,0,0,},
        [10] = {302,"海蓝防御宝石",3,302,"晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。","晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。",8302,51,5,80,6,80,0,0,0,0,},
        [11] = {303,"海蓝生命宝石",3,303,"晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。","晶莹璀璨的宝石，通体天蓝色，摸起来凉凉的。",8303,50,7,1200,0,0,0,0,0,0,},
        [12] = {304,"海蓝觉醒卷轴",3,304,"孕育蓝色宝石的原始卷轴，有不可思议的能量。","孕育蓝色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8304,49,1,80,5,40,6,40,7,600,},
        [13] = {401,"紫晶攻击宝石",4,401,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8401,48,1,200,0,0,0,0,0,0,},
        [14] = {402,"紫晶防御宝石",4,402,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8402,47,5,100,6,100,0,0,0,0,},
        [15] = {403,"紫晶生命宝石",4,403,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8403,46,7,1500,0,0,0,0,0,0,},
        [16] = {404,"紫晶觉醒卷轴",4,404,"孕育紫色宝石的原始卷轴，有不可思议的能量。","孕育紫色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8404,45,1,100,5,50,6,50,7,750,},
        [17] = {501,"紫耀攻击宝石",4,501,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8501,44,1,230,0,0,0,0,0,0,},
        [18] = {502,"紫耀防御宝石",4,502,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8502,43,5,115,6,115,0,0,0,0,},
        [19] = {503,"紫耀生命宝石",4,503,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8503,42,7,1725,0,0,0,0,0,0,},
        [20] = {504,"紫耀觉醒卷轴",4,504,"孕育紫色宝石的原始卷轴，有不可思议的能量。","孕育紫色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8504,41,1,120,5,60,6,60,7,900,},
        [21] = {601,"星空攻击宝石",4,601,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8601,40,1,260,0,0,0,0,0,0,},
        [22] = {602,"星空防御宝石",4,602,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8602,39,5,130,6,130,0,0,0,0,},
        [23] = {603,"星空生命宝石",4,603,"高级的紫宝石，摸起来凉凉的。","高级的紫宝石，摸起来凉凉的。",8603,38,7,1950,0,0,0,0,0,0,},
        [24] = {604,"星空觉醒卷轴",4,604,"孕育紫色宝石的原始卷轴，有不可思议的能量。","孕育紫色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8604,37,1,130,5,65,6,65,7,975,},
        [25] = {701,"黄晶攻击宝石",5,701,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8701,36,1,290,0,0,0,0,0,0,},
        [26] = {702,"黄晶防御宝石",5,702,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8702,35,5,145,6,145,0,0,0,0,},
        [27] = {703,"黄晶生命宝石",5,703,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8703,34,7,2175,0,0,0,0,0,0,},
        [28] = {704,"黄晶觉醒卷轴",5,704,"孕育橙色宝石的原始卷轴，有不可思议的能量。","孕育橙色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8704,33,1,150,5,75,6,75,7,1125,},
        [29] = {801,"龙晶攻击宝石",5,801,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8801,32,1,320,0,0,0,0,0,0,},
        [30] = {802,"龙晶防御宝石",5,802,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8802,31,5,160,6,160,0,0,0,0,},
        [31] = {803,"龙晶生命宝石",5,803,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8803,30,7,2400,0,0,0,0,0,0,},
        [32] = {804,"龙晶觉醒卷轴",5,804,"孕育橙色宝石的原始卷轴，有不可思议的能量。","孕育橙色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8804,29,1,160,5,80,6,80,7,1200,},
        [33] = {901,"太阳攻击宝石",5,901,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8901,28,1,360,0,0,0,0,0,0,},
        [34] = {902,"太阳防御宝石",5,902,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8902,27,5,180,6,180,0,0,0,0,},
        [35] = {903,"太阳生命宝石",5,903,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",8903,26,7,2700,0,0,0,0,0,0,},
        [36] = {904,"太阳觉醒卷轴",5,904,"孕育橙色宝石的原始卷轴，有不可思议的能量。","孕育橙色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",8904,25,1,180,5,90,6,90,7,1350,},
        [37] = {1001,"璀璨攻击宝石",5,1001,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",81001,24,1,390,0,0,0,0,0,0,},
        [38] = {1002,"璀璨防御宝石",5,1002,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",81002,23,5,195,6,195,0,0,0,0,},
        [39] = {1003,"璀璨生命宝石",5,1003,"顶级宝石，通体发橙光，摸起来凉凉的。","顶级宝石，通体发橙光，摸起来凉凉的。",81003,22,7,2925,0,0,0,0,0,0,},
        [40] = {1004,"璀璨觉醒卷轴",5,1004,"孕育橙色宝石的原始卷轴，有不可思议的能量。","孕育橙色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",81004,21,1,200,5,100,6,100,7,1500,},
        [41] = {1101,"红晶攻击宝石",6,1101,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81101,20,1,420,0,0,0,0,0,0,},
        [42] = {1102,"红晶防御宝石",6,1102,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81102,19,5,210,6,210,0,0,0,0,},
        [43] = {1103,"红晶生命宝石",6,1103,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81103,18,7,3150,0,0,0,0,0,0,},
        [44] = {1104,"红晶觉醒卷轴",6,1104,"孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。","孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",81104,17,1,210,5,105,6,105,7,1575,},
        [45] = {1201,"赤焰攻击宝石",6,1201,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81201,16,1,440,0,0,0,0,0,0,},
        [46] = {1202,"赤焰防御宝石",6,1202,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81202,15,5,220,6,220,0,0,0,0,},
        [47] = {1203,"赤焰生命宝石",6,1203,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81203,14,7,3300,0,0,0,0,0,0,},
        [48] = {1204,"赤焰觉醒卷轴",6,1204,"孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。","孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",81204,13,1,220,5,110,6,110,7,1650,},
        [49] = {1301,"血月攻击宝石",6,1301,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81301,12,1,460,0,0,0,0,0,0,},
        [50] = {1302,"血月防御宝石",6,1302,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81302,11,5,230,6,230,0,0,0,0,},
        [51] = {1303,"血月生命宝石",6,1303,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81303,10,7,3450,0,0,0,0,0,0,},
        [52] = {1304,"血月觉醒卷轴",6,1304,"孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。","孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",81304,9,1,230,5,115,6,115,7,1725,},
        [53] = {1401,"辉煌攻击宝石",6,1401,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81401,8,1,480,0,0,0,0,0,0,},
        [54] = {1402,"辉煌防御宝石",6,1402,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81402,7,5,240,6,240,0,0,0,0,},
        [55] = {1403,"辉煌生命宝石",6,1403,"顶级宝石，通体发红光，摸起来凉凉的。","顶级宝石，通体发红光，摸起来凉凉的。",81403,6,7,3600,0,0,0,0,0,0,},
        [56] = {1404,"辉煌觉醒卷轴",6,1404,"孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。","孕育红色宝石的原始卷轴，听说威力巨大，有不可思议的能量。",81404,5,1,240,5,120,6,120,7,1800,},
    }
}

-- index
local __index_id = {
    [1001] = 37,
    [1002] = 38,
    [1003] = 39,
    [1004] = 40,
    [101] = 1,
    [102] = 2,
    [103] = 3,
    [104] = 4,
    [1101] = 41,
    [1102] = 42,
    [1103] = 43,
    [1104] = 44,
    [1201] = 45,
    [1202] = 46,
    [1203] = 47,
    [1204] = 48,
    [1301] = 49,
    [1302] = 50,
    [1303] = 51,
    [1304] = 52,
    [1401] = 53,
    [1402] = 54,
    [1403] = 55,
    [1404] = 56,
    [201] = 5,
    [202] = 6,
    [203] = 7,
    [204] = 8,
    [301] = 9,
    [302] = 10,
    [303] = 11,
    [304] = 12,
    [401] = 13,
    [402] = 14,
    [403] = 15,
    [404] = 16,
    [501] = 17,
    [502] = 18,
    [503] = 19,
    [504] = 20,
    [601] = 21,
    [602] = 22,
    [603] = 23,
    [604] = 24,
    [701] = 25,
    [702] = 26,
    [703] = 27,
    [704] = 28,
    [801] = 29,
    [802] = 30,
    [803] = 31,
    [804] = 32,
    [901] = 33,
    [902] = 34,
    [903] = 35,
    [904] = 36,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in gemstone")
        return t._raw[__key_map[k]]
    end
}

-- 
function gemstone.length()
    return #gemstone._data
end

-- 
function gemstone.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function gemstone.indexOf(index)
    if index == nil or not gemstone._data[index] then
        return nil
    end

    return setmetatable({_raw = gemstone._data[index]}, mt)
end

--
function gemstone.get(id)
    
    return gemstone.indexOf(__index_id[id])
        
end

--
function gemstone.set(id, key, value)
    local record = gemstone.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function gemstone.index()
    return __index_id
end

return gemstone