--instrument

-- key
local __key_map = {
  id = 1,    --id-int 
  name = 2,    --名称-string 
  instrument_description = 3,    --神兵描述-string 
  hero = 4,    --相关武将-string 
  color = 5,    --品质-int 
  res = 6,    --资源-int 
  description = 7,    --神兵+25特性描述-string 
  unlock = 8,    --神兵技能解锁阶层-int 
  unlock_1 = 9,    --神兵技能解锁阶层1-int 
  level_max = 10,    --进阶等级上限-int 
  cost = 11,    --进阶模板ID-int 
  instrument_rank_1 = 12,    --界限突破模板ID-int 
  instrument_rank_icon = 13,    --界限突破ICON-int 
  instrument_rank_icon_2 = 14,    --界限突破ICON2-int 
  sell = 15,    --分解神兵之魂-int 
  fragment_id = 16,    --碎片id-int 
  item_id = 17,    --进阶消耗万能神兵道具id-int 
  universal = 18,    --进阶消耗万能神兵数量-int 
  talent_attr_1 = 19,    --特性属性类型1-int 
  talent_value_1 = 20,    --特性属性值1-int 
  description_1 = 21,    --神兵+50特性描述-string 
  unlock_2 = 22,    --神兵技能解锁阶层2-int 
  talent_attr_2 = 23,    --特性属性类型2-int 
  talent_value_2 = 24,    --特性属性值2-int 
  description_2 = 25,    --神兵+75特性描述-string 
  unlock_3 = 26,    --神兵技能解锁阶层3-int 
  talent_attr_3 = 27,    --特性属性类型3-int 
  talent_value_3 = 28,    --特性属性值3-int 
  description_3 = 29,    --神兵+100特性描述-string 
  halo_target = 30,    --光环目标-int 
  halo_attr = 31,    --光环属性类型-int 
  halo_value = 32,    --光环属性值-int 
  change_type = 33,    --置换规则-int 

}

-- data
local instrument = {
    _data = {
        [1] = {1,"裂天龙胆枪","镶嵌龙胆宝石的玄铁长枪，坚不可摧，蕴含裂天之力。","男主角",5,1,"技能造成的伤害增加25%",25,50,100,2,1,911,921,2000,4001,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [2] = {2,"傲世鸣鸿刀","相传为黄帝铸造的宝刀，华贵无比，刃如秋霜，削铁如泥。","女主角",5,2,"技能造成的伤害增加25%",25,50,100,2,1,912,922,2000,4002,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [3] = {101,"枭首杖","枭首法杖，利刃如霜，寒光凛冽，枭首羽毛点缀其间，阴气森然，神鬼惧怕，鬼才名不虚传。","司马懿",6,101,"释放技能有40%概率追加1次技能，对敌方全体造成41%法术伤害（追加的技能不附带特性）",25,50,100,3,2,0,94101,4000,4101,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [4] = {102,"碧玉箫","君子无暇，碧玉剔透，荀令君所持的碧玉萧通体温润，丝丝流光从内透出，蕴含无限生机。","荀彧",5,102,"技能造成的治疗量增加25%",25,50,100,2,1,91102,92102,2000,4102,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [5] = {103,"孟德剑","魏武帝曹操所持佩剑，通体华贵，长八尺有余，剑身宽大，陪伴曹操半生戎马生涯，立功无数。话说曹总的武器怎么可能差。","曹操",6,103,"全体上阵武将暴击几率增加30%",25,50,100,3,2,0,94103,4000,4103,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",2,15,300,0,},
        [6] = {104,"千军扇","持此扇若登高望远，千军万马俱在眼前，郭奉孝运筹帷幄，智计无双，助曹操打下半壁江山。","郭嘉",5,104,"释放技能后，回复自身1点怒气",25,50,100,2,1,91104,92104,2000,4104,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [7] = {105,"刚烈修罗刀","刚烈哥的修罗刀，刀刃化刺，通体暗红，携带此刀上战场，狂刀嗜血，越战越勇。","夏侯惇",5,105,"受到普通攻击直接伤害时，回复自身1点怒气",25,50,100,2,1,91105,92105,2000,4105,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [8] = {106,"狮首玄铁盾","曹坦克的武器自然坚不可摧，固若金汤，坦克之名并非浪得虚名。","曹仁",5,106,"死亡时100%眩晕击杀自己的敌方武将",25,50,100,2,1,91106,92106,2000,4106,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [9] = {107,"恶来双手戟","典韦双戟重八十斤，稳如泰山，以一挡十，逐虎出涧，勇猛无双。","典韦",5,107,"技能造成的伤害增加25%",25,50,100,2,1,91107,92107,2000,4107,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [10] = {108,"狼牙流星锤","此流星锤非同一般，遍布倒刺，固若金汤，铿锵有力，入万军丛中，挥舞起来可连伤数人。","许褚",5,108,"直接伤害击杀目标后，回复自身1点怒气",25,50,100,2,1,91108,92108,2000,4108,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [11] = {109,"破天钩镰刀","长柄钩镰刀，一头刀，一头刺，上阵杀敌灵活运用，可刺可砍可钩，让敌军防不胜防。","张辽",5,109,"每回合回复自身1点怒气",25,50,100,2,1,91109,92109,2000,4109,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [12] = {110,"绝汲透骨爪","双爪六刺，阴寒冷酷，破颅透骨，料敌先机，贴近敌人可瞬间取其性命。","张郃",5,110,"全体上阵武将暴击几率增加20%",25,50,100,2,1,91110,92110,2000,4110,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",2,15,200,0,},
        [13] = {111,"幽皇灭魂爪","吸取无尽黑暗之气，肃清无规、无序、无章之魂，子桓怒吼“给我翻过来！”，我就问你怕不怕！！！","曹丕",5,111,"技能目标每减少1个，技能伤害增加10%",25,50,100,2,1,91111,92111,2000,4111,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [14] = {112,"洛神碎云鞭","此鞭内有机关，生有倒刺，可散开成辫，可闭合成刺，或攻或守，或缠或刺，变化万端，如洛神之舞，又如灵蛇出洞，使人眼花缭乱","甄姬",5,112,"技能直接伤害的50%转化为生命，治疗己方生命最低的队友",25,50,100,2,1,91112,92112,2000,4112,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [15] = {113,"转轮手里剑","乐进少年的时候曾到过西域游历，师从金轮法王学习武艺，出师之后，金轮法王将此武器赐给乐进。","乐进",4,113,"普通攻击直接伤害的50%转化为治疗，治疗自己",10,0,10,1,0,0,0,500,4113,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [16] = {114,"利刃长柄斧","徐晃太爱他的飘布头盔了，为了与之相配，重金觅得此斧，因为与他的头盔特别相配，都是白闪闪的一片。","徐晃",4,114,"上场第1回合造成的伤害必定暴击",10,0,10,1,0,0,0,500,4114,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [17] = {115,"连枷象","曹冲称象一共有三步，第一步把大象放在秤盘上，第二步开始称，第三步开始说一个数字。如果有人不信，就怼他，那你称称看。","曹冲",4,115,"释放技能附带沉默效果的概率增加至70%",10,0,10,1,0,0,0,500,4115,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [18] = {116,"云纹毫","曹植写下：煮豆燃豆萁，豆在釜中泣，本是同根生，相煎何太急。奈何，曹植你看中的可是你哥哥的老婆啊。","曹植",4,116,"释放技能附带眩晕效果的概率增加至80%",10,0,10,1,0,0,0,500,4116,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [19] = {117,"猎豹弓","此弓不容小觑，猎豹兽首挡住手腕部分，箭矢可从猎豹口中射出，更添准头与速度，所以射出的箭矢更加风驰电掣，疾行如猎豹。","夏侯渊",4,117,"技能直接伤害的40%转化为生命，治疗己方生命最低的队友",10,0,10,1,0,0,0,500,4117,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [20] = {118,"绝情剑","张春华一生陪伴司马懿，不离不弃。道是无情却有情，从来最苦是相思。此剑为母子剑，对敌之时，变幻万端，让人防不胜防。","张春华",4,118,"护盾为队友减免受到伤害的百分比增加至45%",10,0,10,1,0,0,0,500,4118,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [21] = {119,"疾风之刃","疾风剑豪的剑，疾风剑豪的披风，疾风剑豪的沧桑范儿~","于禁",4,119,"受到技能直接伤害的20%转化为生命，治疗自己",10,0,10,1,0,0,0,500,4119,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [22] = {201,"神威龙胆枪","神威如龙，忠心赤胆，此枪掷出可在空中化为一条银龙，从万丈高空俯冲而下，将敌人撕成碎片。","赵云",6,201,"直接伤害击杀目标后，追加1次普通攻击（追加的普通攻击不会回复怒气）",25,50,100,3,2,0,94201,4000,4201,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [23] = {202,"雌雄双股剑","雌雄双股剑，一青一紫，据说一为青龙所化，一为紫龙所化，持之者当为九五之尊。双股剑更可合为一把大剑，引天地精粹，传仁德之华。","刘备",5,202,"受到直接伤害的18%转化为生命，治疗己方全体目标",25,50,100,2,1,91202,92202,2000,4202,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [24] = {203,"七星羽扇","白玉制成的扇骨，鹰羽制成的扇面，点缀七星，镶嵌八卦，挥舞时如卧龙摆尾，既可呼风唤雨，又能指点江山。","诸葛亮",6,203,"释放技能后，降低目标1点怒气",25,50,100,3,2,0,94203,4000,4203,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [25] = {204,"木牛流马","方腹曲头，一脚四足；头入领中，舌着于腹。载多而行少，独行者数十里。牛仰双辕，人行六尺，牛行四步。","黄月英",5,204,"释放技能后，回复全体队友1点怒气",25,50,100,2,1,91204,92204,2000,4204,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [26] = {205,"青龙偃月刀","关公所用心爱配刀，传说刀柄乃青龙所化，刀身如半月，锋利无比，在百万军中取上将首级如同探囊取物。","关羽",5,205,"直接伤害击杀目标后，回复自身1点怒气",25,50,100,2,1,91205,92205,2000,4205,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [27] = {206,"丈八蛇矛","桃园三结义时，得中山大商资助金银五百两，镔铁一千斤，遂打造这柄丈八点钢矛，因双刃交缠如蛇，又名丈八蛇矛。","张飞",5,206,"自身生命降低10%，攻击增加5%",25,50,100,2,1,91206,92206,2000,4206,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [28] = {207,"虎头湛金枪","马超母亲为羌族女子，故此枪用羌族秘法锻造，重八十斤，枪头为椎体，杀敌时直捣黄龙，可瞬间将敌人肋骨与五脏六腑击碎。","马超",5,207,"受到的治疗量增加50%",25,50,100,2,1,91207,92207,2000,4207,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [29] = {208,"银刃烈火弓","黄忠此弓妙矣，可做刀，可做弓，可近身杀敌，可远程射击，魏国名将夏侯渊就是死在此弓之下。","黄忠",5,208,"直接伤害击杀目标后，追加1次普通攻击（追加的普通攻击不会回复怒气）",25,50,100,2,1,91208,92208,2000,4208,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [30] = {209,"金龙连弩","诸葛亮发明了诸葛连弩，并亲自打造了这柄弩，后传给了姜维。弩身藏弓箭数支，可瞬息连发数箭，威力无穷。","姜维",5,209,"每回合自身攻击增加8%",25,50,100,2,1,91209,92209,2000,4209,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [31] = {210,"嗜血镰刀","金锻其柄，血淬其刀，嗜血镰刀一出，敌将必血溅当场。","魏延",5,210,"释放技能附带眩晕效果的概率增加至65%",25,50,100,2,1,91210,92210,2000,4210,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [32] = {211,"凤凰法杖","当初庞统下山时，水镜先生赠其凤凰法杖，嘱其辅助明主。后庞统果然用此杖，助刘备称帝。","庞统",5,211,"所有上阵武将暴击几率增加20%",25,50,100,2,1,91211,92211,2000,4211,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",2,15,200,0,},
        [33] = {212,"无影伞剑","徐庶少年时为江湖侠客，后弃武从文，饱读诗书，又恐人指摘，故将剑藏在随身携带的雨伞当中。对敌时出其不意，一言不发取人性命。","徐庶",5,212,"释放技能后，回复自身1点怒气",25,50,100,2,1,91212,92212,2000,4212,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [34] = {213,"撼地桩","选西南大山中的百年古木，取其中段，制成此桩，一般人轻易扛不动，只有孟获天生神力可驭使此桩。","孟获",4,213,"直接伤害每击杀1个目标，自身攻击增加8%",10,0,10,1,0,0,0,500,4213,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [35] = {214,"岭云矛","祝融从小在山岭长大，擅取林中树木制成长矛，此矛锋利，精准，令猎物与敌人无处可逃。","祝融",4,214,"死亡时释放1次技能",10,0,10,1,0,0,0,500,4214,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [36] = {215,"蜀道翠竹","熊猫滚滚爱吃竹子，所以小阿斗用竹子做了一柄小剑，为此还被玄德爸爸揍了一顿。","阿斗",4,215,"护盾为自身减免受到直接伤害的百分比增加至45%",10,0,10,1,0,0,0,500,4215,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [37] = {216,"青荷","师从华佗，并得到左慈指点，小小一柄青荷，可爱讨喜，生机盎然，保主公上阵无忧。","张星彩",4,216,"死亡时释放1次技能",10,0,10,1,0,0,0,500,4216,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [38] = {217,"偃月长刀","关羽亲自为银屏打造的偃月长刀，青光偃月，流光熠熠。","关银屏",4,217,"直接伤害击杀目标回复自身20%生命",10,0,10,1,0,0,0,500,4217,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [39] = {218,"龙鳞刀","据说是用关银屏打偃月长刀剩下的材料打造的，没办法，谁让咱们的武圣更偏爱女儿呢。","关平",4,218,"技能造成的伤害增加15%",10,0,10,1,0,0,0,500,4218,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [40] = {219,"腾蛇法杖","三条金蛇盘旋而成的法杖，据说看一眼，就会被法正给炫惑住，无法动弹。","法正",4,219,"释放技能附带麻痹效果的概率增加至70%",10,0,10,1,0,0,0,500,4219,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [41] = {301,"金龙神锏","孙策的双锏用上古神兵淬炼打造而成，内藏机关，可变形为拳套，端的是巧妙无穷，尽显小霸王孙策的盖世英姿。","孙策",6,301,"攻击时，对灼烧目标的暴击几率额外增加80%",25,50,100,3,2,0,94301,4000,4301,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [42] = {302,"莲华幽伞","采潇湘翠竹成伞骨，绘九华粉莲成伞面，取泰山榉木成伞柄，此伞蕴含灵气，灵气满溢，翩若惊鸿，极其赏心悦目。","大乔",5,302,"释放技能后，为队友附加的持续治疗效果增加至大乔攻击的32%",25,50,100,2,1,91302,92302,2000,4302,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [43] = {303,"都督狂刃","大都督随身携带的佩刀自然与众不同，此刀通体青亮如玉，长八尺有余，与主人心有灵犀，利剑出鞘，调遣千军万马，显大都督雄姿英发。","周瑜",6,303,"受到普通攻击时，有80%概率使攻击者灼烧，持续2回合",25,50,100,3,2,0,94303,4000,4303,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [44] = {304,"星华双扇","金制扇骨，丝绢扇面，华贵中蕴含优雅灵巧，如同它的主人，身姿曼妙，灵动袭人，俏丽无双。","小乔",5,304,"释放技能后，给我方血量最少的2名武将附加1个无敌吸血盾，持续1回合",25,50,100,2,1,91304,92304,2000,4304,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [45] = {305,"狂歌落日弓","据传此弓乃是汉武帝赐给霍去病的弓，后遗落民间，被太史慈父亲偶得。太史慈从小便用这把弓练习骑射，有一次不小心将此弓掉落火堆，两端熊熊燃烧。因此事，太史慈被父亲一顿好打，谁料此弓却燃烧不息并无损伤，从此此弓便蕴含火焰之力，射中后可使人灼烧。太史慈父亲狂喜，“我儿将来必然了得”，然后大笑三声，兴奋过度撒手人寰。太史慈长大后果然英勇不凡，箭术百发百中，成为东吴的大将军。","太史慈",5,305,"受到普通攻击时，有50%概率使攻击者灼烧，持续2回合",25,50,100,2,1,91305,92305,2000,4305,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [46] = {306,"青冥剑","孙权称帝后亲自督促铸造了六把剑，一曰白虹，二曰紫电，三曰辟邪，四曰流星，五曰青冥，六曰百里，后孙权独喜这把青冥剑。","孙权",5,306,"直接伤害击杀灼烧目标后，回复自身50%生命",25,50,100,2,1,91306,92306,2000,4306,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [47] = {307,"灭天锚","吕蒙白衣渡江之时，便是用这柄船锚伪装成百姓和客商，趁其不备打晕荆州的守卫，带领大军攻入了荆州城。","吕蒙",5,307,"释放技能时，如果目标处于灼烧状态，附加眩晕的概率提升至80%",25,50,100,2,1,91307,92307,2000,4307,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [48] = {308,"金翎刀","锦帆游侠甘宁随身携带的大刀，华贵无比，金纹雕饰，透露出一股酷炫狂霸拽的装X风采，与凤羽毛、金铃，同为甘宁的标志。","甘宁",5,308,"普通攻击对灼烧目标造成的伤害额外增加80%",25,50,100,2,1,91308,92308,2000,4308,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [49] = {309,"烈焰盾","古语有云，刑天舞干戚，猛志固常存，此处“干”即指盾，正是孙坚击盾时的风采。孙坚的烈焰盾极重，正面兽首如烈虎出击，熊熊大火，燃烧不止，后可使敌人灼烧。","孙坚",5,309,"受到灼烧状态敌人攻击时，受到的直接伤害降低65%",25,50,100,2,1,91309,92309,2000,4309,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [50] = {310,"罗刹轮","孙尚香从小便喜爱舞刀弄枪，孙坚特意为爱女寻来此双刀环，旋转时如满月当空，又美又犀利，可轻易将敌人碾成碎片。","孙尚香",5,310,"释放技能后，追加1次普通攻击（追加的普通攻击不会回复怒气）",25,50,100,2,1,91310,92310,2000,4310,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [51] = {311,"灼月刃","谦逊隐忍，温润如玉的陆逊小都督，挥舞起这柄华光闪烁的利剑时，你只会在烈焰焚天的剑光中，看到他淡淡微笑的清隽脸庞，温柔如水的凝视着你，一不小心就被灼烧了。","陆逊",5,311,"释放技能附加灼烧概率增加至96%",25,50,100,2,1,91311,92311,2000,4311,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [52] = {312,"聚宝盆","乐善好施的鲁肃大人，三国最大的富二代，一生从未贫困潦倒过，因为他手上拿的，本是九天之上的财神爷掉落人间的聚宝盆，财富自然取之不尽，用之不竭。","鲁肃",5,312,"释放普通攻击后，降低目标1点怒气",25,50,100,2,1,91312,92312,2000,4312,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [53] = {313,"无极棍","天地初开那个记号，它是我永垂不朽的荣耀；只因为在花果山太过无聊，所以下凡练个小号。金箍棒化身无极棍，斗战不息，一身血脉在咆哮；烈焰灼烧，满身烈胆真豪情。","凌统",4,313,"受到普通攻击时，有40%概率使攻击者灼烧，持续2回合",10,0,10,1,0,0,0,500,4313,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [54] = {314,"断海鞭","传说周瑜打黄盖时，就是用的黄盖的断海鞭，直打得黄盖臀部开花下不了床，这才让曹操相信了苦肉计。","黄盖",4,314,"受到的治疗效果增加40%",10,0,10,1,0,0,0,500,4314,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [55] = {315,"金玉笏","怕不怕，我手中的金玉笏，能不能，看我厉害的愤青嘴。","张昭",4,315,"护盾吸收自身攻击直接伤害百分比增加至100%",10,0,10,1,0,0,0,500,4315,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [56] = {316,"不屈刃","刃如月色，锋似寒星，身雕百龙蟠纹，挥舞只欲搅碎银汉，不屈之刃永不倒，忠心救主表忠心。","周泰",4,316,"击杀目标后，回复自身1点怒气",10,0,10,1,0,0,0,500,4316,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [57] = {317,"逍遥琴","高山流水，十面埋伏，空灵逍遥，琴音不绝，轻弹悦耳，重弹伤敌。","步练师",4,317,"释放技能时，如果目标处于灼烧状态，附加眩晕的概率提升至80%",10,0,10,1,0,0,0,500,4317,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [58] = {318,"惊天弓","象牙为骨，宝石镶嵌，惊天弓一出，取敌首级如探囊取物。","韩当",4,318,"技能对灼烧目标伤害增加80%",10,0,10,1,0,0,0,500,4318,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [59] = {319,"绯瑞云灯","金制的传统宫灯，典雅华贵，更蕴含烈焰灼烧之力。","诸葛瑾",4,319,"受到技能攻击时，有30%概率使攻击者灼烧，持续2回合",10,0,10,1,0,0,0,500,4319,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [60] = {401,"清虚拂","上古流传的一柄拂尘，看似普通，实则不凡，静如海之渊深博从，动似海之激荡翻腾，控仙剑如蛟龙，引寒霜而凛冽。","左慈",6,401,"释放技能附带眩晕效果的概率增加至70%",25,50,100,3,2,0,94401,4000,4401,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [61] = {402,"天枢杖","华佗好友左慈从蟠桃树上折枝做成的法杖，上山采药可做拐杖引路，悬壶济世可做药引加血。","华佗",5,402,"目标血量每减少10%，对其造成的治疗量增加5%",25,50,100,2,1,91402,92402,2000,4402,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [62] = {403,"方天画戟","三尖两刃，重达百斤，用“援”之法，可冲铲，回砍，横刺，劈刺；用“内”之法，可反别，平钩，钉壁，翻刺；用“搪”之法，可捅击，挑击，直劈。吕布用此戟驰骋沙场，变化无穷，战意无双。","吕布",6,403,"直接伤害击杀目标后，回复自身2点怒气",25,50,100,3,2,0,94403,4000,4403,81,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [63] = {404,"仙姝美华","蕴含天地灵气的一朵莲花，气韵非凡，曼妙出尘，美不胜收。","貂蝉",5,404,"技能直接伤害的50%转换为生命，治疗己方生命最少的队友",25,50,100,2,1,91404,92404,2000,4404,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [64] = {405,"魔王勾","一把火烧了洛阳，取最有骨气之人的头骨，用七星宝刀打磨，制成此魔王勾。此勾一出，必拿一血！","董卓",5,405,"减伤盾减少受到直接伤害的百分比增加至50%",25,50,100,2,1,91405,92405,2000,4405,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [65] = {406,"霸天斧","以西凉古木之根打造斧柄，用凉州玄铁精炼斧刃，通体暗紫，镶嵌青玉宝石，持之者有大将风骨，但如遇青龙则会遭殃。","华雄",5,406,"直接伤害击杀目标后，回复自身1点怒气",25,50,100,2,1,91406,92406,2000,4406,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [66] = {407,"阎王笔","“我若让你三更死，谁敢留你到五更”，贾诩手中的这支笔，内空而蓄满毒汁，可轻易将人毒杀。","贾诩",5,407,"释放技能附加中毒效果的概率增加至96%",25,50,100,2,1,91407,92407,2000,4407,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [67] = {408,"飞云枪","公孙瓒带领三千骑兵，打下辽西乌桓，乌桓首领贪至王率众归降公孙瓒，并献上此枪，名为飞云枪。","公孙瓒",5,408,"释放技能后，回复自身1点怒气",25,50,100,2,1,91408,92408,2000,4408,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [68] = {409,"雷霆羊角杖","金制的羊头法杖，蕴含雷霆万钧之力，出则天地齐喑，奔涛如雷。","张角",5,409,"释放技能后，降低目标1点怒气",25,50,100,2,1,91409,92409,2000,4409,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [69] = {410,"千幻毒傀儡","于吉用木头制作的傀儡，腹内中空，蕴含毒液，沾少许即可取人性命。","于吉",5,410,"释放技能后，降低目标1点怒气",25,50,100,2,1,91410,92410,2000,4410,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [70] = {411,"真霸道剑","汝南袁家乃四世三公之族，府中宝物无数，这柄锋锐无匹的宝剑，适合胸怀天下的英雄，故而传给了袁绍。","袁绍",5,411,"释放技能附带麻痹效果的概率增加至50%",25,50,100,2,1,91411,92411,2000,4411,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [71] = {412,"传国玉玺","秦代丞相李斯奉始皇帝之命，用和氏璧镌刻而成，为中国历代正统皇帝的证凭。其方圆四寸，上纽交五龙。真龙天子得此印，可得天下；若非真龙天子，反倒容易死于非命。","袁术",5,412,"释放技能后，回复自身1点怒气",25,50,100,2,1,91412,92412,2000,4412,80,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [72] = {413,"裂空刀","裂空刀很长，长到什么程度，在短武器中排名第一。","颜良",4,413,"上场第1回合造成的伤害必定暴击",10,0,10,1,0,0,0,500,4413,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [73] = {414,"碎岳锤","岁月是把杀猪的刀，碎岳是柄长角的锤。","文丑",4,414,"直接伤害每击杀1个目标，自身攻击增加8%",10,0,10,1,0,0,0,500,4414,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [74] = {415,"天涯悲琴","作为知名才女的武器，此琴颇具西域特色，马首，方肚，双弦，蔡文姬波澜壮阔跌宕起伏的一生，娓娓弹来，如泣如诉。","蔡文姬",4,415,"释放技能附带眩晕效果的概率增加至80%",10,0,10,1,0,0,0,500,4415,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [75] = {416,"龙泉剑","上古宝剑，见惯了沧海桑田，管你是明主忠臣，奸邪枭雄，有本事，杀；没本事，骂，我只好好的做一把剑。","陈宫",4,416,"技能造成的伤害增加15%",10,0,10,1,0,0,0,500,4416,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [76] = {417,"竹马","就因为小时候让了个梨，小小的竹马就成了孔融的武器，至于他是孔子的后代，还是汉末的诸侯，都无所谓。","孔融",4,417,"释放普通攻击后额外回复自身1点怒气",10,0,10,1,0,0,0,500,4417,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [77] = {418,"小方天画戟","光看武器的名称，就知道主人的身份了。","吕灵雎",4,418,"普通攻击伤害的50%转化为生命，治疗自己",10,0,10,1,0,0,0,500,4418,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [78] = {419,"断子绝孙剪","此剪从半空中呼啸而下，一绞之力无人能挡，快，快，捂紧你的裤裆。","张让",4,419,"释放技能附带沉默效果的概率增加至80%",10,0,10,1,0,0,0,500,4419,80,1,0,0,"0",0,0,0,"0",0,0,0,"0",0,0,0,0,},
        [79] = {150,"幽冥诛仙刃","用幽冥之力铸造的刀，据说有恶灵魂魄附着其中，供使用者驱使。","子上",7,150,"释放技能攻击女性武将回复自身2点怒气，释放技能攻击男性武将追加一次造成36%生命上限伤害的普攻（追加的普通攻击不会回复怒气，不触发任何武将特性）",25,50,100,6,0,0,0,12000,4150,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [80] = {151,"千叶流霜刀","轻如飞羽的刀刃，周身流霜环绕，寒气袭人，令人闻风丧胆，不敢近身。","王异",7,151,"敌方武将因虚弱导致释放技能失败时，王异回复2点怒气",25,50,100,6,0,0,0,12000,4151,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [81] = {152,"璇玑镇魂灯","看起来不起眼的一盏灯，却能吸收日月星辰，并转化为无穷的力量。","管辂",7,152,"释放技能后回复自身2点怒气，间接伤害击杀目标后，额外回复2点怒气",25,50,100,6,0,0,0,12000,4152,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [82] = {153,"鬼灵奇韫笔","蕴藏鬼灵之力的神笔，助使用者才思敏捷，文思如泉涌","周不疑",7,153,"己方魏国武将攻击处于挫锐状态的目标时，周不疑回复自身1点怒气，每回合最多回复4点",25,50,100,6,0,0,0,12000,4153,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [83] = {250,"苍松水韵琴","有古琴名水韵者，聚苍松之魂，凝沧浪之力，高山流水，与自然之灵合而为一。","水镜",7,250,"战场上每死亡一个人，伤害提高10%",25,50,100,6,0,0,0,12000,4250,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [84] = {251,"神机灵巧牛","集父母之智造就的神奇机关牛，蕴藏无尽能量，给小主人带来无微不至的呵护和关爱。","诸葛果",7,251,"每回合回复自身1点怒气。受到眩晕、击飞、压制、中毒、灼烧效果时，可以用2点怒气抵消1次该效果。",25,50,100,6,0,0,0,12000,4251,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [85] = {252,"灵霄穿云枪","精钢打造的十字枪，战斗时有穿云之音，可破坚韧的屏障。","马云禄",7,252,"释放技能后，回复自身1点怒气。如果释放技能前处于御甲状态，额外回复2点怒气。",25,50,100,6,0,0,0,12000,4252,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [86] = {253,"百鸟朝凤枪","凤凰涅槃，浴火重生，历尽磨难才成为百鸟之王。童渊占尽沙场最终归隐山林，悟出此番道理，创得这般枪法。","童渊",7,253,"释放技能后，额外回复怒气，每层受创状态都可以额外回复自身1点怒气（最多额外回复4点怒气）",25,50,100,6,0,0,0,12000,4253,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [87] = {350,"烈焰霓凰刀","相传凤凰之魂凝聚在宝刀内，伴随红莲绽放，浴火便能重生。","周姬",7,350,"释放技能攻击男性武将造成额外生命上限10%伤害，释放技能攻击女性武将可清除己方血量最低的两个目标受到的控制效果",25,50,100,6,0,0,0,12000,4350,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [88] = {351,"含光幻玉剑","珍贵的金丝玉制成的宝剑，瑾瑜含光，灵动流转，温润有方。","陆抗",7,351,"每回合回复2点怒气。释放技能后为己方武将附加的御甲效果提升至20%",25,50,100,6,0,0,0,12000,4351,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [89] = {352,"十方青玉刃","两把青玉刃，合在一起即变为双头大刀，须有极强的腕力才能收放自如。","朱桓",7,352,"每触发反弹效果1次，自身恢复1点怒气，每回合最多不超过4点",25,50,100,6,0,0,0,12000,4352,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [90] = {353,"仙蝶凤箜篌","蕴藏仙灵之音的箜篌，弹奏时据说会有彩色金蝶飞舞，仙音缥缈，美不胜收。","孙姬",7,353,"受到灼烧目标的直接伤害时，有几率为攻击者附加饮鸩状态，持续1回合（每个其他上阵的吴国武将，都可以提供18%的几率）",25,50,100,6,0,0,0,12000,4353,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [91] = {450,"延阳追魂杖","蕴含无限力量的金藜杖，相传得之者可习得无上神功，修炼可延年益寿、返老还童。","南华",7,450,"技能伤害增加36%，普攻伤害增加72%",25,50,100,6,0,0,0,12000,4450,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,0,},
        [92] = {451,"自在轻云烟","居来身自在，胜与俗浮沉。一缕轻云烟，逍遥似神仙。","卢植",7,451,"释放技能无视无敌效果并且回复自身2点怒气",25,50,100,6,0,0,0,12000,4451,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [93] = {452,"灵觋破魔斧","附着历代巫神灵魂的玉斧，可令寻常妖魔鬼怪闻风丧胆，野兽毒蛇皆尽臣服。","木鹿大王",7,452,"被动：木鹿大王在场时，己方所有群雄武将受到武将直接伤害时，如果该伤害大于自身生命上限30%的血量，那么此伤害降低50%",25,50,100,6,0,0,0,12000,4452,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
        [94] = {453,"寒冥破星锤","小恶魔使用的流星锤，泛着幽幽紫光，渗透着寒气。","董白",7,453,"技能造成的直接伤害大于敌方目标的剩余生命值时，溢出伤害的50%转化为间接伤害，攻击其他血量最少的铁索、压制目标。",25,50,100,6,0,0,0,12000,4453,706,1,23,1,"初始怒气+1",75,23,1,"初始怒气+1",100,52,180,"初始附加生命上限18%的御甲",0,0,0,3,},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [101] = 3,
    [102] = 4,
    [103] = 5,
    [104] = 6,
    [105] = 7,
    [106] = 8,
    [107] = 9,
    [108] = 10,
    [109] = 11,
    [110] = 12,
    [111] = 13,
    [112] = 14,
    [113] = 15,
    [114] = 16,
    [115] = 17,
    [116] = 18,
    [117] = 19,
    [118] = 20,
    [119] = 21,
    [150] = 79,
    [151] = 80,
    [152] = 81,
    [153] = 82,
    [2] = 2,
    [201] = 22,
    [202] = 23,
    [203] = 24,
    [204] = 25,
    [205] = 26,
    [206] = 27,
    [207] = 28,
    [208] = 29,
    [209] = 30,
    [210] = 31,
    [211] = 32,
    [212] = 33,
    [213] = 34,
    [214] = 35,
    [215] = 36,
    [216] = 37,
    [217] = 38,
    [218] = 39,
    [219] = 40,
    [250] = 83,
    [251] = 84,
    [252] = 85,
    [253] = 86,
    [301] = 41,
    [302] = 42,
    [303] = 43,
    [304] = 44,
    [305] = 45,
    [306] = 46,
    [307] = 47,
    [308] = 48,
    [309] = 49,
    [310] = 50,
    [311] = 51,
    [312] = 52,
    [313] = 53,
    [314] = 54,
    [315] = 55,
    [316] = 56,
    [317] = 57,
    [318] = 58,
    [319] = 59,
    [350] = 87,
    [351] = 88,
    [352] = 89,
    [353] = 90,
    [401] = 60,
    [402] = 61,
    [403] = 62,
    [404] = 63,
    [405] = 64,
    [406] = 65,
    [407] = 66,
    [408] = 67,
    [409] = 68,
    [410] = 69,
    [411] = 70,
    [412] = 71,
    [413] = 72,
    [414] = 73,
    [415] = 74,
    [416] = 75,
    [417] = 76,
    [418] = 77,
    [419] = 78,
    [450] = 91,
    [451] = 92,
    [452] = 93,
    [453] = 94,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in instrument")
        return t._raw[__key_map[k]]
    end
}

-- 
function instrument.length()
    return #instrument._data
end

-- 
function instrument.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function instrument.indexOf(index)
    if index == nil or not instrument._data[index] then
        return nil
    end

    return setmetatable({_raw = instrument._data[index]}, mt)
end

--
function instrument.get(id)
    
    return instrument.indexOf(__index_id[id])
        
end

--
function instrument.set(id, tkey, nvalue)
    local record = instrument.get(id)
    if record then
        local keyIndex = __key_map[tkey]
        if keyIndex then
            record._raw[keyIndex] = nvalue
        end
    end
end

--
function instrument.index()
    return __index_id
end

return instrument