--jade

-- key
local __key_map = {
  id = 1,    --玉石id-int 
  name = 2,    --玉石名称-string 
  icon = 3,    --玉石icon-int 
  color = 4,    --玉石品质-int 
  property = 5,    --玉石类型-int 
  equipment_type = 6,    --适用装备类型-int 
  equipment = 7,    --适用装备-string 
  treasure_type = 8,    --适用宝物类型-int 
  treasure = 9,    --适用宝物-string 
  profile = 10,    --玉石短描述-string 
  description = 11,    --玉石详情-string 
  type = 12,    --属性1类型-int 
  size = 13,    --属性1数值-int 
  growth = 14,    --属性1成长-int 
  fake = 15,    --假战力-int 
  bag_description = 16,    --背包玉石描述-string 
  button_type = 17,    --按钮类型-int 
  function_id = 18,    --跳转功能id-int 
  button_txt = 19,    --按钮文字-string 
  recycle_type = 20,    --回收资源货币类型-int 
  recycle_value = 21,    --回收资源货币名称-int 
  recycle_size = 22,    --回收资源货币数量-int 
  effect = 23,    --特效-string 
  sort = 24,    --排序-int 
  hero = 25,    --适用武将-string 

}

-- data
local jade = {
    _data = {
        [1] = {1101,"青龙星光玉·攻",1101,4,2,1,"601|501|409",0,"","攻击+5000","攻击+5000（主角每升1级攻击额外+100）",1,5000,100,200000,"攻击+5000",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_lan1down",40,"999",},
        [2] = {1102,"青龙星光玉·疗",1102,4,2,1,"601|501|409",0,"","治疗加成+8%","治疗加成+8%（仅对治疗型武将的治疗生效）",42,80,0,200000,"治疗加成+8%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_lan1down",38,"102|152|202|302|402|216",},
        [3] = {1103,"青龙星光玉·暴",1103,4,2,1,"601|501|409",0,"","暴击几率+12%","暴击几率+12%",15,120,0,200000,"暴击几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_lan1down",39,"999",},
        [4] = {1104,"玄武星光玉·物",1104,4,2,2,"602|502|410",0,"","物理防御+2500","物理防御+2500（主角每升1级物理防御额外+50）",5,2500,50,200000,"物理防御+2500",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_lv1down",37,"999",},
        [5] = {1105,"玄武星光玉·愈",1105,4,2,2,"602|502|410",0,"","被治疗率+8%","被治疗率+8%（仅对治疗型武将的治疗生效）",43,80,0,200000,"被治疗率+8%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_lv1down",35,"999",},
        [6] = {1106,"玄武星光玉·抗",1106,4,2,2,"602|502|410",0,"","抗暴几率+12%","抗暴几率+12%",16,120,0,200000,"抗暴几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_lv1down",36,"999",},
        [7] = {1107,"白虎星光玉·法",1107,4,2,3,"603|503|411",0,"","法术防御+2500","法术防御+2500（主角每升1级物理防御额外+50）",6,2500,50,200000,"法术防御+2500",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_huang1down",34,"999",},
        [8] = {1108,"白虎星光玉·愈",1108,4,2,3,"603|503|411",0,"","被治疗率+8%","被治疗率+8%（仅对治疗型武将的治疗生效）",43,80,0,200000,"被治疗率+8%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_huang1down",32,"999",},
        [9] = {1109,"白虎星光玉·闪",1109,4,2,3,"603|503|411",0,"","闪避几率+12%","闪避几率+12%",18,120,0,200000,"闪避几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_huang1down",33,"999",},
        [10] = {1110,"朱雀星光玉·血",1110,4,2,4,"604|504|412",0,"","生命+37500","生命+37500（主角每升1级生命额外+750）",7,37500,750,200000,"生命+37500",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_red1down",31,"999",},
        [11] = {1111,"朱雀星光玉·疗",1111,4,2,4,"604|504|412",0,"","治疗加成+8%","治疗加成+8%（仅对治疗型武将的治疗生效）",42,80,0,200000,"治疗加成+8%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_red1down",29,"102|152|202|302|402|216",},
        [12] = {1112,"朱雀星光玉·命",1112,4,2,4,"604|504|412",0,"","命中几率+12%","命中几率+12%",17,120,0,200000,"命中几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_red1down",30,"999",},
        [13] = {1201,"青龙月华玉·攻",1201,5,2,1,"601|501|409",0,"","攻击加成+12%","攻击加成+12%",8,120,0,480000,"攻击加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_lan2up|effect_shuijing_lan2down",28,"999",},
        [14] = {1202,"青龙月华玉·疗",1202,5,2,1,"601|501|409",0,"","治疗加成+12%","治疗加成+12%（仅对治疗型武将的治疗生效）",42,120,0,480000,"治疗加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_lan2up|effect_shuijing_lan2down",26,"102|152|202|302|402|216",},
        [15] = {1203,"青龙月华玉·暴",1203,5,2,1,"601|501|409",0,"","暴击几率+22%","暴击几率+22%",15,220,0,480000,"暴击几率+22%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_lan2up|effect_shuijing_lan2down",27,"999",},
        [16] = {1204,"玄武月华玉·物",1204,5,2,2,"602|502|410",0,"","物理防御加成+12%","物理防御加成+12%",12,120,0,480000,"物理防御加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_lv2up|effect_shuijing_lv2down",25,"999",},
        [17] = {1205,"玄武月华玉·愈",1205,5,2,2,"602|502|410",0,"","被治疗率+12%","被治疗率+12%（仅对治疗型武将的治疗生效）",43,120,0,480000,"被治疗率+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_lv2up|effect_shuijing_lv2down",23,"999",},
        [18] = {1206,"玄武月华玉·抗",1206,5,2,2,"602|502|410",0,"","抗暴几率+22%","抗暴几率+22%",16,220,0,480000,"抗暴几率+22%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_lv2up|effect_shuijing_lv2down",24,"999",},
        [19] = {1207,"白虎月华玉·法",1207,5,2,3,"603|503|411",0,"","法术防御加成+12%","法术防御加成+12%",13,120,0,480000,"法术防御加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_huang2up|effect_shuijing_huang2down",22,"999",},
        [20] = {1208,"白虎月华玉·愈",1208,5,2,3,"603|503|411",0,"","被治疗率+12%","被治疗率+12%（仅对治疗型武将的治疗生效）",43,120,0,480000,"被治疗率+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_huang2up|effect_shuijing_huang2down",20,"999",},
        [21] = {1209,"白虎月华玉·闪",1209,5,2,3,"603|503|411",0,"","闪避几率+22%","闪避几率+22%",18,220,0,480000,"闪避几率+22%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_huang2up|effect_shuijing_huang2down",21,"999",},
        [22] = {1210,"朱雀月华玉·血",1210,5,2,4,"604|504|412",0,"","生命加成+12%","生命加成+12%",14,120,0,480000,"生命加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_red2up|effect_shuijing_red2down",19,"999",},
        [23] = {1211,"朱雀月华玉·疗",1211,5,2,4,"604|504|412",0,"","治疗加成+12%","治疗加成+12%（仅对治疗型武将的治疗生效）",42,120,0,480000,"治疗加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_red2up|effect_shuijing_red2down",17,"102|152|202|302|402|216",},
        [24] = {1212,"朱雀月华玉·命",1212,5,2,4,"604|504|412",0,"","命中几率+22%","命中几率+22%",17,220,0,480000,"命中几率+22%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_red2up|effect_shuijing_red2down",18,"999",},
        [25] = {1301,"青龙日耀玉·伤",1301,6,2,1,"601|501|409",0,"","伤害加成+18%","伤害加成+18%",19,180,0,1200000,"伤害加成+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",15,"999",},
        [26] = {1302,"青龙日耀玉·疗",1302,6,2,1,"601|501|409",0,"","治疗加成+18%","治疗加成+18%（仅对治疗型武将的治疗生效）",42,180,0,1200000,"治疗加成+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",13,"102|152|202|302|402|216",},
        [27] = {1303,"青龙日耀玉·暴",1303,6,2,1,"601|501|409",0,"","暴击几率+32%","暴击几率+32%",15,320,0,1200000,"暴击几率+32%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",14,"999",},
        [28] = {1304,"青龙日耀玉·克",1304,6,2,1,"601|501|409",0,"","PVP增伤+18%","PVP增伤+18%",46,180,0,1200000,"PVP增伤+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",16,"999",},
        [29] = {1305,"玄武日耀玉·护",1305,6,2,2,"602|502|410",0,"","伤害减免+18%","伤害减免+18%",20,180,0,1200000,"伤害减免+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",11,"999",},
        [30] = {1306,"玄武日耀玉·愈",1306,6,2,2,"602|502|410",0,"","被治疗率+18%","被治疗率+18%（仅对治疗型武将的治疗生效）",43,180,0,1200000,"被治疗率+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",9,"999",},
        [31] = {1307,"玄武日耀玉·抗",1307,6,2,2,"602|502|410",0,"","抗暴几率+32%","抗暴几率+32%",16,320,0,1200000,"抗暴几率+32%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",10,"999",},
        [32] = {1308,"玄武日耀玉·韧",1308,6,2,2,"602|502|410",0,"","PVP减伤+18%","PVP减伤+18%",47,180,0,1200000,"PVP减伤+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",12,"999",},
        [33] = {1309,"白虎日耀玉·护",1309,6,2,3,"603|503|411",0,"","伤害减免+18%","伤害减免+18%",20,180,0,1200000,"伤害减免+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",7,"999",},
        [34] = {1310,"白虎日耀玉·愈",1310,6,2,3,"603|503|411",0,"","被治疗率+18%","被治疗率+18%（仅对治疗型武将的治疗生效）",43,180,0,1200000,"被治疗率+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",5,"999",},
        [35] = {1311,"白虎日耀玉·闪",1311,6,2,3,"603|503|411",0,"","闪避几率+32%","闪避几率+32%",18,320,0,1200000,"闪避几率+32%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",6,"999",},
        [36] = {1312,"白虎日耀玉·韧",1312,6,2,3,"603|503|411",0,"","PVP减伤+18%","PVP减伤+18%",47,180,0,1200000,"PVP减伤+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",8,"999",},
        [37] = {1313,"朱雀日耀玉·伤",1313,6,2,4,"604|504|412",0,"","伤害加成+18%","伤害加成+18%",19,180,0,1200000,"伤害加成+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",3,"999",},
        [38] = {1314,"朱雀日耀玉·疗",1314,6,2,4,"604|504|412",0,"","治疗加成+18%","治疗加成+18%（仅对治疗型武将的治疗生效）",42,180,0,1200000,"治疗加成+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",1,"102|152|202|302|402|216",},
        [39] = {1315,"朱雀日耀玉·命",1315,6,2,4,"604|504|412",0,"","命中几率+32%","命中几率+32%",17,320,0,1200000,"命中几率+32%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",2,"999",},
        [40] = {1316,"朱雀日耀玉·克",1316,6,2,4,"604|504|412",0,"","PVP增伤+18%","PVP增伤+18%",46,180,0,1200000,"PVP增伤+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",4,"999",},
        [41] = {2101,"青龙断魂玉·杀意",2101,6,1,1,"601|501",0,"","攻击受到控制的目标增加伤害","攻击受到控制效果（眩晕、沉默、麻痹）的目标时，增加15%的伤害。",0,0,0,1200000,"攻击受到控制的目标增加伤害",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",41,"1|2|3|4|5|6|11|12|13|14|15|16|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|151|153|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|252|253|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|351|352|353|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450|451|452|453",},
        [42] = {2102,"青龙断魂玉·嗜血",2102,6,1,1,"601|501",0,"","攻击可造成额外伤害","攻击目标数量为1/2/3/4/6个目标时，额外造成目标生命上限15%/7.5%/5%/3.75%/ 2.5%的伤害",0,0,0,1200000,"攻击可造成额外伤害",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",42,"1|2|3|4|5|6|11|12|13|14|15|16|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|151|153|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|252|253|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|351|352|353|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450|451|452|453",},
        [43] = {2103,"青龙断魂玉·同心",2103,6,1,1,"601|501",0,"","造成伤害或治疗提高","释放技能或普攻时，使自身造成的伤害或治疗提高（己方每有一个与自己同阵营的武将，伤害或治疗+3.75%）",0,0,0,1200000,"造成伤害或治疗提高",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",43,"999",},
        [44] = {2104,"青龙断魂玉·如意",2104,6,1,1,"601|501",0,"","击杀目标可清除异常效果","击杀目标后，清除己方武将身上该目标死亡前释放的所有异常效果（灼烧、中毒、眩晕、沉默、麻痹）",0,0,0,1200000,"击杀目标可清除异常效果",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lan3up|effect_shuijing_lan3down",44,"1|2|3|4|5|6|11|12|13|14|15|16|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|151|153|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|252|253|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|351|352|353|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450|451|452|453",},
        [45] = {2105,"玄武金刚玉·吸星",2105,6,1,2,"602|502",0,"","回合开始前获得吸收伤害护盾","战斗开始前，使自身获得一个吸收伤害盾，吸收自身血量上限30%的直接伤害，持续一回合",0,0,0,1200000,"回合开始前获得吸收伤害护盾",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",45,"999",},
        [46] = {2106,"玄武金刚玉·银霜",2106,6,1,2,"602|502",0,"","行动后获得吸收伤害护盾","自身行动后，使自身获得一个吸收伤害盾，吸收自身生命上限15%的直接伤害，持续一回合（自身回合内仅触发一次）",0,0,0,1200000,"行动后获得吸收伤害护盾",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",46,"999",},
        [47] = {2107,"玄武金刚玉·同泽",2107,6,1,2,"602|502",0,"","死亡时使队友获得无敌护盾","死亡时，使血量最少的友方目标获得一个无敌护盾，持续1回合（护盾强度等同于张郃突破5所附加的护盾）",0,0,0,1200000,"死亡时使队友获得无敌护盾",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",47,"999",},
        [48] = {2108,"玄武金刚玉·化伤",2108,6,1,2,"602|502",0,"","受到极大伤害时获得伤害减免","受到武将直接伤害时，如果该伤害超过自身生命上限的50%，减免此次伤害的30%",0,0,0,1200000,"受到极大伤害时获得伤害减免",1,131,"镶 嵌",5,30,3200,"effect_shuijing_lv3up|effect_shuijing_lv3down",48,"999",},
        [49] = {2109,"白虎神怒玉·回光",2109,6,1,3,"603|503",0,"","回合结束时回复怒气","自身行动后，回复自身1点怒气（自身回合内仅触发一次）",0,0,0,1200000,"回合结束时回复怒气",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",49,"999",},
        [50] = {2110,"白虎神怒玉·灵霜",2110,6,1,3,"603|503",0,"","队友释放技能有几率回复怒气","队友释放技能后，有20%的概率回复自身1点怒气",0,0,0,1200000,"队友释放技能有几率回复怒气",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",50,"999",},
        [51] = {2111,"白虎神怒玉·化极",2111,6,1,3,"603|503",0,"","整体回合结束时几率回复怒气","整体回合结束时，如果自身怒气低于4点，有35%的概率将怒气回复至4点",0,0,0,1200000,"整体回合结束时几率回复怒气",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",51,"999",},
        [52] = {2112,"白虎神怒玉·返锦",2112,6,1,3,"603|503",0,"","释放技能有几率回复消耗怒气","释放技能后，有25%的几率获得本次技能消耗50%的怒气，最多不超过4点",0,0,0,1200000,"释放技能有几率回复消耗怒气",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",52,"999",},
        [53] = {2113,"朱雀生息玉·培元",2113,6,1,4,"604|504",0,"","释放技能有几率使队友控制抗性增加","释放技能后，有50%的几率使周围的友方目标受到控制效果（眩晕、沉默、麻痹）的概率下降35%，持续一回合",0,0,0,1200000,"释放技能有几率使队友控制抗性增加",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",53,"999",},
        [54] = {2114,"朱雀生息玉·固本",2114,6,1,4,"604|504",0,"","自身恢复怒气时可回复血量","自身回合内，恢复怒气的同时，恢复自身生命上限15%的血量",0,0,0,1200000,"自身恢复怒气时可回复血量",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",54,"999",},
        [55] = {2115,"朱雀生息玉·凝神",2115,6,1,4,"604|504",0,"","自身未行动过可获得免控护盾","自身回合结束时，如果本回合没有主动行动过，获得1个免疫控制效果（眩晕，沉默，麻痹）的护盾，持续一回合",0,0,0,1200000,"自身未行动过可获得免控护盾",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",55,"999",},
        [56] = {2116,"朱雀生息玉·清心",2116,6,1,4,"604|504",0,"","回合开始前有几率移除自身异常效果","自身回合开始前，有25%的几率移除自身所有的异常效果（灼烧、中毒、眩晕、沉默、麻痹）",0,0,0,1200000,"回合开始前有几率移除自身异常效果",1,131,"镶 嵌",5,30,3200,"effect_shuijing_red3up|effect_shuijing_red3down",56,"999",},
        [57] = {3101,"烛龙星光玉·攻",3101,4,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","攻击+5000","攻击+5000（主角每升1级攻击额外+100）",1,5000,100,200000,"攻击+5000",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_zise1down",40,"999",},
        [58] = {3102,"烛龙星光玉·命",3102,4,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","命中几率+12%","命中几率+12%",17,120,0,200000,"命中几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_zise1down",38,"999",},
        [59] = {3103,"烛龙星光玉·暴",3103,4,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","暴击几率+12%","暴击几率+12%",15,120,0,200000,"暴击几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_zise1down",39,"999",},
        [60] = {3104,"精卫星光玉·血",3104,4,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","生命+37500","生命+37500（主角每升1级生命额外+750）",7,37500,750,200000,"生命+37500",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_huang1down",37,"999",},
        [61] = {3105,"精卫星光玉·闪",3105,4,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","闪避几率+12%","闪避几率+12%",18,120,0,200000,"闪避几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_huang1down",35,"999",},
        [62] = {3106,"精卫星光玉·抗",3106,4,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","抗暴几率+12%","抗暴几率+12%",16,120,0,200000,"抗暴几率+12%",1,131,"镶 嵌",5,30,500,"null|effect_shuijing_huang1down",36,"999",},
        [63] = {3201,"烛龙月华玉·攻",3201,5,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","攻击加成+12%","攻击加成+12%",8,120,0,480000,"攻击加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_zise2up|effect_shuijing_zise2down",28,"999",},
        [64] = {3202,"烛龙月华玉·命",3202,5,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","命中几率+22%","命中几率+22%",17,220,0,480000,"命中几率+22%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_zise2up|effect_shuijing_zise2down",26,"999",},
        [65] = {3203,"烛龙月华玉·灭",3203,5,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","暴击伤害+12%","暴击伤害+12%",21,120,0,480000,"暴击伤害+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_zise2up|effect_shuijing_zise2down",27,"999",},
        [66] = {3204,"精卫月华玉·血",3204,5,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","生命加成+12%","生命加成+12%",14,120,0,480000,"生命加成+12%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_huang2up|effect_shuijing_huang2down",25,"999",},
        [67] = {3205,"精卫月华玉·闪",3205,5,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","闪避几率+22%","闪避几率+22%",18,220,0,480000,"闪避几率+22%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_huang2up|effect_shuijing_huang2down",23,"999",},
        [68] = {3206,"精卫月华玉·抗",3206,5,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","抗暴几率+22%","抗暴几率+22%",16,220,0,480000,"抗暴几率+22%",1,131,"镶 嵌",5,30,1250,"effect_shuijing_huang2up|effect_shuijing_huang2down",23,"999",},
        [69] = {3301,"烛龙日耀玉·伤",3301,6,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","伤害加成+18%","伤害加成+18%",19,180,0,1200000,"伤害加成+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",15,"999",},
        [70] = {3302,"烛龙日耀玉·灭",3302,6,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","暴击伤害+18%","暴击伤害+18%",21,180,0,1200000,"暴击伤害+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",13,"999",},
        [71] = {3303,"烛龙日耀玉·暴",3303,6,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","暴击几率+32%","暴击几率+32%",15,320,0,1200000,"暴击几率+32%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",14,"999",},
        [72] = {3304,"烛龙日耀玉·攻",3304,6,2,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","攻击加成+18%","攻击加成+18%",8,180,0,1200000,"攻击加成+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",16,"999",},
        [73] = {3305,"精卫日耀玉·护",3305,6,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","伤害减免+18%","伤害减免+18%",20,180,0,1200000,"伤害减免+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",11,"999",},
        [74] = {3306,"精卫日耀玉·血",3306,6,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","生命加成+18%","生命加成+18%",14,180,0,1200000,"生命加成+18%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",9,"999",},
        [75] = {3307,"精卫日耀玉·抗",3307,6,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","抗暴几率+32%","抗暴几率+32%",16,320,0,1200000,"抗暴几率+32%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",10,"999",},
        [76] = {3308,"精卫日耀玉·闪",3308,6,2,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","闪避几率+32%","闪避几率+32%",18,320,0,1200000,"闪避几率+32%",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",12,"999",},
        [77] = {4101,"烛龙灵霄玉·锥心",4101,6,1,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","击杀目标可造成额外伤害","击杀目标时，溢出伤害的25%将对血量最少的敌方目标造成间接伤害",0,0,0,1200000,"击杀目标可造成额外伤害",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",41,"1|2|3|4|5|6|11|12|13|14|15|16|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|151|153|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|252|253|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|351|352|353|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450|451|452|453",},
        [78] = {4102,"烛龙灵霄玉·怒焰",4102,6,1,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","为己方回复怒气时有几率增加伤害","释放技能为己方其他目标回复怒气时，有几率同时增加16%的伤害（每回复1点怒气，概率增加25%），持续1回合。该效果同一回合同一目标仅能触发1次",0,0,0,1200000,"为己方回复怒气时有几率增加伤害",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",42,"999",},
        [79] = {4103,"烛龙灵霄玉·冰魄",4103,6,1,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","治疗武将释放技能时有几率清除状态","治疗武将释放技能时，有32%几率清除异常状态（中毒，灼烧）",0,0,0,1200000,"释放技能治疗目标有几率清除状态",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",43,"999",},
        [80] = {4104,"烛龙灵霄玉·追魂",4104,6,1,0,"",1,"301|302|303|304|401|402|403|404|501|502|503|504","攻击时对第一顺位目标造成额外伤害","攻击没有击杀目标，总伤害的X%额外对第一顺位目标造成间接伤害（实际攻击范围为6/5/4/3/2/1时，X分别为2/2.5/3/4/6/12）",0,0,0,1200000,"攻击时对第一顺位目标造成额外伤害",1,131,"镶 嵌",5,30,3200,"effect_shuijing_zise3up|effect_shuijing_zise3down",44,"1|2|3|4|5|6|11|12|13|14|15|16|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|151|153|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|252|253|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|351|352|353|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450|451|452|453",},
        [81] = {4105,"精卫飞霞玉·灵韫",4105,6,1,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","治疗武将释放技能时可附加御甲","治疗武将释放技能时，给血量最少的其他己方武将附加一个相当于18%最大生命值的御甲效果",0,0,0,1200000,"释放技能产生治疗效果可附加御甲",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",45,"999",},
        [82] = {4106,"精卫飞霞玉·沐风",4106,6,1,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","每回合行动前可附加御甲","每回合行动开始前，给自身附加一个相当于最大生命值18%的御甲效果。",0,0,0,1200000,"每回合行动前可附加御甲",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",46,"999",},
        [83] = {4107,"精卫飞霞玉·阳炎",4107,6,1,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","己方武将死亡时可恢复生命","己方武将死亡时，自身回复50%最大生命值的血量",0,0,0,1200000,"己方武将死亡时可恢复生命",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",47,"999",},
        [84] = {4108,"精卫飞霞玉·化雨",4108,6,1,0,"",2,"311|312|313|314|411|412|413|414|511|512|513|514","受到伤害时可附加御甲","受到武将直接伤害（溢出伤害除外）时，将25%的伤害转化为御甲附加给自身",0,0,0,1200000,"受到伤害时可附加御甲",1,131,"镶 嵌",5,30,3200,"effect_shuijing_huang3up|effect_shuijing_huang3down",48,"999",},
    }
}

-- index
local __index_id = {
    [1101] = 1,
    [1102] = 2,
    [1103] = 3,
    [1104] = 4,
    [1105] = 5,
    [1106] = 6,
    [1107] = 7,
    [1108] = 8,
    [1109] = 9,
    [1110] = 10,
    [1111] = 11,
    [1112] = 12,
    [1201] = 13,
    [1202] = 14,
    [1203] = 15,
    [1204] = 16,
    [1205] = 17,
    [1206] = 18,
    [1207] = 19,
    [1208] = 20,
    [1209] = 21,
    [1210] = 22,
    [1211] = 23,
    [1212] = 24,
    [1301] = 25,
    [1302] = 26,
    [1303] = 27,
    [1304] = 28,
    [1305] = 29,
    [1306] = 30,
    [1307] = 31,
    [1308] = 32,
    [1309] = 33,
    [1310] = 34,
    [1311] = 35,
    [1312] = 36,
    [1313] = 37,
    [1314] = 38,
    [1315] = 39,
    [1316] = 40,
    [2101] = 41,
    [2102] = 42,
    [2103] = 43,
    [2104] = 44,
    [2105] = 45,
    [2106] = 46,
    [2107] = 47,
    [2108] = 48,
    [2109] = 49,
    [2110] = 50,
    [2111] = 51,
    [2112] = 52,
    [2113] = 53,
    [2114] = 54,
    [2115] = 55,
    [2116] = 56,
    [3101] = 57,
    [3102] = 58,
    [3103] = 59,
    [3104] = 60,
    [3105] = 61,
    [3106] = 62,
    [3201] = 63,
    [3202] = 64,
    [3203] = 65,
    [3204] = 66,
    [3205] = 67,
    [3206] = 68,
    [3301] = 69,
    [3302] = 70,
    [3303] = 71,
    [3304] = 72,
    [3305] = 73,
    [3306] = 74,
    [3307] = 75,
    [3308] = 76,
    [4101] = 77,
    [4102] = 78,
    [4103] = 79,
    [4104] = 80,
    [4105] = 81,
    [4106] = 82,
    [4107] = 83,
    [4108] = 84,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in jade")
        return t._raw[__key_map[k]]
    end
}

-- 
function jade.length()
    return #jade._data
end

-- 
function jade.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function jade.indexOf(index)
    if index == nil or not jade._data[index] then
        return nil
    end

    return setmetatable({_raw = jade._data[index]}, mt)
end

--
function jade.get(id)
    
    return jade.indexOf(__index_id[id])
        
end

--
function jade.set(id, tkey, nvalue)
    local record = jade.get(id)
    if record then
        local keyIndex = __key_map[tkey]
        if keyIndex then
            record._raw[keyIndex] = nvalue
        end
    end
end

--
function jade.index()
    return __index_id
end

return jade