--play_horse_hero

-- key
local __key_map = {
  id = 1,    --序号-int 
  hero_id = 2,    --hero_id-int 
  time_ratio_min = 3,    --单段最低时间系数-int 
  time_ratio_max = 4,    --单段最高时间系数-int 
  bubble_time = 5,    --准备中说话时间段1min-string 
  text_1 = 6,    --文本1-string 
  text_2 = 7,    --文本2-string 
  text_3 = 8,    --文本3-string 
  text_4 = 9,    --文本4-string 

}

-- data
local play_horse_hero = {
    _data = {
        [1] = {1,101,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","习武可制虎豹，集智方取天下，腿长可赢赛跑！","我昨夜观天象，掐指一算，今日第一必归我。","我司马世家，怎会输掉这个比赛。","谁敢跑我前面，我枭首杖伺候。",},
        [2] = {2,108,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","别看我胖，我滚起来可快了！","没见识过跑得快的胖子吧，等会让你看看眼。","我拎着大铁锤也能跑过你，信不！","我单手倒拖牛尾走百步，区区赛跑不在话下。",},
        [3] = {3,110,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","让你们看看最美男人，最灵动的步伐。","我有无敌盾，赛跑时休想扯我衣裳。","我以擅长利用地形著称，赛场地形我已经摸了透。","为这场比赛，我可是置办了新行头。",},
        [4] = {4,112,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","我一女子参加比赛，大家让着点哟。","敢比我跑得快的，鞭子伺候。","我腰以下全是腿，跑步能慢嘛！","是男人就先让我跑两丈地。",},
        [5] = {5,113,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","别看我容貌短小，跑步我可不差。","“五子良将”里属我最跑快。","我打小穿梭市集，脚力甚好。","小声跟你讲，每次于禁都跑不过我。",},
        [6] = {6,115,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","孰重孰轻，一称便知，谁快谁慢，一比便是。","跑步有助身体健康，不容易生病。","爹爹对我宠爱有加，我怎可丢爹爹脸。","我昨日还和哥哥曹丕练习赛跑，我不比他慢哟。",},
        [7] = {7,118,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","让司马懿滚一边去！今天老娘必拿第一！","赢下这场比赛，让司马懿另眼相看！","柏夫人虽然年轻，但没我有韵味啊！","无来无去，不悔不怨。",},
        [8] = {8,119,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","疾风行者这名号如何，若能获胜以后便用此名号了。","别听乐进的，“五子良将”里跑步我才是最快的。","等下就让你们见识我疾风般的速度。","乐进再说我没他跑得快，我就削他。",},
        [9] = {9,123,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","我可是刺客，速度是最快的！","跑到第一，拿了赏银，我就去买件新装备！","太久没杀人，我的刀都快生锈了！","跑完比赛，我就请命去刺杀！",},
        [10] = {10,130,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","孟德会来看我比赛吗？","妾身体弱，可不擅长这塞道之事。","知闺中乐事，才晓人生之味。","比赛有什么好玩的，何不比赛之后来找我玩。",},
        [11] = {11,201,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","七进七出，论速度我最快！","大家记住了，我可是人称常胜将军的男人。","我抱个娃子，也能跑赢你们。","一片赤胆平乱世，脚底生风拿第一！",},
        [12] = {12,205,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","贵为“五虎上将”之首、武圣，不拿第一多没面子。","早年因犯事逃至幽州涿郡，就因为跑得快。","温酒斩华雄算啥，待我温酒得第一。","我可是骑赤兔马的男人，速度怎会慢！",},
        [13] = {13,206,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","我吼一嗓子，就能把你们都震倒。","待我饮一坛烈酒，再与你们赛跑。","谁说屠夫不能拿第一的，今天就让你们大开眼界。","我燕人张翼德今天就是要拿第一，谁也别拦着！",},
        [14] = {14,207,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","打小就是套马的汉子，飞奔的骏马。","黄忠来了嘛，快用合体技把我射出去！","认真讲，五虎上将里数我最能跑。","你看我姓马，就知道我和马跑得一样快。",},
        [15] = {15,213,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","族人当中，就数我跑得最快。","谁又称我们南蛮呢？有本事出来和我比比！","别跟我提七擒孟获，让诸葛亮出来，我们赛道上较量。","论谋略可能没有谋士厉害，论赛跑可就不一定了！",},
        [16] = {16,214,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","看我的尾巴性感吧！","虽为女辈，但我可不比你们跑得慢。","我打小山中穿梭猎兔杀猪，身手敏捷得很。","让诸葛亮出来，我要在赛场上给夫君报七擒七纵之恨。",},
        [17] = {17,215,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","打打杀杀真没意思，还是这赛跑有意思。","我把熊猫丢过线，能算我赢吗？","仁德治天下，比赛重在参与。","快开始比赛，结束了我还要去抱熊猫呢。",},
        [18] = {18,216,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","看比赛的人真多，好害羞啊！","主公，主公，星彩一定会为你跑个冠军的！","嗯，这么多人比赛啊，有点怕怕哦。","人这么多，小心中暑！",},
        [19] = {19,217,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","虎父无犬女，我关三小姐可不差。","我关银屏美丽聪慧，一身武艺，这就给爹爹拿个第一。","总有一天我会超过爹爹，就从今天拿第一开始吧！","今天我一定要跑个第一，给爹爹争口气。",},
        [20] = {20,230,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","我自小便精通骑射，这跑步功夫也难不倒我！","主公，我一定为您跑个冠军回来！","还在倒计时？能不能快点开始！","我要拿个第一来证明我自己！",},
        [21] = {21,301,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","吾乃江东小霸王孙伯符！","江东子弟，何惧于天下！","我孙伯符今天势夺第一！","江东的子弟们，看好了！",},
        [22] = {22,302,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","太阳这么大，晒黑了怎么办？还好有莲华幽伞保护我！","伯符人呢，说好为我加油的呢。","赢了比赛就输了人生，你们舍得赢我吗？","等下帮我看看，我跑起来好看吗。",},
        [23] = {23,304,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","哼，不要小瞧女孩子呦！","公瑾说，跑输跑赢不重要，开心才最重要！","嘻嘻，我的星华双扇肯定能帮我拿冠军！","输赢不重要，开心才是最重要的!",},
        [24] = {24,308,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","这里，是我甘宁的地盘！","我的地盘，我肯定能拿冠军！","在我锦帆的怒涛之下，你们都是渣渣！","我甘兴霸要把自己的名字写在冠军奖杯上！",},
        [25] = {25,310,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","英姿飒爽，不让须眉！","征战沙场都不在话下，何况这小小赛道。","就算哥哥在场，我也不会相让！比赛，就要竭尽所能！","如果我跑太快，玄德还能追上我吗。",},
        [26] = {26,313,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","奏乐能不能小声点，我耳朵都快炸了！","给我一朵云，我能跑十万八千里给你看！","谁欺我年少轻狂，我就跑个第一让他好看！","哈哈，今天我一定能拿第一！",},
        [27] = {27,317,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","妾心所系，如月之恒。","小妹妹唱歌郎奏琴，人生谁不惜青春。","君子乐胥，万邦之屏。","小妹妹似线郎似针，郎呀穿在一起不离分。",},
        [28] = {28,318,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","这么皮？竟然让我一个瞎子来跑步！","这，万一跑到别人的赛道怎么算？","谁坑我，给我报的名啊？","你们帮我看看，莫非这是残疾人运动会？",},
        [29] = {29,319,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","提着灯笼跑步，帅不帅？","仲谋说我脸长似驴，你们觉得呢？","我诸葛一族，人才辈出！","孔明说志当存高远，不想拿第一，还参加什么比赛啊。",},
        [30] = {30,403,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","我的貂蝉呢？我的赤兔呢？","我战神吕布就算不骑马，照样赢你们。","你们就算骑马也赢不了我！","整个天下都是我吕布的，何况这小小赛道！",},
        [31] = {31,404,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","嘤嘤嘤…妾身当尽力而为，方不负吕布一片痴心。","谁会在终点迎接我呢？","妾身十分想念奉先。","无论输赢，奉先都会爱我如故！",},
        [32] = {32,405,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","哈哈，选中本太师，你真有眼光！","等拿了第一，本太师请你喝酒吃肉抱美人！","谁敢跑在本太师前面，剁了他！","我们凉州人士，从来就没怕过输！",},
        [33] = {33,410,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","待会谁敢接近我，我就毒死他！","你们是来比赛的，而我于吉是来遛我家小傀儡的！","小傀儡满肚子都是毒液，靠近我们小心被毒死！","道法玄机，赢比赛轻轻松松！",},
        [34] = {34,412,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","谁敢枪我的玉玺？谁敢赢我？","我是袁家嫡子，今天肯定拿第一！","谁拿第一，封爵赏地！","我的天残神腿，跑起来特别快！",},
        [35] = {35,415,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","马头琴好重，今天能拿第一吗？","妾身可抚琴，可做赋，可撰书，你确定要让我上场吗？","听到这熟悉的音乐，我想起了小时候。","人生苦短，不如开开心心来参加一场比赛。",},
        [36] = {36,416,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","只要奉先不在，我肯定拿第一！","若今天能跑赢比赛，霸业可图也！","我能跑过吕布，你信不信？","谁拿了今天的冠军，我定当辅佐于他！",},
        [37] = {37,417,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","我骑竹马，谁有我跑得快！","来来来，送你吃梨，你让让我好不好！","名门之后，必夺第一！","阿斗呢，等跑完比赛我就去玩玩他的小熊猫。",},
        [38] = {38,418,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","我爹爹可是战神吕布！所以我不能输！","我只想上阵杀敌！参加比赛太大大材小用了！","爹爹答应我，跑赢了就不用嫁给袁术的儿子！","等我拿了冠军，我要把奖杯送给爹爹当酒杯！",},
        [39] = {39,419,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","断子绝孙的味道，想尝尝吗？","哼，跑不赢比赛，我就剪了你！","何进那厮要杀我，我可得跑快一点！","董卓要进京了，大家快跑啊！",},
        [40] = {40,428,20,200,"181,200|161,180|141,160|121,140|101,120|81,100|61,80|41,60|21,40|1,20","等会谁敢跑在我前面，我的大锤可饶不了他！","咳咳，我说在场的诸位，你们肯定跑不赢我！","我这体型，一看就是冠军啊。","勇者无惧，我肯定能拿第一！",},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in play_horse_hero")
        return t._raw[__key_map[k]]
    end
}

-- 
function play_horse_hero.length()
    return #play_horse_hero._data
end

-- 
function play_horse_hero.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function play_horse_hero.indexOf(index)
    if index == nil or not play_horse_hero._data[index] then
        return nil
    end

    return setmetatable({_raw = play_horse_hero._data[index]}, mt)
end

--
function play_horse_hero.get(id)
    
    return play_horse_hero.indexOf(__index_id[id])
        
end

--
function play_horse_hero.set(id, key, value)
    local record = play_horse_hero.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function play_horse_hero.index()
    return __index_id
end

return play_horse_hero