--return_privilege

-- key
local __key_map = {
  id = 1,    --编号-int 
  vip_min = 2,    --VIP等级下限-int 
  vip_max = 3,    --VIP等级上限-int 
  day_min = 4,    --流失天数下限-int 
  day_max = 5,    --流失天数上限-int 
  privilege_type = 6,    --特权类型-int 
  privilege_value = 7,    --特权次数-int 
  recover = 8,    --刷新方式-int 
  privilege_txt = 9,    --特权说明-string 
  function_id = 10,    --功能跳转-int 
  button_txt = 11,    --按钮文字-string 
  is_work = 12,    --是否生效-int 

}

-- data
local return_privilege = {
    _data = {
        [1] = {1,0,16,14,28,1,15,0,"重置日常副本",54,"重置|去战斗",1,},
        [2] = {2,0,16,14,28,2,15,0,"重置过关斩将",76,"重置|去战斗",1,},
        [3] = {3,0,16,14,28,3,160,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [4] = {4,0,16,14,28,4,90,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [5] = {5,0,16,14,28,5,35,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [6] = {6,0,16,14,28,6,240,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [7] = {7,0,16,14,28,7,0,0,"军团祭祀和今日军团声望双倍",5,"去军团",0,},
        [8] = {8,0,16,14,28,8,0,0,"每日签到获得的奖励双倍",608,"去领取",0,},
        [9] = {9,0,16,14,28,9,0,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [10] = {10,0,16,14,28,10,0,0,"每日任务奖励双倍",8,"去领取",0,},
        [11] = {11,0,16,29,42,1,30,0,"重置日常副本",54,"重置|去战斗",1,},
        [12] = {12,0,16,29,42,2,30,0,"重置过关斩将",76,"重置|去战斗",1,},
        [13] = {13,0,16,29,42,3,320,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [14] = {14,0,16,29,42,4,180,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [15] = {15,0,16,29,42,5,35,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [16] = {16,0,16,29,42,6,480,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [17] = {17,0,16,29,42,7,0,0,"军团祭祀和今日军团声望双倍",5,"去军团",0,},
        [18] = {18,0,16,29,42,8,0,0,"每日签到获得的奖励双倍",608,"去领取",0,},
        [19] = {19,0,16,29,42,9,0,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [20] = {20,0,16,29,42,10,0,0,"每日任务奖励双倍",8,"去领取",0,},
        [21] = {21,0,16,43,9999,1,45,0,"重置日常副本",54,"重置|去战斗",1,},
        [22] = {22,0,16,43,9999,2,45,0,"重置过关斩将",76,"重置|去战斗",1,},
        [23] = {23,0,16,43,9999,3,480,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [24] = {24,0,16,43,9999,4,270,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [25] = {25,0,16,43,9999,5,35,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [26] = {26,0,16,43,9999,6,720,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [27] = {27,0,16,43,9999,7,0,0,"军团祭祀和今日军团声望双倍",5,"去军团",0,},
        [28] = {28,0,16,43,9999,8,0,0,"每日签到获得的奖励双倍",608,"去领取",0,},
        [29] = {29,0,16,43,9999,9,0,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [30] = {30,0,16,43,9999,10,0,0,"每日任务奖励双倍",8,"去领取",0,},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in return_privilege")
        return t._raw[__key_map[k]]
    end
}

-- 
function return_privilege.length()
    return #return_privilege._data
end

-- 
function return_privilege.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function return_privilege.indexOf(index)
    if index == nil or not return_privilege._data[index] then
        return nil
    end

    return setmetatable({_raw = return_privilege._data[index]}, mt)
end

--
function return_privilege.get(id)
    
    return return_privilege.indexOf(__index_id[id])
        
end

--
function return_privilege.set(id, tkey, nvalue)
    local record = return_privilege.get(id)
    if record then
        local keyIndex = __key_map[tkey]
        if keyIndex then
            record._raw[keyIndex] = nvalue
        end
    end
end

--
function return_privilege.index()
    return __index_id
end

return return_privilege