--tactics

-- key
local __key_map = {
  id = 1,    --战法id-int 
  name = 2,    --战法名称-string 
  icon = 3,    --战法icon-int 
  color = 4,    --战法品质-int 
  profile = 5,    --战法短描述-string 
  description = 6,    --战法详情-string 
  mapping = 7,    --适用武将库-int 
  show_day = 8,    --图鉴显示天数-int 
  order = 9,    --图鉴排序-int 
  mutex = 10,    --互斥战法-string 
  limit = 11,    --限制人次-int 
  gm = 12,    --GM是否可以发放-int 
  fake = 13,    --假战力-int 
  button_type = 14,    --按钮类型-int 
  function_id = 15,    --跳转功能id-int 
  button_txt = 16,    --按钮文字-string 
  moving = 17,    --特效-string 

}

-- data
local tactics = {
    _data = {
        [1] = {15001,"坚守",15001,5,"受到伤害降低","受到的直接伤害降低10%",15001,100,1,"",1,1,800000,0,0,"","",},
        [2] = {15002,"强攻",15002,5,"伤害提高","直接伤害提高10%",15002,100,2,"",1,1,800000,0,0,"","",},
        [3] = {15003,"暴虐",15003,5,"回怒战法","敌方武将被降低怒气时，自身回复1点怒气（每回合最大不超过2点）",15003,100,3,"",1,1,800000,0,0,"","",},
        [4] = {15004,"遗计",15004,5,"为队友回怒","死亡时将自身剩余怒气翻倍并且平分给己方武将，最低获得1点怒气",15004,100,4,"",1,1,800000,0,0,"","",},
        [5] = {15005,"挑衅",15005,5,"受到伤害降低","本回合受到同一武将的攻击时，每多被攻击一次，自身受到的伤害降低15%",15005,100,5,"",1,1,800000,0,0,"","",},
        [6] = {15006,"激将",15006,5,"回合结束提升伤害","整体回合结束时，提升自身8%的伤害，可叠加，最高不超过24%，持续到战斗结束",15006,100,6,"",1,1,800000,0,0,"","",},
        [7] = {15007,"退守",15007,5,"释放技能回怒","释放技能时，如果敌方武将没有受到控制效果，返回技能消耗的50%怒气，最多2点。",15007,100,7,"",1,1,800000,0,0,"","",},
        [8] = {15008,"识途",15008,5,"回合结束回血","回合结束时，己方武将回合内每行动1次，自身回复生命上限5%的血量",15008,100,8,"",1,1,800000,0,0,"","",},
        [9] = {15009,"怒火",15009,5,"增加伤害","己方每死亡一名武将，自身伤害增加12%，最高不超过24%，持续到战斗结束",15009,100,9,"",1,1,800000,0,0,"","",},
        [10] = {15010,"巧变",15010,5,"回合结束回血加伤害","整体回合结束时，如果血量低于50%，自身回复生命上限24%的血量；整体回合结束时，如果血量不低于50%，增加自身10%的伤害，持续1回合",15010,100,10,"",1,1,800000,0,0,"","",},
        [11] = {15011,"奇袭",15011,5,"普攻额外回怒","普攻额外回复自身1点怒气",15011,100,11,"",1,1,800000,0,0,"","",},
        [12] = {15012,"烈刃",15012,5,"攻击灼烧目标回怒","对敌方灼烧目标进行攻击时，额外回复自身1点怒气",15012,100,12,"",1,1,800000,0,0,"","",},
        [13] = {15013,"识破",15013,5,"攻击状态目标增加伤害","对敌方麻痹、中毒、沉默、眩晕目标进行攻击时，额外增加15%伤害。",15013,100,13,"",1,1,800000,0,0,"","",},
        [14] = {15014,"神速",15014,5,"追击伤害增加","追击伤害增加15%",15014,100,14,"",1,1,800000,0,0,"","",},
        [15] = {15015,"勇决",15015,5,"处于异常状态减少伤害","如果自身处于中毒、灼烧、眩晕、麻痹、沉默、压制、虚弱状态时，受到的武将直接伤害降低15%。",15015,100,15,"",1,1,800000,0,0,"","",},
        [16] = {15016,"逢春",15016,5,"处于持续治疗时回怒","自身的持续治疗效果生效时，有25%的几率获得1点怒气。",15016,100,16,"",1,1,800000,0,0,"","",},
        [17] = {15017,"王佐",15017,5,"释放技能降低目标怒气","释放技能时额外使敌方怒气最多的目标降低2点怒气。",15017,100,17,"",1,1,800000,0,0,"","",},
        [18] = {15018,"开阳",15018,5,"释放技能回怒","释放技能额外回复自身1点怒气",15018,100,18,"",1,1,800000,0,0,"","",},
        [19] = {15019,"灵魄",15019,5,"清除己方武将状态","释放技能清除己方血量最低武将的中毒、灼烧、眩晕、麻痹、沉默效果",15019,100,19,"",1,1,800000,0,0,"","",},
        [20] = {15020,"远虑",15020,5,"回合结束回怒加伤害","行动前如果自身怒气低于4点，则本回合不行动并且在回合结束时回复自身4点怒气",15020,100,20,"",1,1,800000,0,0,"","",},
        [21] = {16001,"奇谋策",101,6,"增加自身伤害","敌方受到眩晕，麻痹，沉默，压制效果时，自身获得伤害加成12%，最高不超过24%，持续1回合",16001,999,1,"",1,0,20000,0,0,"","",},
        [22] = {16002,"七窍玲珑",16002,7,"闪避技能攻击","每回合闪避第一次敌方输出武将的技能。（优先级高于敌方攻击的必命中效果）",16002,100,2,"",1,1,9600000,0,0,"","",},
        [23] = {16003,"扬军威",16003,6,"清除状态加伤害","释放技能消耗的怒气高于当前回合时，清除己方血量最少的目标身上中毒，灼烧，眩晕，麻痹，沉默效果；释放技能消耗的怒气数不高于当前回合时，本次技能伤害提高15%",16003,100,3,"",1,1,2400000,0,0,"","",},
        [24] = {16004,"走为上",16004,6,"受伤回血","受到敌方单体输出武将技能攻击时，回复24%的生命上限血量。",16004,100,4,"",1,1,2400000,0,0,"","",},
        [25] = {16005,"守如山",16005,6,"损失血量免疫控制","当自身受到中毒、灼烧、眩晕、麻痹、沉默、压制、虚弱、击飞时，损失12%的生命上限血量免疫中毒、灼烧、眩晕、麻痹、沉默；损失18%的生命上限血量免疫压制，虚弱，击飞。（该伤害不会导致死亡）",16005,100,5,"",1,1,2400000,0,0,"","",},
        [26] = {16006,"掠如火",106,6,"提高伤害","伤害提高18%",16006,999,6,"",1,0,20000,0,0,"","",},
        [27] = {16007,"同心策",16007,6,"群体受伤回怒","当自身受到直接伤害时，回复己方全体武将1点怒气，每回合最多触发2次。",16007,100,7,"",1,1,2400000,0,0,"","",},
        [28] = {16008,"凝神计",16008,6,"血量低时解状态回怒","血量低于50%时，立即清除自身中毒、灼烧、眩晕、麻痹、沉默效果并且回复18%生命上限的血量，每回合限1次",16008,100,8,"",1,1,2400000,0,0,"","",},
        [29] = {16009,"福同享",16009,6,"自身和己方武将回怒","整体回合结束时，如果己方武将怒气与自身相同，自身和目标同时回复2点怒气",16009,100,9,"",1,1,2400000,0,0,"","",},
        [30] = {16010,"动如雷霆",16010,7,"抽取己方怒气释放技能","释放技能怒气不足时，抽取己方怒气最高的其他同阵营武将怒气，每抽取1点怒气，伤害增加12%，最大不超过36%（只会抽取怒气高于4点的己方武将，抽取怒气后如果依旧不足以释放技能，则不抽取）",16010,100,10,"",1,1,9600000,0,0,"","",},
        [31] = {16011,"如磐石",16011,6,"受到伤害降低","受到的直接伤害降低15%",16011,100,11,"",1,1,2400000,0,0,"","",},
        [32] = {17001,"承天之佑",1101,7,"神兽效果为2倍","受到神兽释放的增益效果（青龙，玄武，朱雀）时，其效果为原来的2倍",17001,100,1,"",1,0,40000,0,0,"","",},
        [33] = {17002,"气定神闲",17002,7,"免疫神兽效果","免疫敌方神兽所造成的任何效果（仅可免疫1次白泽的放逐）",17002,100,2,"",1,1,9600000,0,0,"","",},
        [34] = {17003,"怀若谷",17003,6,"回怒并且免疫状态","如果本回合自身没有行动，则回复2点怒气并且获得免疫异常效果（中毒，灼烧，眩晕，麻痹，沉默，压制，虚弱，击飞，放逐）的护盾，持续1回合",17003,100,3,"",1,1,2400000,0,0,"","",},
        [35] = {17004,"连理并蒂",17004,7,"治疗同阵营加御甲","释放技能治疗己方目标时，如果目标阵营与自身相同，则为己方目标增加生命上限15%的御甲效果。",17004,100,4,"",1,1,9600000,0,0,"","",},
        [36] = {17005,"伺机而动",17005,7,"己方武将追击增加自身御甲","当己方其他武将触发追击效果时，自身增加相当于生命上限15%的御甲效果，每回合最多触发3次。",17005,100,5,"",1,1,9600000,0,0,"","",},
        [37] = {17006,"出其不意",17006,7,"不消耗怒气释放技能","行动前如果自身怒气低于4点，也可释放技能，4点怒气以下每少1点怒气，直接伤害降低15%。",17006,100,6,"",1,1,9600000,0,0,"","",},
        [38] = {17007,"坚不可摧",17007,7,"御甲效果加强","受到御甲效果影响时，获得的御甲效果增加30%",17007,100,7,"",1,1,9600000,0,0,"","",},
        [39] = {17008,"枯木逢春",17008,7,"溢出治疗增加御甲","释放技能治疗目标时，溢出治疗的16%转化为御甲附加给目标",17008,100,8,"",1,1,9600000,0,0,"","",},
        [40] = {17009,"移花接木",17009,7,"清除异常","己方其他武将受到清除异常的效果时，自身也同时获得清除该异常的效果",17009,100,9,"",1,1,9600000,0,0,"","",},
        [41] = {17010,"火神之怒",17010,7,"攻击目标处于灼烧状态","攻击时，始终视敌方目标处于灼烧状态",17010,100,10,"",1,1,9600000,0,0,"","",},
        [42] = {16012,"察秋毫",16012,6,"治疗效果降低","攻击时，为敌方目标附加重伤状态，降低50%除治疗武将释放的治疗效果以外的所有治疗效果，持续1回合。",16012,100,12,"",1,1,2400000,0,0,"","",},
        [43] = {17011,"追魂夺魄",17011,7,"攻击造成间接伤害","攻击没有击杀目标，总伤害的X%额外对第一顺位目标造成间接伤害（实际攻击范围为6/5/4/3/2/1时，X分别为2.5/3/3.75/5/7.5/15）",17011,100,11,"",1,0,9600000,0,0,"","",},
        [44] = {17012,"左右逢源",17012,7,"受到伤害降低，回复自身怒气","受到男性武将攻击时，直接伤害降低20%；受到女性武将攻击时，额外回复自身1点怒气",17012,100,13,"",1,1,9600000,0,0,"","",},
        [45] = {17013,"承天之佑",17013,7,"获得御甲","血量低于50%时，获得相当于27%生命上限的御甲效果，每回合限一次",17013,100,14,"",1,1,9600000,0,0,"","",},
        [46] = {17014,"灵神之护 ",17014,7,"获得御甲","战斗中敌方武将获得御甲效果时，自身也增加相当于敌方获得的御甲效果的25%（通过此战法获得的御甲效果不会再次触发此战法）",17014,100,15,"",1,1,9600000,0,0,"","",},
        [47] = {17015,"谋而后动",17015,7,"增加伤害","己方其他同品质武将出手后，伤害增加8%，最大不超过24%",17015,100,16,"",1,1,9600000,0,0,"","",},
    }
}

-- index
local __index_id = {
    [15001] = 1,
    [15002] = 2,
    [15003] = 3,
    [15004] = 4,
    [15005] = 5,
    [15006] = 6,
    [15007] = 7,
    [15008] = 8,
    [15009] = 9,
    [15010] = 10,
    [15011] = 11,
    [15012] = 12,
    [15013] = 13,
    [15014] = 14,
    [15015] = 15,
    [15016] = 16,
    [15017] = 17,
    [15018] = 18,
    [15019] = 19,
    [15020] = 20,
    [16001] = 21,
    [16002] = 22,
    [16003] = 23,
    [16004] = 24,
    [16005] = 25,
    [16006] = 26,
    [16007] = 27,
    [16008] = 28,
    [16009] = 29,
    [16010] = 30,
    [16011] = 31,
    [16012] = 42,
    [17001] = 32,
    [17002] = 33,
    [17003] = 34,
    [17004] = 35,
    [17005] = 36,
    [17006] = 37,
    [17007] = 38,
    [17008] = 39,
    [17009] = 40,
    [17010] = 41,
    [17011] = 43,
    [17012] = 44,
    [17013] = 45,
    [17014] = 46,
    [17015] = 47,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in tactics")
        return t._raw[__key_map[k]]
    end
}

-- 
function tactics.length()
    return #tactics._data
end

-- 
function tactics.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function tactics.indexOf(index)
    if index == nil or not tactics._data[index] then
        return nil
    end

    return setmetatable({_raw = tactics._data[index]}, mt)
end

--
function tactics.get(id)
    
    return tactics.indexOf(__index_id[id])
        
end

--
function tactics.set(id, tkey, nvalue)
    local record = tactics.get(id)
    if record then
        local keyIndex = __key_map[tkey]
        if keyIndex then
            record._raw[keyIndex] = nvalue
        end
    end
end

--
function tactics.index()
    return __index_id
end

return tactics