--hero

-- key
local __key_map = {
  id = 1,    --id-int 
  name = 2,    --名称-string 
  type = 3,    --卡类型-int 
  color = 4,    --品质-int 
  limit = 5,    --界限突破-int 
  potential = 6,    --潜力-int 
  gender = 7,    --性别-int 
  country = 8,    --阵营-int 
  job = 9,    --职业-int 
  res_id = 10,    --资源id-int 
  limit_res_id = 11,    --界限资源id-int 
  atk_base = 12,    --初始攻击-int 
  pdef_base = 13,    --初始物防-int 
  mdef_base = 14,    --初始魔防-int 
  hp_base = 15,    --初始生命-int 
  atk_grow = 16,    --成长攻击-int 
  pdef_grow = 17,    --成长物防-int 
  mdef_grow = 18,    --成长魔防-int 
  hp_grow = 19,    --成长生命-int 
  hit_base = 20,    --初始命中-int 
  no_hit_base = 21,    --初始闪避-int 
  crit_base = 22,    --初始暴击-int 
  no_crit_base = 23,    --初始抗暴-int 
  hurt_type = 24,    --伤害类型-int 
  skill_3_type = 25,    --合击关系-int 
  skill_3_partner = 26,    --合击武将-int 
  description = 27,    --武将描述-string 
  description1 = 28,    --show武将描述1-string 
  description2 = 29,    --show武将描述2-string 
  feature = 30,    --武将定位-string 
  skill_name = 31,    --武将技能名称-string 
  skill_description = 32,    --武将技能简介-string 
  instrument_id = 33,    --专属神兵名称-int 
  instrument_description = 34,    --专属神兵描述-string 
  words = 35,    --气泡文字-int 
  lvup_base = 36,    --初始等级-int 
  lvup_cost = 37,    --升级模板-int 
  rank_base = 38,    --初始突破-int 
  rank_max = 39,    --突破上限-int 
  rank_cost = 40,    --突破模板-int 
  awaken_base = 41,    --初始觉醒-int 
  awaken_max = 42,    --觉醒上限-int 
  awaken_cost = 43,    --觉醒模板-int 
  exp = 44,    --吞噬经验-int 
  soul = 45,    --分解将魂-int 
  coin = 46,    --出售银两-int 
  fragment_id = 47,    --碎片id-int 
  instrument = 48,    --神兵-int 
  friend_1 = 49,    --缘分1-int 
  friend_2 = 50,    --缘分2-int 
  friend_3 = 51,    --缘分3-int 
  friend_4 = 52,    --缘分4-int 
  friend_5 = 53,    --缘分5-int 
  friend_6 = 54,    --缘分6-int 
  friend_7 = 55,    --缘分7-int 
  friend_8 = 56,    --缘分8-int 
  fate_1 = 57,    --羁绊1-int 
  fate_2 = 58,    --羁绊2-int 
  fate_3 = 59,    --羁绊3-int 
  fate_4 = 60,    --羁绊4-int 
  fate_5 = 61,    --羁绊5-int 
  fate_6 = 62,    --羁绊6-int 
  fate_7 = 63,    --羁绊7-int 
  fate_8 = 64,    --羁绊8-int 
  fate_9 = 65,    --羁绊9-int 
  fate_10 = 66,    --羁绊10-int 
  fate_11 = 67,    --羁绊11-int 
  fate_12 = 68,    --羁绊12-int 
  fate_13 = 69,    --羁绊13-int 
  fate_14 = 70,    --羁绊14-int 
  fate_15 = 71,    --羁绊15-int 
  fate_16 = 72,    --羁绊16-int 
  fate_17 = 73,    --羁绊17-int 
  fate_18 = 74,    --羁绊18-int 
  fate_19 = 75,    --羁绊19-int 
  fate_20 = 76,    --羁绊20-int 
  fate_21 = 77,    --羁绊21-int 
  fate_22 = 78,    --羁绊22-int 
  fate_23 = 79,    --羁绊23-int 
  fate_24 = 80,    --羁绊24-int 
  fate_25 = 81,    --羁绊25-int 
  fate_26 = 82,    --羁绊26-int 
  fate_27 = 83,    --羁绊27-int 
  fate_28 = 84,    --羁绊28-int 
  fate_29 = 85,    --羁绊29-int 
  is_show = 86,    --图鉴是否显示-int 
  sum_type = 87,    --伤害统计类型-int 
  silk = 88,    --武将类型（锦囊）-string 
  show_day = 89,    --图鉴显示天数-int 
  change_type = 90,    --置换规则-int 
  is_fight = 91,    --无差别竞技里可用赛区-int 

}

-- data
local hero = {
    _data = {
        [1] = {1,"主角",1,2,0,100,1,0,0,1,0,60,33,27,495,4,2,2,33,1000,0,0,0,1,0,0,"身长八尺，容貌英俊，年少有为，武艺高超，好结识名将，有一统三国，成为三国最强武将的志向。性格爽朗，为人豁达，与三国知名英雄刘备、关羽、张飞结拜，被称为“四弟”。","我是男主角，我最厉害","我是男主角，我最厉害","","","",1,"",1,1,0,0,12,1,0,80,2,0,0,0,0,1,90101,90102,90103,0,0,0,0,0,90151,90152,90153,90154,5201,5211,90161,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"1",0,0,0,},
        [2] = {2,"主角",1,3,0,100,1,0,0,1,0,60,33,27,495,4,2,2,33,1000,0,0,0,1,0,0,"身长八尺，容貌英俊，年少有为，武艺高超，好结识名将，有一统三国，成为三国最强武将的志向。性格爽朗，为人豁达，与三国知名英雄刘备、关羽、张飞结拜，被称为“四弟”。","我是男主角，我最厉害","我是男主角，我最厉害","","","",1,"",1,1,0,0,12,1,0,80,2,0,0,0,0,1,90201,90202,90203,90204,0,0,0,0,90151,90152,90153,90154,5201,5211,90161,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"1",0,0,0,},
        [3] = {3,"主角",1,4,0,100,1,0,0,1,0,60,33,27,495,4,2,2,33,1000,0,0,0,1,0,0,"身长八尺，容貌英俊，年少有为，武艺高超，好结识名将，有一统三国，成为三国最强武将的志向。性格爽朗，为人豁达，与三国知名英雄刘备、关羽、张飞结拜，被称为“四弟”。","我是男主角，我最厉害","我是男主角，我最厉害","","","",1,"",1,1,0,0,12,1,0,80,2,0,0,0,0,1,90301,90302,90303,90304,90305,0,0,0,90151,90152,90153,90154,90155,90156,90157,90158,5201,5211,5301,5311,90161,5401,5411,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"1",0,0,0,},
        [4] = {4,"主角",1,5,0,100,1,0,0,1,0,60,33,27,495,4,2,2,33,1000,0,0,0,1,0,0,"身长八尺，容貌英俊，年少有为，武艺高超，好结识名将，有一统三国，成为三国最强武将的志向。性格爽朗，为人豁达，与三国知名英雄刘备、关羽、张飞结拜，被称为“四弟”。","我是男主角，我最厉害","我是男主角，我最厉害","","","",1,"",1,1,0,0,12,1,0,80,2,0,0,0,0,1,90401,90402,90403,90404,90405,90406,0,0,90151,90152,90153,90154,90155,90156,90157,90158,90163,90164,90165,90166,90167,90168,90169,90170,90171,90172,90173,90174,5201,5211,5301,5311,90161,5401,5411,5501,5511,0,0,"1",0,0,0,},
        [5] = {5,"主角",1,6,0,100,1,0,0,1,0,60,33,27,495,4,2,2,33,1000,0,0,0,1,0,0,"身长八尺，容貌英俊，年少有为，武艺高超，好结识名将，有一统三国，成为三国最强武将的志向。性格爽朗，为人豁达，与三国知名英雄刘备、关羽、张飞结拜，被称为“四弟”。","我是男主角，我最厉害","我是男主角，我最厉害","","","",1,"",1,1,0,0,12,1,0,80,2,0,0,0,0,1,90501,90502,90503,90504,90505,90506,90507,90508,90151,90152,90153,90154,90155,90156,90157,90158,90163,90164,90165,90166,90167,90168,90169,90170,90171,90172,90173,90174,5201,5211,5301,5311,90161,5401,5411,5501,5511,0,0,"1",0,0,0,},
        [6] = {6,"主角",1,7,0,100,1,0,0,1,0,60,33,27,495,4,2,2,33,1000,0,0,0,1,0,0,"身长八尺，容貌英俊，年少有为，武艺高超，好结识名将，有一统三国，成为三国最强武将的志向。性格爽朗，为人豁达，与三国知名英雄刘备、关羽、张飞结拜，被称为“四弟”。","我是男主角，我最厉害","我是男主角，我最厉害","","","",1,"",1,1,0,0,12,1,0,80,2,0,0,0,0,1,90501,90502,90503,90504,90505,90506,90507,90508,90151,90152,90153,90154,90155,90156,90157,90158,90163,90164,90165,90166,90167,90168,90169,90170,90171,90172,90173,90174,5201,5211,5301,5311,90161,5401,5411,5501,5511,0,0,"1",0,0,0,},
        [7] = {11,"主角",1,2,0,100,2,0,0,11,0,60,27,33,495,4,2,2,33,1000,0,0,0,2,0,0,"名将之后。肤白胜雪，眉宇之间带着不可磨灭的骄傲，光芒四射，英气逼人，武艺高超，立志成为三国最强武将。性格坚韧，百折不挠，与三国知名英雄刘备、关羽、张飞结拜，被称为“四妹”。","我是女主角，我比男主角还厉害","我是女主角，我比男主角还厉害","","","",2,"",2,1,0,0,12,1,0,80,2,0,0,0,0,2,91101,91102,91103,0,0,0,0,0,90151,90152,90153,90154,5203,5213,90162,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"1",0,0,0,},
        [8] = {12,"主角",1,3,0,100,2,0,0,11,0,60,27,33,495,4,2,2,33,1000,0,0,0,2,0,0,"名将之后。肤白胜雪，眉宇之间带着不可磨灭的骄傲，光芒四射，英气逼人，武艺高超，立志成为三国最强武将。性格坚韧，百折不挠，与三国知名英雄刘备、关羽、张飞结拜，被称为“四妹”。","我是女主角，我比男主角还厉害","我是女主角，我比男主角还厉害","","","",2,"",2,1,0,0,12,1,0,80,2,0,0,0,0,2,91201,91202,91203,91204,0,0,0,0,90151,90152,90153,90154,5203,5213,90162,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"1",0,0,0,},
        [9] = {13,"主角",1,4,0,100,2,0,0,11,0,60,27,33,495,4,2,2,33,1000,0,0,0,2,0,0,"名将之后。肤白胜雪，眉宇之间带着不可磨灭的骄傲，光芒四射，英气逼人，武艺高超，立志成为三国最强武将。性格坚韧，百折不挠，与三国知名英雄刘备、关羽、张飞结拜，被称为“四妹”。","我是女主角，我比男主角还厉害","我是女主角，我比男主角还厉害","","","",2,"",2,1,0,0,12,1,0,80,2,0,0,0,0,2,91301,91302,91303,91304,91305,0,0,0,90151,90152,90153,90154,90155,90156,90157,90158,5203,5213,5302,5312,90162,5402,5412,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"1",0,0,0,},
        [10] = {14,"主角",1,5,0,100,2,0,0,11,0,60,27,33,495,4,2,2,33,1000,0,0,0,2,0,0,"名将之后。肤白胜雪，眉宇之间带着不可磨灭的骄傲，光芒四射，英气逼人，武艺高超，立志成为三国最强武将。性格坚韧，百折不挠，与三国知名英雄刘备、关羽、张飞结拜，被称为“四妹”。","我是女主角，我比男主角还厉害","我是女主角，我比男主角还厉害","","","",2,"",2,1,0,0,12,1,0,80,2,0,0,0,0,2,91401,91402,91403,91404,91405,91406,0,0,90151,90152,90153,90154,90155,90156,90157,90158,90163,90164,90165,90166,90167,90168,90169,90170,90171,90172,90173,90174,5203,5213,5302,5312,90162,5402,5412,5502,5512,0,0,"1",0,0,0,},
        [11] = {15,"主角",1,6,0,100,2,0,0,11,0,60,27,33,495,4,2,2,33,1000,0,0,0,2,0,0,"名将之后。肤白胜雪，眉宇之间带着不可磨灭的骄傲，光芒四射，英气逼人，武艺高超，立志成为三国最强武将。性格坚韧，百折不挠，与三国知名英雄刘备、关羽、张飞结拜，被称为“四妹”。","我是女主角，我比男主角还厉害","我是女主角，我比男主角还厉害","","","",2,"",2,1,0,0,12,1,0,80,2,0,0,0,0,2,91501,91502,91503,91504,91505,91506,91507,91508,90151,90152,90153,90154,90155,90156,90157,90158,90163,90164,90165,90166,90167,90168,90169,90170,90171,90172,90173,90174,5203,5213,5302,5312,90162,5402,5412,5502,5512,0,0,"1",0,0,0,},
        [12] = {16,"主角",1,7,0,100,2,0,0,11,0,60,27,33,495,4,2,2,33,1000,0,0,0,2,0,0,"名将之后。肤白胜雪，眉宇之间带着不可磨灭的骄傲，光芒四射，英气逼人，武艺高超，立志成为三国最强武将。性格坚韧，百折不挠，与三国知名英雄刘备、关羽、张飞结拜，被称为“四妹”。","我是女主角，我比男主角还厉害","我是女主角，我比男主角还厉害","","","",2,"",2,1,0,0,12,1,0,80,2,0,0,0,0,2,91501,91502,91503,91504,91505,91506,91507,91508,90151,90152,90153,90154,90155,90156,90157,90158,90163,90164,90165,90166,90167,90168,90169,90170,90171,90172,90173,90174,5203,5213,5302,5312,90162,5402,5412,5502,5512,0,0,"1",0,0,0,},
        [13] = {101,"司马懿",2,6,0,150,1,1,3,101,0,7200,135,165,40500,24,9,11,135,1000,0,0,0,2,1,102,"司马懿[yì]，字仲达，魏国后期第一谋臣，西晋王朝奠基人。博学多才，善谋奇策，被称为鬼才。曾任职曹魏大都督、太尉、太傅，对内肃清政敌独揽朝政，对外征伐有功，两次率大军抵御诸葛亮北伐和远征平定辽东。其用兵如神，擅长防守，曾因鹰视狼顾之相为曹操所忌惮。司马炎称帝后，追尊其为晋宣帝。","魏国杰出的政治家、军事家。","西晋王朝的奠基人。","永动机输出","[鹰视狼顾]","对敌方全体攻击造成伤害。\n出来混，早晚要还的！",101,"释放技能有概率追加1次技能攻击。\n戢鳞潜翼，思属风云。",4001,1,6,0,12,5,0,80,3,0,4500,0,1101,101,10101,10102,10103,10104,10105,10106,10107,10108,10151,10152,10153,10154,10155,5301,5311,10161,5401,5411,5501,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [14] = {102,"荀彧",2,5,1,100,1,1,5,102,91102,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,101,"荀彧[xún yù]，字文若，曹操帐下首席谋臣，曹魏五谋臣之一。清秀通雅，有王佐之才，战略无双，为曹操规划了统一北方的蓝图；明以举贤，为曹操推荐郭嘉、程昱等人才，被曹操赞为[吾之子房]。因长期担任尚书令，被敬称为荀令君，又因其长相俊美、仪表堂堂，好熏香，留下荀令留香的典故，成为美男子的代名词。","曹操统一北方的首席谋臣和功臣。","被称为王佐之才。","治疗","[荀令留香]","为己方血量最少3名目标治疗。\n主公要臣死，臣不得不死！",102,"技能治疗量增加。\n参差管乐，象凤之翼。",4001,1,5,0,12,4,0,80,1,0,1600,0,1102,102,10201,10202,10203,10204,10205,10206,10207,10208,10251,10252,10253,10254,10255,5302,5312,10261,5402,5412,5502,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2|3",0,0,1,},
        [15] = {103,"曹操",2,6,0,150,1,1,2,103,0,6000,165,135,45000,20,11,9,150,1000,0,0,0,1,1,104,"曹操，字孟德，小名阿瞒，汉末军阀，一代奸雄，是魏国实际的奠基人，不仅长于军略，也通音律，善词赋，爵至魏王，其子曹丕建魏后，追谥武帝，即魏武帝。","雄哉魏太祖，天下扫狼烟。","动静皆存智，高低善用贤。","永动机辅助","[气吞山河]","对敌方前排目标造成伤害。\n魏将何在？",103,"全体上阵武将暴击几率增加。\n号令天下，莫敢不从。",4001,1,6,0,12,5,0,80,3,0,4500,0,1103,103,10301,10302,10303,10304,10305,10306,10307,10308,10351,10352,10353,10354,10355,5303,5313,10361,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [16] = {104,"郭嘉",2,5,1,100,1,1,4,104,91104,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,103,"郭嘉，字奉孝，魏国早期最杰出的谋士，曹魏五谋臣之一。官至军师祭酒。才智过人，奇计百出，曹操称他为[奇佐]，但英年早逝，曹操深为痛惜。","天生郭奉孝，豪杰冠群英。","腹内藏经史，胸中隐甲兵。","永动机控制","[翱翔万里]","对敌方前排目标造成伤害。\n咳、咳~~~~",104,"释放技能回复自身怒气。\n皎洁霜雪，荀令留香。",4001,1,5,0,12,4,0,80,1,0,1600,0,1104,104,10401,10402,10403,10404,10405,10406,10407,10408,10451,10452,10453,10454,10455,5304,5314,10461,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|8",0,0,1,},
        [17] = {105,"夏侯惇",2,5,1,100,1,1,1,105,91105,2700,83,68,27000,9,6,5,90,1000,0,0,0,1,1,106,"夏侯惇[dūn]，字元让，曹魏武将，曹魏八虎骑之一，夏侯渊族兄，常为曹操先锋，冲锋在前，杀敌无数，曾被曹性冷箭射中左眼，仍拔箭吃掉了射瞎的眼珠，一枪刺死曹性，留[拔矢啖睛]的知名典故。","曹魏开国元勋。","性格刚烈，勇猛无惧。","永动机肉盾","[开天辟地]","对敌方纵排目标造成伤害。\n以彼之道，还施彼身。",105,"受到普通攻击回复自身怒气。\n劈神斩妖，天地合一。",4001,1,5,0,12,4,0,80,1,0,1600,0,1105,105,10501,10502,10503,10504,10505,10506,10507,10508,10551,10552,10553,10554,10555,5301,5311,10561,5401,5411,5501,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,1,},
        [18] = {106,"曹仁",2,5,1,100,1,1,1,106,91106,3000,83,68,22500,10,6,5,75,1000,0,0,0,1,2,105,"曹仁，字子孝，三国时期曹魏名将，曹魏八虎骑之一，治军严谨，擅长防守。跟随曹操征战多年，功勋卓著，官至大司马。","危身奉上曰忠，险不辞难。","心为气城，兵为城城。","永动机控制","[固若金汤]","对敌方纵排目标造成伤害。\n固若金汤，坚如磐石。",106,"死亡时晕眩击杀自己的武将。\n坚不可摧，牢不可破。",4001,1,5,0,12,4,0,80,1,0,1600,0,1106,106,10601,10602,10603,10604,10605,10606,10607,10608,10651,10652,10653,10654,10655,5302,5312,10661,5402,5412,5502,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|7",0,0,1,},
        [19] = {107,"典韦",2,5,1,100,1,1,1,107,91107,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,1,108,"典韦，曹操武将，身材魁梧，力大无穷，能驱赶猛虎。擅使大双戟，张绣叛变时，为保护曹操力战而死。","铁戟双提八十斤，濮阳城外建功勋。","典韦救主传天下，勇猛当先第一人。","永动机输出","[逆转天下]","对敌方纵排目标造成伤害。\n吃我一戟。",107,"技能伤害增加。\n轮动如飞，人莫敢近。",4001,1,5,0,12,4,0,80,1,0,1600,0,1107,107,10701,10702,10703,10704,10705,10706,10707,10708,10751,10752,10753,10754,10755,5303,5313,10761,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [20] = {108,"许褚",2,5,1,100,1,1,4,108,91108,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,2,107,"许褚[chǔ]，字仲康，曹操武将。年轻时曾单手倒拖牛尾行走百步，吓退贼寇。和典韦一同统率曹操的亲卫队虎卫军，忠心耿耿，勇猛无敌，人称虎痴，曾有裸衣斗马超之举，深为曹操赏识。","凛凛威风镇九州，当年许褚果如虎。","只因孟起军前见，天下从兹播虎侯。","永动机输出","[泰山压顶]","对敌方前排目标造成伤害。\n谁来和我大战300回合！",108,"击杀目标回复自身怒气。\n追魂夺命，一闪即逝。",4001,1,5,0,12,4,0,80,1,0,1600,0,1108,108,10801,10802,10803,10804,10805,10806,10807,10808,10851,10852,10853,10854,10855,5304,5314,10861,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [21] = {109,"张辽",2,5,1,100,1,1,1,109,91109,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,1,110,"张辽，字文远，吕布武将，后仕曹操，曹魏五子良将之一，曾阵斩蹋顿，击破乌桓。建安二十一年，东吴大军进围合肥，张辽领数千精兵大破十万吴军，几乎活捉孙权，小儿止啼的著名典故即由此而来。","为曹操统一北方南征北战。","出生入死，立下了汗马功劳。","永动机输出","[千里奔袭]","对敌方后排目标造成伤害。\n快马突袭，占尽先机。",109,"每回合回复自身怒气。\n闻风丧胆，勾魂摄魄。",4001,1,5,0,12,4,0,80,1,0,1600,0,1109,109,10901,10902,10903,10904,10905,10906,10907,10908,10951,10952,10953,10954,10955,5301,5311,10961,5401,5411,5501,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [22] = {110,"张郃",2,5,1,100,1,1,3,110,91110,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,109,"张郃[hé]，字儁乂[jùn yì]，曹魏五子良将之一。曾仕袁绍，官渡之战中投效曹操，张郃戎马一生，以用兵巧变、善列营阵，长于利用地形著称，跟随曹操后屡建战功。后在诸葛亮第四次北伐时，中埋伏战死。","郃识变量，善处营陈。","料战势地形，无不如计。","永动机辅助","[透骨绝汲]","对敌方后排单体目标造成伤害。\n用兵之道，变化万千。",110,"全体上阵武将暴击几率增加。\n一击毙命，绝无生还。",4001,1,5,0,12,4,0,80,1,0,1600,0,1110,110,11001,11002,11003,11004,11005,11006,11007,11008,11051,11052,11053,11054,11055,5302,5312,11061,5402,5412,5502,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [23] = {111,"曹丕",2,5,1,100,1,1,1,111,91111,3600,68,83,20250,12,5,6,68,1000,0,0,0,2,1,112,"曹丕，字子桓，曹魏开国皇帝，曹操次子，三国时期著名政治家和文学家。曹丕在位期间，对内制定九品中正制，平定青州徐州，完成北方统一，对外大破羌胡，复通西域。曹丕文武全才，不但骑射功夫一流，而且八岁能文，与曹操、曹植并称[建安三曹]。","旷大之度，励以公平之诚。","迈志存道，克广德心。","永动机输出","[摄魂勾魄]","对敌方相邻（十字）目标造成伤害。\n天威浩荡，赞颂武名。",111,"目标越少，技能伤害越高。\n来去无形，凶狠奇诡。",4001,1,5,0,12,4,0,80,1,0,1600,0,1111,111,11101,11102,11103,11104,11105,11106,11107,11108,11151,11152,11153,11154,11155,5303,5313,11161,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [24] = {112,"甄姬",2,5,1,100,2,1,1,112,91112,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,111,"甄姬，三国知名美女，别称甄洛或甄宓[fú] ，文昭甄皇后。倾国倾城，风华绝代，本是魏文帝曹丕的正室妻子，但传说与曹植相爱，相传《洛神赋》即曹植为她所作，成就洛神的千古佳话。","光明之至，盛久而不昧者也。","此女贵乃不可言。","永动机辅助","[洛神之怒]","对敌方前排单体目标造成伤害。\n仿佛兮若轻云之蔽月。",112,"每回合回复自身怒气。\n凌波微步，罗袜生尘。",4001,1,5,0,12,4,0,80,1,0,1600,0,1112,112,11201,11202,11203,11204,11205,11206,11207,11208,11251,11252,11253,11254,11255,5304,5314,11261,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [25] = {113,"乐进",2,4,0,80,1,1,4,113,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,2,117,"乐进，字文谦，曹魏五子良将之一。以胆识英烈而从曹操，随军多年，南征北讨，战功无数。建安二十三年逝世，谥曰威侯。","容貌短小，作战勇猛。","因胆烈跟随曹操，多次有先登之功。","永动机输出","[乾坤运转]","对敌方前排目标造成伤害。\n看我先登城头，立下首功！",113,"普通攻击回复自身血量。\n伺机而发，见血封喉。",4001,1,4,0,8,3,0,80,1,0,400,0,1113,113,11301,11302,11303,11304,11305,0,0,0,11351,11352,11353,11354,5201,5211,11361,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,0,},
        [26] = {114,"徐晃",2,4,0,80,1,1,4,114,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,0,0,"徐晃，字公明，曹魏五子良将之一。善使大斧，曾仕杨奉，后随曹操转战南北，功勋颇多。","降明权成厚，争津定策高。","扬名攻不备，陷敌战当鏖。","永动机输出","[风卷残云]","对敌方纵排目标造成伤害。\n当以功自效。",114,"上场第1回合必暴击。\n钺斧阴阳，何处显名。",4001,1,4,0,8,3,0,80,1,0,400,0,1114,114,11401,11402,11403,11404,11405,0,0,0,11451,11452,11453,11454,5202,5212,11461,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,0,},
        [27] = {115,"曹冲",2,4,0,80,1,1,1,115,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"曹冲，字仓舒，曹操之子。从小聪明仁爱，与众不同，深受曹操喜爱，留有曹冲称象的典故。曹操几次对群臣夸耀他，有让他继嗣之意。可惜曹冲在建安十三年病逝，年仅十三岁。","少聪察岐嶷，生五六岁。","智意所及，有若成人之智。","永动机控制","[神童仁心]","对敌方纵排目标造成伤害。\n孰重孰轻，一称便知。",115,"增加沉默目标的概率。\n钺斧阴阳，何处显名。",4001,1,4,0,8,3,0,80,1,0,400,0,1115,115,11501,11502,11503,11504,11505,0,0,0,11551,11552,11553,11554,5203,5213,11561,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|8",0,0,0,},
        [28] = {116,"曹植",2,4,0,80,1,1,1,116,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"曹植，字子建，曹操之子，曹丕之弟。才华横溢，卓尔不群，汉末著名文学家，代表作有《洛神赋》《白马篇》等，是建安七子的代表人物，与曹操、曹丕合称三曹。生前曾为陈王，去世后谥号思，因此又称陈思王。","以公子之豪，下笔琳琅。","并体貌英逸，故俊才云蒸。","永动机控制","[七步成诗]","对敌方前排单体目标造成伤害。\n才华横溢。",116,"增加晕眩目标的概率。\n飘若浮云，矫若惊龙。",4001,1,4,0,8,3,0,80,1,0,400,0,1116,116,11601,11602,11603,11604,11605,0,0,0,11651,11652,11653,11654,5201,5213,11661,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|7",0,0,0,},
        [29] = {117,"夏侯渊",2,4,0,80,1,1,2,117,0,75,41,34,563,5,3,2,38,1000,0,0,0,1,1,113,"夏侯渊，字妙才，曹魏八虎骑之一。擅长率骑兵千里奔袭作战，来去如风，令敌人防不胜防！讨董卓时随曹操一同起兵，征战四方，屡立功勋，在平定马超叛乱后负责西北防线的镇守。镇守汉中时，与刘备相拒，被黄忠所袭，战死定军。","典军校尉夏侯渊。","三日五百，六日一千。","永动机辅助","[风驰电掣]","对敌方纵排目标造成伤害。\n绝不动摇。",117,"技能伤害转化为治疗。\n弩发吞日，矢飞风驰。",4001,1,4,0,8,3,0,80,1,0,400,0,1117,117,11701,11702,11703,11704,11705,0,0,0,11751,11752,11753,11754,5202,5212,11761,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,0,},
        [30] = {118,"张春华",2,4,0,80,2,1,1,118,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"张春华，司马懿之妻，司马昭之母，后被追为宣穆皇后。少年时就聪慧过人，足智多谋，曾经为了保护司马懿免招曹操怀疑，亲手杀了司马懿的婢女灭口，由此得到司马懿的看重。后司马懿宠爱柏夫人，张春华愤郁而逝，这便是三国杀中绝情、伤逝的来历。","少有德行，智识过人。","宝运归其后胤，盖有母仪之助焉。","永动机辅助","[绝情剑法]","对敌方前排单体目标造成伤害。\n无来无去，不悔不怨。",118,"护盾保护队友。\n弩发吞日，矢飞风驰。",4001,1,4,0,8,3,0,80,1,0,400,0,1118,118,11801,11802,11803,11804,11805,0,0,0,11851,11852,11853,11854,5203,5211,11861,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|10",0,0,0,},
        [31] = {119,"于禁",2,4,0,80,1,1,5,119,0,68,41,34,675,5,3,2,45,1000,0,0,0,1,0,0,"于禁，字文则，曹魏五子良将之一。本为鲍信部将，后属曹操。在建安二十四年的襄樊之战中，于禁在败给关羽后投降，一代名将晚节不保。","于禁最识大体，真良将也。","只为国家争胜负，不为一身辨曲直。","永动机肉盾","[疾风烈斩]","对敌方前排单体目标造成伤害。\n稳重行军，百战不殆。",119,"受技能伤害回复自身血量。\n弩发吞日，矢飞风驰。",4001,1,4,0,8,3,0,80,1,0,400,0,1119,119,11901,11902,11903,11904,11905,0,0,0,11951,11952,11953,11954,5201,5211,11961,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,0,},
        [32] = {150,"子上",2,7,0,225,1,1,5,150,0,14400,332,272,81000,0,0,0,0,1000,0,0,0,1,0,0,"司马昭，字子上，三国时期魏国权臣，西晋王朝的奠基人之一。为司马懿与张春华次子，早年随父抗击蜀汉，多有军识，屡立战功。后手握兵权，专揽国政，自称晋公，后加晋王。其子司马炎后来代魏称帝，追封司马昭为晋文帝。","自称晋公，后加晋王","手握兵权，专揽国政。","永动机输出控制","[森罗鬼蜮]","对敌方全体女性武将造成伤害。\n子上之心，路人皆知。",150,"回复怒气，增加伤害。\n幽冥之下，森罗鬼蜮。",4001,1,7,0,5,3,0,80,0,0,400,0,1150,150,15001,15002,15003,15004,15005,15006,15007,15008,15051,15052,15053,15054,15055,5323,5333,15061,5423,5433,5523,5533,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,0,0,},
        [33] = {151,"王异",2,7,0,225,2,1,5,151,0,12000,332,272,90000,0,0,0,0,1000,0,0,0,1,0,0,"王异，东汉末年曹操所置羌道令、益州刺史赵昂之妻，赵英、赵月之母。协助丈夫抵御敌军，多有功勋，屡出奇策，忠贞礼节，大义不惜。 ","协助丈夫抵御敌军，多有功勋，屡出奇策","丧身犹不重，灭子复何愁？","永动机控制","[流霜羽刃]","对敌方怒气最多的2个目标造成伤害\n三分贤达妇，万载姓名留。",151,"回复怒气。\n流霜羽刃，例无虚发。",4001,1,7,0,5,3,0,80,0,0,400,0,1151,151,15101,15102,15103,15104,15105,15106,15107,15108,15151,15152,15153,15154,15155,5323,5334,15161,5423,5434,5523,5534,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,3,0,},
        [34] = {201,"赵云",2,6,0,150,1,2,1,201,0,7200,165,135,40500,24,11,9,135,1000,0,0,0,1,1,202,"赵云，字子龙，蜀汉五虎上将之一。身长八尺，姿颜雄伟，曾在长坂坡七进七出百万曹军，救出刘备的儿子阿斗，先主云：“子龙一身都是胆也。”","天性勇毅，身为大帅仍复亲冒矢石。","为士卒先，此赵顺平，常开平之遗风。","暴力队输出","[神威如龙]","对敌方纵排目标造成伤害。\n吾乃常山赵子龙也！",201,"击杀目标追加1次普通攻击。\n千里一怒，红莲灿世。",4001,1,6,0,12,5,0,80,3,0,4500,0,1201,201,20101,20102,20103,20104,20105,20106,20107,20108,20151,20152,20153,20154,20155,5304,5312,20161,5404,5412,5504,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [35] = {202,"刘备",2,5,1,100,1,2,3,202,91202,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,201,"刘备，字玄德，蜀汉开国皇帝，史家又称他为先主。为人谦和，弘毅宽厚，知人待士，百折不挠，终成帝业。","弘毅宽厚，知人待士。","天地英雄气，千秋尚凛然。","治疗","[恩泽天下]","为己方全体目标治疗。\n惟贤惟德，仁服于人。",202,"受到技能伤害转化为治疗。\n鸳鸯合体，利可断金。",4001,1,5,0,12,4,0,80,1,0,1600,0,1202,202,20201,20202,20203,20204,20205,20206,20207,20208,20251,20252,20253,20254,20255,5301,5313,20261,5401,5413,5501,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2|3",0,0,1,},
        [36] = {203,"诸葛亮",2,6,0,150,1,2,1,203,0,6000,135,165,45000,20,9,11,150,1000,0,0,0,2,1,204,"诸葛亮，字孔明，号卧龙，蜀汉丞相。早年在隆中耕种，后刘备三顾茅庐请出，辅佐刘备建立蜀汉。曾舌战群儒促成吴蜀联盟，空城计吓退司马懿，一生为蜀汉事业鞠躬尽瘁，死而后已，是忠臣与智者的代表人物。其代表作有《出师表》《诫子书》等，曾发明木牛流马、孔明灯、诸葛连弩等。","人也？神也？仙也？","吾不知之，真卧龙也！","暴力队控制","[卧龙观星]","对敌方后排目标造成伤害。\n观今夜之天象，知天下之大事。",203,"释放技能降低目标怒气。\n运筹帷幄，决胜千里。",4001,1,6,0,12,5,0,80,3,0,4500,0,1203,203,20301,20302,20303,20304,20305,20306,20307,20308,20351,20352,20353,20354,20355,5302,5314,20361,5402,5414,5502,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|7",0,0,1,},
        [37] = {204,"黄月英",2,5,1,100,2,2,1,204,91204,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,203,"黄月英，诸葛亮之妻，荆州名士黄承彦之女。相传其美丽无双，却腼腆害羞，因此用斗笠轻纱蒙面。她家学渊源，才智无双，与诸葛一起发明了木牛流马，为世人津津乐道。","深明大义，助夫辅刘。","学识丰富，才华出众。","暴力队辅助","[木牛流马]","对敌方后排单体目标造成伤害。\n哼哼~",204,"释放技能增加全体武将怒气。\n人不大劳，牛不饮食。",4001,1,5,0,12,4,0,80,1,0,1600,0,1204,204,20401,20402,20403,20404,20405,20406,20407,20408,20451,20452,20453,20454,20455,5303,5311,20461,5403,5411,5503,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [38] = {205,"关羽",2,5,1,100,1,2,2,205,91205,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,1,206,"关羽，字云长，蜀汉五虎上将之首。温酒斩华雄，过五关斩六将，水淹七军，战绩无数！关羽一生忠义仁勇，诚信名冠天下，被誉为[武圣]。","过五关，斩六将！","千里走单骑，万人之敌也！","暴力队输出","[青龙偃月]","对敌方前排单体目标造成伤害。\n一骑当千！",205,"击杀目标回复自身怒气。\n横刀立马，唯我独尊。",4001,1,5,0,12,4,0,80,1,0,1600,0,1205,205,20501,20502,20503,20504,20505,20506,20507,20508,20551,20552,20553,20554,20555,5304,5312,20561,5404,5412,5504,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [39] = {206,"张飞",2,5,1,100,1,2,1,206,91206,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,2,205,"张飞，字益德，蜀汉五虎上将之一，与刘备、关羽是桃园结义的兄弟，以勇猛非凡，性如烈火，嫉恶如仇而著称，曾在长坂坡当阳桥一声怒吼，吓退十万曹军。","蜀之诸将，惟飞最雄。","敌万人，兵行九地，睠是雄材，霸王之器。","暴力队输出","[燕云狮吼]","对敌方前排目标造成伤害。\n燕人张飞在此！！！ ",206,"自身血量越少，攻击越高。\n纵横沙场，挡无可挡！",4001,1,5,0,12,4,0,80,1,0,1600,0,1206,206,20601,20602,20603,20604,20605,20606,20607,20608,20651,20652,20653,20654,20655,5301,5313,20661,5401,5413,5501,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [40] = {207,"马超",2,5,1,100,1,2,3,207,91207,2700,83,68,27000,9,6,5,90,1000,0,0,0,1,1,208,"马超，字孟起，蜀汉五虎上将之一。面如冠玉，目如流星，虎体猿臂，衣着讲究，举止非凡，人称锦马超。马超作战十分勇猛，曾多次击溃曹军进攻，让曹操也为之头疼，哀叹“马儿不死，吾无葬地也！”","西川马孟起，名誉震关中。","渭桥施六战，安蜀奏全功。","暴力队肉盾","[一骑当先]","对敌方前排目标造成伤害。\n全军突击。",207,"受到的治疗量增加。\n威风凛凛，锋锐无比。",4001,1,5,0,12,4,0,80,1,0,1600,0,1207,207,20701,20702,20703,20704,20705,20706,20707,20708,20751,20752,20753,20754,20755,5302,5314,20761,5402,5414,5502,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|10",0,0,1,},
        [41] = {208,"黄忠",2,5,1,100,1,2,4,208,91208,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,2,207,"黄忠，字汉升，蜀汉五虎上将之一。有勇有谋，老当益壮，箭术百步穿杨，本为刘表部下，后归刘备。汉中之战时，黄忠在定军山一战中阵斩曹操部下名将夏侯渊，金鼓振天，欢声动谷，一战定胜负！","苍头临大敌，皓首逞神威。","献馘功勋重，开疆展帝畿。","暴力队输出","[百步穿杨]","对敌方前排目标造成伤害。\n百步穿杨。",208,"击杀目标追加1次普通攻击。\n秋月弓圆，箭发如飞。",4001,1,5,0,12,4,0,80,1,0,1600,0,1208,208,20801,20802,20803,20804,20805,20806,20807,20808,20851,20852,20853,20854,20855,5303,5311,20861,5403,5411,5503,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [42] = {209,"姜维",2,5,1,100,1,2,3,209,91209,3600,68,83,20250,12,5,6,68,1000,0,0,0,2,1,210,"姜维，字伯约，蜀汉后期著名将领、军事统帅。原为曹魏将领，后降蜀汉，诸葛亮去世后继承诸葛亮的遗志，继续率领蜀汉军队北伐曹魏，与曹魏名将陈泰、郭淮、邓艾等多次交手。","天水夸英俊，凉州产异才。","系从尚父出，术奉武侯来。","暴力队输出","[万箭穿心]","对敌方纵排目标造成伤害。\n丞相之托，不可忘也！",209,"战斗回合越长，攻击越高。\n强弩雷发，所中必倒。",4001,1,5,0,12,4,0,80,1,0,1600,0,1209,209,20901,20902,20903,20904,20905,20906,20907,20908,20951,20952,20953,20954,20955,5304,5312,20961,5404,5412,5504,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,1,},
        [43] = {210,"魏延",2,5,1,100,1,2,4,210,91210,3000,83,68,22500,10,6,5,75,1000,0,0,0,1,2,209,"魏延，字文长，蜀汉名将，刘备入川时魏延数有战功，后领汉中太守，镇守汉中，成为独当一方的大将。魏延镇守汉中近十年，之后又屡次随诸葛亮北伐，功绩显著，曾提出子午谷奇谋。诸葛亮死后，与长史杨仪相互争权，魏延败逃，为马岱追斩。","以勇略任，并咸贵重。","善养士卒，勇猛过人。","暴力队控制","[嗜血狂骨]","对敌方纵排目标造成伤害。\n准备好被收割了么。",210,"提升释放晕眩效果概率。\n血光乍现，收割灵魂。",4001,1,5,0,12,4,0,80,1,0,1600,0,1210,210,21001,21002,21003,21004,21005,21006,21007,21008,21051,21052,21053,21054,21055,5301,5313,21061,5401,5413,5501,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|7",0,0,1,},
        [44] = {211,"庞统",2,5,1,100,1,2,1,211,91211,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,1,212,"庞统，字士元，号凤雏，刘备重要谋士，才智与诸葛亮齐名，赤壁之战，他避乱江东，为鲁肃荐于周瑜，并入曹营献连环计，助瑜火攻大败曹操。可惜天妒英才，庞统在率众攻城时不幸被流矢击中去世，后葬于落凤坡。","庞统雅好人流，经学思谋。","识时务者在乎俊杰。","暴力队辅助","[凤凰涅槃]","对敌方纵排目标造成伤害。\n伤一敌可连其百！",211,"所有上阵武将暴击几率增加。\n百鸟朝凰，浴火重生。",4001,1,5,0,12,4,0,80,1,0,1600,0,1211,211,21101,21102,21103,21104,21105,21106,21107,21108,21151,21152,21153,21154,21155,5302,5314,21161,5402,5414,5502,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [45] = {212,"徐庶",2,5,1,100,1,2,4,212,91212,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,211,"徐庶，字元直，与司马徽、诸葛亮等人为友。先曾仕官于新野的刘备，后因曹操囚禁其母而不得不弃备投操，临行前向刘备推荐诸葛亮。入曹营后，一言不发，不曾为曹操进献过一计半策，后人形容徐庶[身在曹营心在汉]。","痛恨高贤不再逢，临歧泣别两情浓。","片言却似春雷震，能使南阳起卧龙。","暴力队控制","[无言诛害]","对敌方后排单体目标造成伤害。\n一闪！",212,"释放技能回复自身怒气。\n来去无踪，锋芒不露。",4001,1,5,0,12,4,0,80,1,0,1600,0,1212,212,21201,21202,21203,21204,21205,21206,21207,21208,21251,21252,21253,21254,21255,5303,5311,21261,5403,5411,5503,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|7",0,0,1,},
        [46] = {213,"孟获",2,4,0,80,1,2,2,213,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,2,214,"孟获，南蛮王，三国时期南中地区少数民族首领，被诸葛亮率领大军七擒七纵后降服，此后不再叛乱。他不但作战勇敢，意志坚强，而且待人忠厚，在当地极得人心。","刀枪不入，锐箭不侵。","更有惊人蛮力，作战横扫千军。","暴力队输出","[撼地猛攻]","对敌方前排单体目标造成伤害。\n背黑锅我来，送死，你去！",213,"击杀目标攻击增加。\n开天裂地，横扫千军。",4001,1,4,0,8,3,0,80,1,0,400,0,1213,213,21301,21302,21303,21304,21305,0,0,0,21351,21352,21353,21354,5201,5211,21361,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [47] = {214,"祝融",2,4,0,80,2,2,5,214,0,75,41,34,563,5,3,2,38,1000,0,0,0,1,1,213,"祝融，南蛮王孟获之妻，传说为火神祝融氏后裔。武艺超群，善使飞刀，曾与孟获一起抵抗蜀军，在诸葛亮七擒七纵孟获之后，随孟获投降蜀汉。","善使飞刀，百发百中。","为火神祝融氏之后裔。","暴力队控制","[披荆斩棘]","对敌方前排单体目标造成伤害。\n亮兵器吧。",214,"死亡时会再释放1次技能。\n开天裂地，横扫千军。",4001,1,4,0,8,3,0,80,1,0,400,0,1214,214,21401,21402,21403,21404,21405,0,0,0,21451,21452,21453,21454,5202,5212,21461,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|7",0,0,0,},
        [48] = {215,"阿斗",2,4,0,80,1,2,1,215,0,68,41,34,675,5,3,2,45,1000,0,0,0,1,0,0,"蜀汉后主刘禅[shàn]，字公嗣[sì]，小名阿斗，刘备、甘夫人之子，蜀汉第二位皇帝，263年，蜀汉被曹魏所灭，投降曹魏，被封安乐公，留有乐不思蜀的典故。","天资仁敏，爱德下士。","任贤相则为循理之君。","暴力队肉盾","[熊猫滚滚]","对敌方前排单体目标造成伤害。\n我的爸爸是刘备！",215,"为自身增加减伤护盾。\n开天裂地，横扫千军。",4001,1,4,0,8,3,0,80,1,0,400,0,1215,215,21501,21502,21503,21504,21505,0,0,0,21551,21552,21553,21554,5203,5213,21561,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|10",0,0,0,},
        [49] = {216,"张星彩",2,4,0,80,2,2,1,216,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,2,217,"张星彩，蜀汉大将张飞之女，一双乌溜溜的大眼晶莹灿烂，樱桃小嘴，笑靥如花，活泼可爱，相传曾拜师华佗学习医术，长大后嫁给蜀国后主刘禅，被封为皇后。","张飞长女，萝莉一枚。","后成为蜀汉后主刘禅的皇后。","治疗","[荷塘月色]","为己方血量最少的目标治疗。\n超级厉害~",216,"死亡时会再释放1次技能。\n炎炎夏日，清凉解火。",4001,1,4,0,8,3,0,80,1,0,400,0,1216,216,21601,21602,21603,21604,21605,0,0,0,21651,21652,21653,21654,5201,5213,21661,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2",0,0,0,},
        [50] = {217,"关银屏",2,4,0,80,2,2,4,217,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,1,216,"关银屏，美髯[rán]公关羽之女，明艳动人，神采奕奕，清丽之中更带着三分英气，传说关银屏后拜赵云为师，并随同诸葛亮平定南蛮。","生得美丽聪慧。","十八岁就学得一身武艺。","暴力队输出","[流光偃月]","对敌方前排目标造成伤害。\n萝莉有杀气！",217,"击杀目标回复生命。\n无所畏惧，单刀直入。",4001,1,4,0,8,3,0,80,1,0,400,0,1217,217,21701,21702,21703,21704,21705,0,0,0,21751,21752,21753,21754,5202,5212,21761,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,0,},
        [51] = {218,"关平",2,4,0,80,1,2,1,218,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,0,0,"关平，蜀汉将领，关羽之子，随关羽东征西讨，武勇过人，不逊乃父，曾跟随刘备出征西川，立下战功，后来又与曹魏猛将庞德大战三十回合，彼此不分胜负。","金戈冲杀气，铁马截征尘。","报国忠心壮，随亲孝义淳。","暴力队输出","[龙鹰九霄]","对敌方纵排目标造成伤害。\n谁说我相貌平平？",218,"技能伤害增加。\n兵仗遇之，无不屈者。",4001,1,4,0,8,3,0,80,1,0,400,0,1218,218,21801,21802,21803,21804,21805,0,0,0,21851,21852,21853,21854,5203,5211,21861,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [52] = {219,"法正",2,4,0,80,1,2,5,219,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"法正，字孝直，刘备帐下谋士。原为刘璋部下，劝说刘璋投降，后与刘备进取汉中，献计将曹操大将夏侯渊斩首。法正善奇谋，深受刘备信任和敬重，被陈寿称赞为可比曹操帐下的程昱和郭嘉。","正务眩惑之术，违贵尚之风。","譬之郭隗，非其伦矣。","暴力队控制","[恩怨分明]","对敌方前排单体目标造成伤害。\n滴水之恩，涌泉以报。",219,"提升释放麻痹效果概率。\n炎炎夏日，清凉解火。",4001,1,4,0,8,3,0,80,1,0,400,0,1219,219,21901,21902,21903,21904,21905,0,0,0,21951,21952,21953,21954,5202,5212,21961,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|9",0,0,0,},
        [53] = {250,"水镜",2,7,0,225,1,2,5,250,0,14400,272,332,81000,0,0,0,0,1000,0,0,0,2,0,0,"水镜，本名司马徽，字德操，东汉末年名士，精通道学、奇门、兵法、经学。为人清雅，学识广博，有知人论世、鉴别人才的能力，受到世人的敬重。","精通道学、奇门、兵法、经学。","学识广博，有知人论世、鉴别人才的能力","暴力队输出","[惊涛骇浪]","对敌方双纵排目标造成伤害。\n王佐之才，择人而仕。",250,"武将死亡时提升伤害。\n称好道优，无过宽心。",4001,1,7,0,5,3,0,80,0,0,400,0,1250,250,25001,25002,25003,25004,25005,25006,25007,25008,25051,25052,25053,25054,25055,5322,5332,25061,5422,5432,5522,5532,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,0,0,},
        [54] = {251,"诸葛果",2,7,0,225,2,2,5,251,0,12000,272,332,90000,0,0,0,0,1000,0,0,0,2,0,0,"诸葛果，为诸葛亮之女，生来天资聪慧，热爱道学。修炼于乘烟观，后羽化成仙，被记载于《历代神仙通鉴》。","集母亲之智，效父亲之法","禳除煞星，祈愿交运","暴力队辅助","[幻妙仙莲]","为己方全体增加伤害和免伤。\n飘然若仙，翠羽明珠",251,"消耗怒气抵消异常状态。\n恍然入梦，大巧若拙",4001,1,7,0,5,3,0,80,0,0,400,0,1251,251,25101,25102,25103,25104,25105,25106,25107,25108,25151,25152,25153,25154,25155,5322,5331,25161,5422,5431,5522,5531,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,3,0,},
        [55] = {301,"孙策",2,6,0,150,1,3,6,301,0,7200,165,135,40500,24,11,9,135,1000,0,0,0,1,1,302,"孙策，字伯符，人称江东小霸王，东吴的奠基者之一。年少时容貌俊美，性格阔达，声名远播，后与周瑜结拜。为继承孙坚遗业而屈事袁术，袁术僭越称帝后，孙策与袁术决裂，统一江东。","为人美姿颜，好笑语。","性阔达听受，善于用人。","灼烧队输出","[霸王盖世]","对敌方后排目标造成伤害。\n吾乃江东小霸王！",301,"攻击灼烧目标暴击几率增加。\n以力制敌，刚猛强横。",4001,1,6,0,12,5,0,80,3,0,4500,0,1301,301,30101,30102,30103,30104,30105,30106,30107,30108,30151,30152,30153,30154,30155,5301,5311,30161,5401,5411,5501,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,1,},
        [56] = {302,"大乔",2,5,1,100,2,3,4,302,91302,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,301,"大乔，孙策之妻，三国知名美人，与其妹小乔并称江东二乔。通音律，晓诗文，肌肤胜雪，眉目如画，浅笑盈盈，十分动人。","孙策之妻，小乔之姊。","为绝世美女。","治疗","[翩若惊鸿]","为己方全体目标治疗。\n你来嘛~",302,"技能附加的持续治疗效果增加。\n落花人独立，微雨燕双飞。",4001,1,5,0,12,4,0,80,1,0,1600,0,1302,302,30201,30202,30203,30204,30205,30206,30207,30208,30251,30252,30253,30254,30255,5303,5313,30261,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2",0,0,1,},
        [57] = {303,"周瑜",2,6,0,150,1,3,7,303,0,7200,135,165,40500,24,9,11,135,1000,0,0,0,2,1,304,"周瑜，字公瑾，东吴名将，大都督。因其容貌英俊而有周郎之称，精通音律，故有[曲有误，周郎顾]之语。与孙策交好，助孙策平定江东，后孙策遇刺身亡，又助孙权统领江东。208年，周瑜率军与刘备联合，于赤壁之战中大败曹军，由此奠定了三分天下的基础。被后世誉为[世间豪杰英雄士，江左风流美丈夫]。","瑜少精意於音乐，年少有美才。","善谈论，能属文辞，思度弘远，有过人之明。","灼烧队纵火","[烈火燎原]","对敌方全体目标造成伤害。\n汝等看好了。",303,"受到普通攻击有概率灼烧攻击者。\n砺乃锋刃，烽火连月。",4001,1,6,0,12,5,0,80,3,0,4500,0,1303,303,30301,30302,30303,30304,30305,30306,30307,30308,30351,30352,30353,30354,30355,5302,5312,30361,5402,5412,5502,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|5",0,0,1,},
        [58] = {304,"小乔",2,5,1,100,2,3,1,304,91304,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,303,"小乔，周瑜之妻，三国知名美人，与其姐大乔并称江东二乔。神采飞扬，灵气逼人，天真烂漫，银铃般的声音，娇俏活泼，听着不自禁的让人喜欢。","秋娘萤火晚晴天，巧笑明眸顾月颜。","情非得已情不已，爱自怜时人亦怜。","灼烧队辅助","[天香红颜]","对敌方前排目标造成伤害。\n弦音渺渺，花香阵阵。",304,"释放技能为多名队友附加吸血盾。\n若有若无，美人香气。",4001,1,5,0,12,4,0,80,1,0,1600,0,1304,304,30401,30402,30403,30404,30405,30406,30407,30408,30451,30452,30453,30454,30455,5304,5314,30461,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|9",0,0,1,},
        [59] = {305,"太史慈",2,5,1,100,1,3,7,305,91305,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,1,306,"太史慈，字子义，东吴名将。弓马熟练，箭法精良，为人磊落坦荡，尽义守信，智勇双全，原为刘繇[yáo]部下，后被孙策收降，死前曾道：“大丈夫生于乱世，当带三尺剑立不世之功；今所志未遂，奈何死乎！”年四十一岁。","大丈夫生于乱世。","当带三尺剑立不世之功。","灼烧队纵火","[烈焰焚天]","对敌方前排目标造成伤害。\n天行有常，天义昭昭。",305,"受普通攻击时有概率给攻击者附加灼烧。\n挽弓如月，矢飞如电。",4001,1,5,0,12,4,0,80,1,0,1600,0,1305,305,30501,30502,30503,30504,30505,30506,30507,30508,30551,30552,30553,30554,30555,5301,5311,30561,5401,5411,5501,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|5",0,0,1,},
        [60] = {306,"孙权",2,5,1,100,1,3,1,306,91306,3600,68,83,20250,12,5,6,68,1000,0,0,0,2,2,305,"孙权，字仲谋，东吴开国皇帝。幼年随兄长孙策平定江东，后孙策遇刺身亡，孙权继位成江东之主。后与刘备建立孙刘联盟，在赤壁之战中击败曹操，促使三国鼎立 。","割据江东，地方数千里。","兵精足用，英雄乐业。","灼烧队输出","[仲谋之剑]","对敌方前排目标造成伤害。\n容我三思。",306,"击杀灼烧目标，回复自身血量。\n青冥浩荡，日月照耀。",4001,1,5,0,12,4,0,80,1,0,1600,0,1306,306,30601,30602,30603,30604,30605,30606,30607,30608,30651,30652,30653,30654,30655,5303,5313,30661,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [61] = {307,"吕蒙",2,5,1,100,1,3,2,307,91307,3000,83,68,22500,10,6,5,75,1000,0,0,0,1,1,308,"吕蒙，字子明，东吴名将，曾任大都督。十五岁时就从军打仗，能征惯战，但读书甚少，后来孙权劝他学习，才开始发愤勤学，鲁肃来到寻阳与吕蒙研讨议事，十分惊奇他的进步。后以士别三日刮目相看、吴下阿蒙等称誉别人进步很大。吕蒙最出名的功绩是袭取荆州，击败蜀汉名将关羽，留下白衣渡江典故。","勤能补拙，笃志力学。","士别三日，刮目相看。","灼烧队控制","[兵不血刃]","对敌方全体目标造成伤害。\n不是不报，时候未到。",307,"提升晕眩效果概率。\n纵横江湖，大巧不工。",4001,1,5,0,12,4,0,80,1,0,1600,0,1307,307,30701,30702,30703,30704,30705,30706,30707,30708,30751,30752,30753,30754,30755,5302,5312,30761,5402,5412,5502,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|7",0,0,1,},
        [62] = {308,"甘宁",2,5,1,100,1,3,4,308,91308,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,2,307,"甘宁，字兴霸，东吴猛将。少年时好游侠，头插鸟羽，身佩铃铛，披服锦绣，四处游荡抢夺船只财物，人称锦帆贼。青年时停止抢劫，熟读诸子，历仕于刘表和黄祖，后率部投奔孙权，开始建功立业。曾率百余人夜袭曹营，战功赫赫。孙权曾说：“孟德有张辽，孤有甘兴霸，足相敌也。”","翻然脱羁衔，渡江得英主。","垂手立功勋，雄名诧千古。","灼烧队输出","[锦帆夜袭]","对敌方后排单体目标造成伤害。\n接招吧！",308,"普通攻击对灼烧目标伤害增加。\n龙吟虎啸，大开大合。",4001,1,5,0,12,4,0,80,1,0,1600,0,1308,308,30801,30802,30803,30804,30805,30806,30807,30808,30851,30852,30853,30854,30855,5304,5314,30861,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [63] = {309,"孙坚",2,5,1,100,1,3,6,309,91309,2700,83,68,27000,9,6,5,90,1000,0,0,0,1,1,310,"孙坚，字文台，东吴霸业的奠基人，被誉为江东烈虎。其人容貌不凡，豪爽阔达，擅使大刀，喜戴红头巾，曾参与讨伐黄巾军的战役以及讨伐董卓的战役。","谁道江南少将才？明星夜夜照文台。","欲诛董卓安天下，为首长沙太守来。","灼烧队肉盾","[江东烈虎]","对敌方前排单体目标造成伤害。\n英魂不灭，誓为江东。",309,"受到灼烧状态敌人攻击时伤害减少。\n燎原烈火，无懈可击。",4001,1,5,0,12,4,0,80,1,0,1600,0,1309,309,30901,30902,30903,30904,30905,30906,30907,30908,30951,30952,30953,30954,30955,5301,5311,30961,5401,5411,5501,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,1,},
        [64] = {310,"孙尚香",2,5,1,100,2,3,1,310,91310,3600,68,83,20250,12,5,6,68,1000,0,0,0,2,2,309,"孙尚香，孙权之妹，赤壁之战嫁给刘备为妻。她容貌秀丽，才智敏捷，桀骜不驯，巾帼不让须眉。","步障明珠事渺茫，夫人归国翠帏凉。","江东侍婢迎郎日，犹记刀光满洞房。","灼烧队输出","[枭姬断肠]","对敌方前排单体目标造成伤害。\n他好我也好~",310,"释放技能追加1次普通攻击。\n捷疾可畏，以牙还牙。",4001,1,5,0,12,4,0,80,1,0,1600,0,1310,310,31001,31002,31003,31004,31005,31006,31007,31008,31051,31052,31053,31054,31055,5303,5313,31061,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,1,},
        [65] = {311,"陆逊",2,5,1,100,1,3,7,311,91311,3600,68,83,20250,12,5,6,68,1000,0,0,0,2,1,312,"陆逊，字伯言，东吴大将，历任吴国大都督、上大将军、丞相，在夷陵击败刘备所率蜀汉军，一战成名。陆逊深得孙权器重，深谋远虑，忠诚耿直，一生出将入相，被赞为社稷之臣。玩家喜称周瑜为大都督，陆逊为小都督。","智勇兼备，品质高尚。","武能安邦，文能治国。","灼烧队纵火","[烈火七杀]","对敌方后排目标造成伤害。\n旧的不去新的不来。",311,"释放技能附加灼烧概率增加。\n日色含烟，月明不眠。",4001,1,5,0,12,4,0,80,1,0,1600,0,1311,311,31101,31102,31103,31104,31105,31106,31107,31108,31151,31152,31153,31154,31155,5302,5312,31161,5402,5412,5502,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|5",0,0,1,},
        [66] = {312,"鲁肃",2,5,1,100,1,3,2,312,91312,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,311,"鲁肃，字子敬，东吴大将，曾任大都督。体貌魁伟，性格豪爽，喜读书、好骑射，家财万贯，仗义疏财，初见周瑜就将三千斛粮食慷慨相赠。曾为孙权提出鼎足江东的战略规划，并与周瑜一起联刘抗曹，奠定三国鼎立格局。","少有壮节，好为奇计。","家富于财，性好施与。","灼烧队控制","[招财进宝]","对敌方纵排目标造成伤害。\n拿去拿去，莫跟哥哥客气。",312,"释放技能回复自身怒气。\n腰缠万贯，功成名就。",4001,1,5,0,12,4,0,80,1,0,1600,0,1312,312,31201,31202,31203,31204,31205,31206,31207,31208,31251,31252,31253,31254,31255,5304,5314,31261,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|7",0,0,1,},
        [67] = {313,"凌统",2,4,0,80,1,3,7,313,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,1,316,"凌统，字公绩，东吴名将，凌操之子。少有名盛，为人有国士之风，曾随孙权征讨江夏，率先登入夏口，斩杀黄祖先锋，为剿灭黄祖立下大功。与甘宁有杀父之仇，后与甘宁握手言和。","江表之虎臣。","少有名盛，为人有国士之风。","灼烧队纵火","[旋风烈胆]","对敌方前排单体目标造成伤害。\n索命于须臾之间。",313,"被普通攻击时有概率给攻击者附加灼烧。\n无边无际，无限无终。",4001,1,4,0,8,3,0,80,1,0,400,0,1313,313,31301,31302,31303,31304,31305,0,0,0,31351,31352,31353,31354,5201,5211,31361,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|5",0,0,0,},
        [68] = {314,"黄盖",2,4,0,80,1,3,1,314,0,68,41,34,675,5,3,2,45,1000,0,0,0,1,0,0,"黄盖，字公覆，历仕孙坚、孙策、孙权三任。为人严肃，勇猛善战，赤壁之战时，黄盖施展苦肉计前往曹营诈降，并趁机以火攻大破曹操军队，是赤壁之战主要功臣之一。","猛气纷纭，雄心四据。","百战百胜，貔貅为群。","灼烧队肉盾","[老当益壮]","对敌方前排单体目标造成伤害。\n请鞭挞我吧！",314,"受到的治疗效果增加。\n上下摇曳，银蛇飞舞。",4001,1,4,0,8,3,0,80,1,0,400,0,1314,314,31401,31402,31403,31404,31405,0,0,0,31451,31452,31453,31454,5202,5212,31461,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [69] = {315,"张昭",2,4,0,80,1,3,4,315,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"张昭，字子布，东吴重臣。孙策临死前，将孙权托付给张昭和周瑜，遗言“外事问周瑜，内事问张昭”。他敢于直谏、性格刚直，曾因直言逆旨退居不朝，孙权盛怒之下，命令用土封住张昭的家门，张昭也不甘示弱，用土从门内将门堵住，这便是张昭塞门的典故。张昭善隶书，唐张怀瓘在《书估》中对其书法评价极高。","受遗辅佐，功勋克举。","忠謇方直，动不为己。","灼烧队辅助","[经天纬地]","对敌方前排单体目标造成伤害。\n机智如我。",315,"给队友附加护盾。\n史进象笏，书思对命。",4001,1,4,0,8,3,0,80,1,0,400,0,1315,315,31501,31502,31503,31504,31505,0,0,0,31551,31552,31553,31554,5203,5213,31561,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|10",0,0,0,},
        [70] = {316,"周泰",2,4,0,80,1,3,1,316,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,2,313,"周泰，字幼平，东吴重要武将。多次于战乱当中保护孙权的安危，身上受的伤多达几十处，就像在皮肤上雕画一样。孙权为了表彰周泰出生入死的功绩，赐给他青罗伞盖。","三番救主出重围，忠勇如公世所稀。","遍体疮痍犹痛饮，血痕残酒满征衣。","灼烧队输出","[勇冠三军]","对敌方前排单体目标造成伤害。\n哼，这点小伤算什么。",316,"击杀目标增加自身怒气。\n直而不倨，曲而不屈。",4001,1,4,0,8,3,0,80,1,0,400,0,1316,316,31601,31602,31603,31604,31605,0,0,0,31651,31652,31653,31654,5201,5213,31661,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",0,0,0,},
        [71] = {317,"步练师",2,4,0,80,2,3,6,317,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"步练师，孙权的宠妃，美丽温柔，性格和善，品行端庄，待人宽容，去世后，被追封皇后，这是皇帝追封妃为皇后的最初案例。","性不妒忌，多所推进，故久见爱待簪。","以美丽得幸于权，宠冠后庭。","灼烧队控制","[高山流水]","对敌方前排单体目标造成伤害。\n莫慌莫慌，且听臣妾一曲。",317,"提升释放晕眩效果概率。\n纵横江湖，大巧不工。",4001,1,4,0,8,3,0,80,1,0,400,0,1317,317,31701,31702,31703,31704,31705,0,0,0,31751,31752,31753,31754,5202,5212,31761,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|7",0,0,0,},
        [72] = {318,"韩当",2,4,0,80,1,3,4,318,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,0,0,"韩当，字义公，东吴将领。长于弓箭、骑术并且膂力过人，历仕孙坚、孙策、孙权三代，功勋卓著，对江东基业的逐渐稳固和吴国的建立有着重要影响。","四处征伐周旋，数次冒险犯难。","陷阵擒敌，屡立战功。","灼烧队输出","[听风射影]","对敌方纵排目标造成伤害。\n吃我一箭。",318,"对灼烧目标的伤害增加。\n通晓天地，融汇古今。",4001,1,4,0,8,3,0,80,1,0,400,0,1318,318,31801,31802,31803,31804,31805,0,0,0,31851,31852,31853,31854,5203,5211,31861,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [73] = {319,"诸葛瑾",2,4,0,80,1,3,7,319,0,90,34,41,506,6,2,3,34,1000,0,0,0,2,0,0,"诸葛瑾，字子瑜，吴国重臣，诸葛亮之兄，诸葛恪之父。胸怀宽广，温厚诚信，得到孙权的深深信赖，称为[神交]，并努力缓和蜀汉与东吴的关系。诸葛瑾面孔狭长像驴的面孔，一天，孙权召集大臣们，差人牵一头驴来，在驴脸上写上“诸葛子瑜”，后被诸葛恪写上“之驴”巧妙化解，众人大笑，孙权便将此驴赐给了诸葛恪。 ","瑾为人有容貌思度。","于时服其弘雅。","灼烧队纵火","[如火如荼]","对敌方纵排目标造成伤害。\n自舍其身，施于天下。",319,"被技能攻击时有概率给攻击者附加灼烧。\n繁光缀天，火树烛龙。",4001,1,4,0,8,3,0,80,1,0,400,0,1319,319,31901,31902,31903,31904,31905,0,0,0,31951,31952,31953,31954,5203,5213,31961,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|5",0,0,0,},
        [74] = {350,"周姬",2,7,0,225,2,3,6,350,0,14400,332,272,81000,0,0,0,0,1000,0,0,0,1,0,0,"周姬，本名周彻，周瑜与小乔的爱女。后嫁与孙权之子孙登为太子妃，又称周妃。周姬承有母亲之貌，更具父亲之才，文武双全，善良爱民。","周姬承有母亲之貌，更具父亲之才","文武双全，善良爱民。","灼烧队输出辅助","[霓凰业火]","对敌方男性目标造成伤害。\n横连亲族，以匡东吴。",350,"造成额外伤害，清除控制效果。\n伊人箜声，在水一方。",4001,1,7,0,5,3,0,80,0,0,400,0,1350,350,35001,35002,35003,35004,35005,35006,35007,35008,35051,35052,35053,35054,35055,5321,5331,35061,5421,5431,5521,5531,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,0,0,},
        [75] = {351,"陆抗",2,7,0,225,1,3,6,351,0,12000,272,332,90000,0,0,0,0,1000,0,0,0,2,0,0,"陆抗，字幼节，吴国丞相陆逊次子。袭父爵为江陵侯，与陆逊皆是吴国的中流砥柱，被誉为吴国最后的名将。","长子抗才亦宰辅，都督荆襄镇羊佑","兴吴事业父子谋，赫赫威名震千古","灼烧队辅助","[金阳无极]","为我方吴国武将增加御甲。\n各保分界，无求细利。",351,"增强御甲特性，回复自身怒气。\n良谋益策，破敌腹背。",4001,1,7,0,5,3,0,80,0,0,400,0,1351,351,35101,35102,35103,35104,35105,35106,35107,35108,35151,35152,35153,35154,35155,5321,5332,35161,5421,5432,5521,5532,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,3,0,},
        [76] = {401,"左慈",2,6,0,150,1,4,1,401,0,6000,135,165,45000,20,9,11,150,1000,0,0,0,2,1,402,"左慈，字元放，东汉末年知名道士，精通五经、占星、奇门遁甲，传说能役使鬼神，以方术名闻当世，一手建立丹鼎派。左慈曾戏耍曹操与孙策，后进山炼丹，得道乘鹤而去。","少有神道，能役使鬼神，坐致行厨。","明五经，兼通星纬，学道术，明六甲。","减怒队控制","[万剑藏锋]","对敌方前排目标造成伤害。\n幻幻无穷，生生不息。",401,"提升释放晕眩效果的概率。\n拂去尘缘，超凡脱俗。",4001,1,6,0,12,5,0,80,3,0,4500,0,1401,401,40101,40102,40103,40104,40105,40106,40107,40108,40151,40152,40153,40154,40155,5303,5313,40161,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|7",0,0,1,},
        [77] = {402,"华佗",2,5,1,100,1,4,3,402,91402,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,401,"华佗，字元化，中国古代著名神医，与董奉、张仲景并称为[建安三神医]。医术高超，擅长外科，精于手术，被誉为外科鼻祖。传说华佗鹤发童颜，英俊潇洒，曾替关羽刮骨疗伤，并赠司马懿五禽戏助他活到七十三岁，可惜晚年遭曹操迫害而死。","东汉末年著名的医学家。","华佗之医诊，非常之绝技矣。","治疗","[妙手回春]","为己方全体目标治疗。\n别紧张，有老夫呢～",402,"目标血量越少对其治疗越高。\n仁心仁术，杏林春暖。",4001,1,5,0,12,4,0,80,1,0,1600,0,1402,402,40201,40202,40203,40204,40205,40206,40207,40208,40251,40252,40253,40254,40255,5302,5311,40261,5402,5411,5502,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2",0,0,1,},
        [78] = {403,"吕布",2,6,0,150,1,4,2,403,0,7200,165,135,40500,24,11,9,135,1000,0,0,0,1,1,404,"吕布，字奉先，三国第一猛将。手持方天画戟，骑赤兔马，头戴金冠，器宇轩昂，威风凛凛。关羽、张飞、刘备三人围攻他，也未能将其战倒，战神之名当之无愧！","吕布善戟法，骁勇绝技。","有虓虎之勇，善战无前。","减怒队输出","[鬼神破灭]","对敌方全体目标造成伤害。\n谁敢挡我！",403,"击杀目标回复自身怒气。\n威力无穷，天下无双。",4001,1,6,0,12,5,0,80,3,0,4500,0,1403,403,40301,40302,40303,40304,40305,40306,40307,40308,40351,40352,40353,40354,40355,5304,5314,40361,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4",0,0,1,},
        [79] = {404,"貂蝉",2,5,1,100,2,4,1,404,91404,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,2,403,"貂蝉，中国古代四大美女之一，王允义女，吕布之妻。有绝世之颜，闭月之貌，倾国倾城。为了报答义父王允的养育之恩，而甘愿献身完成刺杀董卓的连环计。","惊鸿宛转掌中身，只疑飞过洞庭春。","好花风袅一枝新，画堂香暖不胜春。","减怒队辅助","[一见倾城]","对敌方前排单体目标造成伤害。\n夫君，你要替妾身做主啊！",404,"技能伤害转化为治疗。\n千姿百态，皎洁无瑕。",4001,1,5,0,12,4,0,80,1,0,1600,0,1404,404,40401,40402,40403,40404,40405,40406,40407,40408,40451,40452,40453,40454,40455,5301,5312,40461,5401,5412,5501,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4",0,0,1,},
        [80] = {405,"董卓",2,5,1,100,1,4,6,405,91405,2700,83,68,27000,9,6,5,90,1000,0,0,0,1,1,406,"董卓，字仲颖，东汉末年凉州军阀，后入洛阳成为权臣，官至太师，权倾朝野。其人体魄健壮，臂力过人，善骑射，爱喝酒，爱吃肉，更爱美人儿，后因残暴不仁滥杀无辜，死于貂蝉的美人计之下，被吕布斩杀。","身高体胖，力大无双。","一生残暴，满怀私欲和野心。","减怒队肉盾","[千刀万剐]","对敌方前排单体目标造成伤害。\n美人儿~来香一个！",405,"减伤盾效果提升。\n肆意妄为，无法无天。",4001,1,5,0,12,4,0,80,1,0,1600,0,1405,405,40501,40502,40503,40504,40505,40506,40507,40508,40551,40552,40553,40554,40555,5303,5313,40561,5403,5413,5503,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|10",0,0,1,},
        [81] = {406,"华雄",2,5,1,100,1,4,1,406,91406,3600,83,68,20250,12,6,5,68,1000,0,0,0,1,2,405,"华[huà]雄，董卓帐下一员虎将。十八路诸侯讨伐董卓时，被孙坚所杀，《三国演义》改为被关羽所杀，成就温酒斩华雄的一段佳话。","嗜血好战。","自恃天下无敌。","减怒队输出","[耀武一劈]","对敌方纵排目标造成伤害。\n谁来和我打一架？",406,"击杀目标回复自身怒气。\n靡曼皓齿，伐性之斧。",4001,1,5,0,12,4,0,80,1,0,1600,0,1406,406,40601,40602,40603,40604,40605,40606,40607,40608,40651,40652,40653,40654,40655,5302,5311,40661,5402,5411,5502,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4",0,0,1,},
        [82] = {407,"贾诩",2,5,1,100,1,4,4,407,91407,3600,68,83,20250,12,5,6,68,1000,0,0,0,2,1,408,"贾诩[xǔ]，字文和，凉州人，三国著名谋士。原为董卓部将，董卓死后，因献计导致李傕郭汜反攻长安，被称为毒士。之后，贾诩辗转成为张绣的谋士，后降曹操，成为曹魏重要谋臣。虽多易其主，但贾诩算无遗策，得以善终，七十七岁逝世。","孝通神明，忠定社稷。","神人无功，达人无迹。","减怒队输出","[暗鸦影毒]","对敌方前排单体目标造成伤害。\n你奈我何？",407,"释放技能附加的中毒概率提升。\n阴阳游走，六道轮回。",4001,1,5,0,12,4,0,80,1,0,1600,0,1407,407,40701,40702,40703,40704,40705,40706,40707,40708,40751,40752,40753,40754,40755,5303,5314,40761,5403,5414,5503,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|4|6",0,0,1,},
        [83] = {408,"公孙瓒",2,5,1,100,1,4,6,408,91408,3000,83,68,22500,10,6,5,75,1000,0,0,0,1,2,407,"公孙瓒，字伯圭，汉末幽州军阀。相貌俊美，声音洪亮，机智善辩，得到涿郡太守赏识，将女儿许配给他。后以强硬的态度对抗北方游牧民族，勇猛好战，威震边疆。","超然自逸。","文武才力足恃。","减怒队控制","[石破天惊]","对敌方后排单体目标造成伤害。\n众将听令，御敌！",408,"释放技能回复自身怒气。\n千形万象，映水藏山。",4001,1,5,0,12,4,0,80,1,0,1600,0,1408,408,40801,40802,40803,40804,40805,40806,40807,40808,40851,40852,40853,40854,40855,5301,5312,40861,5401,5412,5501,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|7",0,0,1,},
        [84] = {409,"张角",2,5,1,100,1,4,4,409,91409,3000,68,83,22500,10,5,6,75,1000,0,0,0,2,1,410,"张角，东汉末年黄巾军的领袖，太平道的创始人，教徒多达几十万。184年，张角以“苍天已死，黄天当立，岁在甲子，天下大吉”为口号，自称天公将军，率领群众发动起义，史称黄巾起义。","震撼了东汉王朝的根基。","直接导致了东汉末年军阀割据。","减怒队控制","[黄天当道]","对敌方前排目标造成伤害。\n雷公助我。",409,"释放技能降低目标怒气。\n飙举电至，雷霆之怒。",4001,1,5,0,12,4,0,80,1,0,1600,0,1409,409,40901,40902,40903,40904,40905,40906,40907,40908,40951,40952,40953,40954,40955,5304,5313,40961,5404,5413,5504,5513,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|8",0,0,1,},
        [85] = {410,"于吉",2,5,1,100,1,4,4,410,91410,3600,68,83,20250,12,5,6,68,1000,0,0,0,2,2,409,"于吉，东汉末年知名道士。曾在吴郡、会稽一带为百姓治病，甚得人心，孙策怒之，以惑人心为由斩之。后策常受吉咒，死。","先寓居东方，往来吴会，立精舍。","烧香读道书，制作符水以治病。","减怒队输出","[傀儡蛊毒]","对敌方纵排目标造成伤害。\n你听说过《太平经》吗？",410,"释放技能降低目标怒气。\n沐猴而冠，毒入骨髓。",4001,1,5,0,12,4,0,80,1,0,1600,0,1410,410,41001,41002,41003,41004,41005,41006,41007,41008,41051,41052,41053,41054,41055,5302,5311,41061,5402,5411,5502,5511,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|6",0,0,1,},
        [86] = {411,"袁绍",2,5,1,100,1,4,1,411,91411,3000,83,68,22500,10,6,5,75,1000,0,0,0,1,1,412,"袁绍，字本初，汉末河北最强诸侯。出身名门，袁氏有四世三公之称。十八路诸侯讨董卓时，被推举盟主，群雄割据时，袁绍先占冀州，再夺青、并二州，并击败了幽州的公孙瓒，统一河北，势力达到顶点，却在官渡之战败于曹操，之后病逝。","汉末大乱，雄桀并起，绍鹰扬河朔。","为人政宽，百姓德之。","减怒队控制","[万箭齐发]","对敌方全体目标造成伤害。\n准备放箭！",411,"释放技能麻痹敌人概率增加。\n五色合之，斩玉如泥。",4001,1,5,0,12,4,0,80,1,0,1600,0,1411,411,41101,41102,41103,41104,41105,41106,41107,41108,41151,41152,41153,41154,41155,5304,5314,41161,5404,5414,5504,5514,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4|9",0,0,1,},
        [87] = {412,"袁术",2,5,1,100,1,4,1,412,91412,3000,83,68,22500,10,6,5,75,1000,0,0,0,1,2,411,"袁术，字公路，袁绍之弟，汉末淮南最强诸侯。后因偶得玉玺，妄自称帝，称帝后袁术奢侈荒淫，横征暴敛，众叛亲离，遭到孙策吕布曹操三方打击，后呕血而死，玉玺也不知所踪。","袁术奢淫放肆。","荣不终己，自取之也。","减怒队辅助","[天残神腿]","对敌方前排单体目标造成伤害。\n玉玺在手，天下我有。",412,"释放技能回复自身怒气。\n受命于天，既寿永昌。",4001,1,5,0,12,4,0,80,1,0,1600,0,1412,412,41201,41202,41203,41204,41205,41206,41207,41208,41251,41252,41253,41254,41255,5301,5312,41261,5401,5412,5501,5512,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4",0,0,1,},
        [88] = {413,"颜良",2,4,0,80,1,4,4,413,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,2,414,"颜良，袁绍帐下大将，勇冠三军，颇有威名，《三国演义》白马坡之战，袁曹对峙，关羽跃马阵前，望见颜良麾盖，直冲过去，在万众之中刺死颜良，斩其首级而归。","袁绍军队的先锋大将。","以勇而闻名。","减怒队输出","[天旋地裂]","对敌方前排单体目标造成伤害。\n冲！冲！冲！",413,"上场第一回合必定暴击。\n刀光裂空，劈开一切。",4001,1,4,0,8,3,0,80,1,0,400,0,1413,413,41301,41302,41303,41304,41305,0,0,0,41351,41352,41353,41354,5201,5211,41361,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|4",0,0,0,},
        [89] = {414,"文丑",2,4,0,80,1,4,4,414,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,1,413,"文丑，袁绍帐下大将，勇冠三军，颇有威名，颜良死后，为颜良报仇心切，在延津一役中，射退张辽，与徐晃大战三十合不分胜败，追击中正遇关羽，战不三合，心怯欲走，被关羽赶上斩于马下。","袁绍军队的大将。","武力高强，勇冠三军。","减怒队输出","[劈山碎岳]","对敌方前排目标造成伤害。\n谁敢比我强？",414,"普通攻击减少目标怒气。\n万仞山峰，一锤碎之。",4001,1,4,0,8,3,0,80,1,0,400,0,1414,414,41401,41402,41403,41404,41405,0,0,0,41451,41452,41453,41454,5202,5212,41461,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|4",0,0,0,},
        [90] = {415,"蔡文姬",2,4,0,80,2,4,3,415,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"蔡琰，字文姬，三国知名才女，东汉大文学家蔡邕[yōng]的女儿，博学多才，擅长文学、音乐、书法。董卓之乱中，被匈奴人掳走，嫁给匈奴左贤王。十二年后，曹操统一北方，用重金将蔡琰赎回，这就是文姬归汉的故事。","婉娩淑女，与士并列。","至柔动刚，彤管炜节。","减怒队控制","[天涯悲歌]","对敌方前排单体目标造成伤害。\n乱世陈情，字字血泪。",415,"提升释放晕眩效果的概率。\n独坐幽篁，弹琴长啸。",4001,1,4,0,8,3,0,80,1,0,400,0,1415,415,41501,41502,41503,41504,41505,0,0,0,41551,41552,41553,41554,5203,5213,41561,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|4|7",0,0,0,},
        [91] = {416,"陈宫",2,4,0,80,1,4,2,416,0,90,41,34,506,6,3,2,34,1000,0,0,0,1,0,0,"陈宫，字公台，曾跟随曹操，后成为吕布帐下首席谋士。性情刚直，足智多谋，命运多舛，忧愤而不得志，三国杀陈宫的明策、智迟、明珠蒙尘即由此而来。吕布战败后，陈宫不肯投降，曹操流着眼泪杀死了他。","识游鱼不识龙，要诛玄德拒曹公。","虽然背却苍天意，谁似忠心映日红？","减怒队输出","[锋芒傲世]","对敌方纵排目标造成伤害。\n如此，一击可擒也。",416,"技能伤害增加。\n七星环绕，巨龙盘卧。",4001,1,4,0,8,3,0,80,1,0,400,0,1416,416,41601,41602,41603,41604,41605,0,0,0,41651,41652,41653,41654,5201,5213,41661,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|4",0,0,0,},
        [92] = {417,"孔融",2,4,0,80,1,4,4,417,0,75,34,41,563,5,2,3,38,1000,0,0,0,2,0,0,"孔融，字文举， 东汉末年文学家，建安七子之一，孔子的二十世孙。然而我们熟悉他，却是因为孔融让梨的典故。年少的小孔融，聪明机灵，喜欢捣蛋，挥舞着伴随他长大的竹马，打出一个个飞梨。","博闻强记，奇逸卓荦。","海天逸，音情顿挫。","减怒队辅助","[竹马飞梨]","对敌方前排单体目标造成伤害。\n孔门之后，忠孝为先。",417,"普通攻击额外增加怒气。\n七星环绕，巨龙盘卧。",4001,1,4,0,8,3,0,80,1,0,400,0,1417,417,41701,41702,41703,41704,41705,0,0,0,41751,41752,41753,41754,5202,5212,41761,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3|4",0,0,0,},
        [93] = {418,"吕灵雎",2,4,0,80,2,4,2,418,0,68,41,34,675,5,3,2,45,1000,0,0,0,1,0,0,"吕灵雎，相传为吕布与貂蝉之女，美貌不亚于貂蝉，武艺不亚于父亲，威风凛凛而寂寥，勇敢而身先士卒。虽然有着能够直面困难的坚强意志，却由于过去的经历而有着非常害怕孤独的一面。 ","不动如山，迅烈如火。","巾帼不让须眉。","减怒队肉盾","[无双战姬]","对敌方前排单体目标造成伤害。\n谁说女子不如男？",418,"普通攻击回复自身血量。\n七星环绕，巨龙盘卧。",4001,1,4,0,8,3,0,80,1,0,400,0,1418,418,41801,41802,41803,41804,41805,0,0,0,41851,41852,41853,41854,5203,5211,41861,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [94] = {419,"张让",2,4,0,80,1,4,4,419,0,75,41,34,563,5,3,2,38,1000,0,0,0,1,0,0,"张让，东汉末年宦官，十常侍之首，以搜刮暴敛、骄纵贪婪见称，灵帝极为宠信。因为悲惨的宿命，武器为一把特别打造的大剪刀，名为断子绝孙剪，性格张狂，容易暴走，内心却十分脆弱。","黄巾海沸于九州。","群阉毒流于四海。","减怒队控制","[断子绝孙]","对敌方前排单体目标造成伤害。\n都和我一样吧！",419,"提升释放沉默效果的概率。\n功在剪术，技在手巧。",4001,1,4,0,8,3,0,80,1,0,400,0,1419,419,41901,41902,41903,41904,41905,0,0,0,41951,41952,41953,41954,5201,5212,41961,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|4|8",0,0,0,},
        [95] = {450,"南华",2,7,0,225,1,4,4,450,0,14400,272,332,81000,0,0,0,0,1000,0,0,0,2,0,0,"南华老仙，山中仙人，手执藜杖，碧眼童颜。因赠予张角《太平要术》而被世人得知。曾教导张角要向天下宣扬教义，普度众生。","向天下宣扬教义","普度众生","减怒队输出","[魔光千仞]","对敌方随机三个目标造成伤害。\n天地一指，万物一马！",450,"增加技能和普攻伤害。\n功在剪术，技在手巧。",4001,1,7,0,5,3,0,80,0,0,400,0,1450,450,45001,45002,45003,45004,45005,45006,45007,45008,45051,45052,45053,45054,45055,5324,5334,45061,5424,5434,5524,5534,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,0,0,},
        [96] = {451,"卢植",2,7,0,225,1,4,4,451,0,12000,332,272,90000,0,0,0,0,1000,0,0,0,2,0,0,"卢植，字子干，著名经学家，将领。 性格刚毅，文武双全，品德高尚，心怀天下。身材高大，声如洪钟，极善饮酒。刘备和公孙瓒皆为卢植门下弟子。","名著海内，学为儒宗","士之楷模，国之桢干","减怒队控制","[自在逍遥]","对敌方怒气最少的两个目标造成伤害。\n前代名贤，后王斯重！",451,"技能攻击无视无敌效果。\n贞洁贤良，吾之本心。",4001,1,7,0,5,3,0,80,0,0,400,0,1451,451,45101,45102,45103,45104,45105,45106,45107,45108,45151,45152,45153,45154,45155,5324,5333,45161,5424,5433,5524,5533,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|3",80,3,0,},
        [97] = {120,"荀攸",2,3,0,60,1,1,1,120,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"荀攸[yōu] ，字公达，曹魏五谋臣之一，被曹操称为谋主。作战计谋灵活多变，曾为曹操献奇计水淹下邳城，活捉吕布。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1120,0,12001,12002,12003,12004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2",0,0,0,},
        [98] = {121,"程昱",2,3,0,60,1,1,1,121,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"程昱[yù]，字仲德，曹魏五谋臣之一，参与了攻打吕布、袁绍、刘备、孙权的大部分战事，一直出谋献策，表现出众。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1121,0,12101,12102,12103,12104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1",0,0,0,},
        [99] = {122,"庞德",2,3,0,60,1,1,1,122,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"庞德，字令明，本为马超部将，后随曹操。常骑白马驰骋奔杀，刚毅威武，勇猛无比，最著名的事迹是抬着棺材与关羽决战，曾一箭射中关羽前额，被称作[白马将军]。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1122,0,12201,12202,12203,12204,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [100] = {123,"王异",2,3,0,60,2,1,1,123,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"王异，益州刺史赵昂之妻。赵昂到冀城就任，王异随夫徙居冀城。建安十七年，马超进攻冀城，王异亲自披着战衣，辅佐赵昂守城，又以其身上的珠饰、佩环等物品犒赏军士，振奋军心。后赵昂坚守祁山，曾出奇计九条，王异皆有参与。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1123,0,12301,12302,12303,12304,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [101] = {124,"曹昂",2,3,0,60,1,1,1,124,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"曹昂，字子修，曹操的长子，性情谦和且聪慧，深得曹操喜爱。曹操征讨张绣时，羞辱张绣之婶邹氏，被张绣突然袭击。曹昂为保护曹操撤退，与典韦一起战死在宛城。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1124,0,12401,12402,12403,12404,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [102] = {125,"郭照",2,3,0,60,2,1,1,125,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"郭照，字女王，东汉南郡太守郭永之次女，魏文帝曹丕的皇后。少年时父母双亡，流离乱世，后入东宫，美貌聪慧，深受曹丕宠爱。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1125,0,12501,12502,12503,12504,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [103] = {126,"曹叡",2,3,0,60,1,1,1,126,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"魏明帝曹叡[ruì]，字元仲，曹丕、甄姬之子，是曹魏的第二位皇帝，从226年到239年在位，享年三十五岁。曹叡能诗文，与曹操和曹丕并称魏[三祖]，但其文学成就不及曹操和曹丕。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1126,0,12601,12602,12603,12604,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [104] = {127,"钟会",2,3,0,60,1,1,1,127,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"钟会，字士季，魏名将，太傅钟繇[yáo]之子，是魏国后期重要的策臣与谋士、制定伐蜀计划并参与灭蜀之战的智将，同时也是书法家。钟会自幼才华横溢，上至皇帝、下至群臣都对他非常赏识。公元263年，他与邓艾带兵攻打蜀国，最终导致蜀国灭亡。之后钟会设计害死邓艾，联合姜维准备自立，最终因部下反叛失败，与姜维一同死于兵变。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1127,0,12701,12702,12703,12704,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1",0,0,0,},
        [105] = {128,"邓艾",2,3,0,60,1,1,1,128,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"邓艾，字士载，魏国后期杰出的军事家、将领。文武全才，深谙兵法，多年在曹魏西边战线防备蜀汉姜维。后他与钟会率军分别攻打蜀汉，率先进入成都，使得蜀汉灭亡，却遭到钟会陷害，被司马昭猜忌而被收押，被杀。被推崇为古今六十四名将之一。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1128,0,12801,12802,12803,12804,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [106] = {129,"郭淮",2,3,0,60,1,1,1,129,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"郭淮，魏国后期名将，夏侯渊战死时郭淮收集残兵，稳定局势。曹丕称帝后，赐郭淮爵关内侯，又任镇西长史。诸葛亮伐魏时，郭淮料敌准确，多立战功，曾击退姜维。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1129,0,12901,12902,12903,12904,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [107] = {130,"邹氏",2,3,0,60,2,1,1,130,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"邹氏，东汉末年张济之妻，张绣之婶。曹操战宛城时，张绣不敌而降；曹操误听怂恿，掳占邹氏。张绣知而大怒，但惧典韦之勇，用贾诩之计，遣胡车儿盗去典之双戟，夜袭曹营。典韦、曹昂等战死，曹操大败逃走，后张绣刺死邹氏。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1130,0,13001,13002,13003,13004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [108] = {131,"杨修",2,3,0,60,1,1,1,131,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"杨修，字德祖，东汉末年文学家。学问渊博，才高八斗，曾任曹操丞相府的主簿，其才华连曹操也自叹不如，留有一盒酥、鸡肋等典故。因其性情狂放，目中无人，恃才傲物，又参与曹丕曹植夺嫡之争，终被曹操所杀，时年四十五岁。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1131,0,13101,13102,13103,13104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [109] = {132,"辛宪英",2,2,0,40,2,1,1,132,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"辛氏，字宪英，辛毗[pí]之女，羊耽之妻，魏晋时期知名才女。为人聪明有才，善于鉴人知事，曾劝弟尽忠职守，又预言钟会将会叛变。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1132,0,13201,13202,13203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [110] = {133,"王朗",2,2,0,40,1,1,1,133,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"王朗，字景兴，曹魏时期重臣，曾任司空，司徒，经学家。博学多闻，严谨慷慨，恭俭节约，著有《周易传》、《春秋传》、《孝经传》、《周官传》等，有文集三十四卷。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1133,0,13301,13302,13303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [111] = {134,"曹休",2,2,0,40,1,1,1,134,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"曹休，字文烈，曹魏八虎骑之一。曹休于曹操起兵讨伐董卓时前往投奔，被称为千里驹。曹操对他如同亲子，并使他领虎豹骑宿卫。汉中之战时，曹休识破张飞计谋，大败吴兰。曹魏建立后，镇守曹魏东线，多次击破吴军，诱降吴将。官至大司马，封长平侯。后曹休在魏吴石亭之战中大败，因背上毒疮发作而去世。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1134,0,13401,13402,13403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [112] = {135,"满宠",2,2,0,40,1,1,1,135,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"满宠，字伯宁，曹魏重臣。掌管司法，以执法严格著称。后转任汝南太守，曾参与赤壁之战，关羽围攻樊城时，协助曹仁守城。曹丕在位期间，满宠驻扎在新野，负责荆州侧的对吴作战。曹叡[ruì]在位期间，满宠转任到扬州，接替曹休负责东侧对吴作战，屡有功劳。谥号景侯。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1135,0,13501,13502,13503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [113] = {136,"司马昭",2,2,0,40,1,1,1,136,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"司马昭，字子上，三国时期曹魏权臣，西晋王朝的奠基人之一。司马懿与张春华次子，早年随司马懿抗击蜀汉，多有战功，司马家族势力权倾朝野，其篡位野心人尽皆知，其子司马炎后来篡魏自立。留有[司马昭之心路人皆知]的著名典故。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1136,0,13601,13602,13603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [114] = {137,"司马炎",2,2,0,40,1,1,1,137,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"司马炎，字安世，晋武帝，晋朝开国皇帝。仁以厚下，宏略大度，被称为史上最宽厚仁慈的开国帝王。265年建国，280年灭吴，统一全国。前期厉行节俭，虚心纳谏，用人唯贤，进行了一系列的改革，曾有过繁荣的太康之治，而后期则热衷于安逸享乐，以致荒淫无度，君臣赛富。前明后暗是对晋武帝最公正的评价。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1137,0,13701,13702,13703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [115] = {138,"王基",2,2,0,40,1,1,1,138,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"王基，字伯舆，三国时期曹魏将领。文武兼备，才高于世，德溥于时，在南征毌[guàn]丘俭、文钦之乱及东征诸葛诞之叛等战役中，深得司马家器重。官至征南将军、都督荆州诸军事，封东武侯。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1138,0,13801,13802,13803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"",0,0,0,},
        [116] = {139,"王元姬",2,2,0,40,2,1,1,139,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"王元姬，王朗之孙女，司马昭之妻，司马炎之母。出生书香门第，幼时便通《诗经》、《论语》，嫁司马昭后竭尽妇道、谦虚谨慎。其人颇有远见，曾预言钟会谋反之事。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1139,0,13901,13902,13903,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [117] = {140,"诸葛诞",2,2,0,40,1,1,1,140,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"诸葛诞，字公休，魏国后期将领，司隶校尉诸葛丰之后，蜀汉丞相诸葛亮的族弟，官至征东大将军。曾与司马师一同平定毌[guàn]丘俭、文钦的叛乱。之后因与被诛的夏侯玄、邓飏[yáng] 交厚，且见到王淩、毌丘俭等人的覆灭而心不自安，于是起兵，并得到东吴的支援，但于次年被镇压，诸葛诞及麾下数百人，拒绝投降而被杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1140,0,14001,14002,14003,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"",0,0,0,},
        [118] = {141,"曹彰",2,2,0,40,1,1,1,141,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"曹彰，字子文，三国时期曹魏宗室、将领，曹操与卞皇后所生第二子，曹丕之弟、曹植之兄。从小就善于射箭、驾车，臂力过人，徒手能与猛兽格斗，不怕危险困难。武艺过人，不善文章，曹操问诸子志向时自言好为将，因此得到曹操赞赏。其胡须黄色，被曹操称为黄须儿。建安二十三年，曹彰率军征讨乌桓，又降服辽东鲜卑大人轲比能。死后谥号为威，亦称为任城威王。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1141,0,14101,14102,14103,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [119] = {142,"曹洪",2,2,0,40,1,1,1,142,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"曹洪，字子廉，曹魏八虎骑之一，曹操从弟。早年随曹操随军征伐，平兖州、征刘表、讨祝臂，多有战功。曹操追袭董卓时，于荥阳兵败，中埋伏，曹洪舍命献马拼死作战，使曹操免于厄难。曹丕即位时封曹洪为骠骑[piào qí]将军。232年，曹洪逝世，追谥恭侯。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1142,0,14201,14202,14203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [120] = {143,"蒋干",2,2,0,40,1,1,1,143,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"蒋干，字子翼，汉末曹魏文臣。历史上的蒋干是当时的名士、辩论家，经过《三国演义》蒋干中计的演绎之后，倒成了一号非常有名的人物。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1143,0,14301,14302,14303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [121] = {144,"孙资",2,2,0,40,1,1,1,144,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"孙资，字彦龙，三国后期曹魏重臣。三岁丧双亲，由兄嫂抚养成人，后入太学，加入曹操帐下。先为功曹，后任计吏，参丞相军事，受尚书令荀彧称赞。魏国建立后，孙资为秘书郎，后转右丞，权势益重。魏明帝曹叡即位后，孙资与刘放权势益重，备受宠幸。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1144,0,14401,14402,14403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"",0,0,0,},
        [122] = {145,"陈群",2,2,0,40,1,1,1,145,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"陈群，字长文，曹魏重臣，魏晋南北朝选官制度九品中正制和曹魏律法《魏律》的主要创始人。出身名门，有知人之明，历仕曹操、曹丕、曹叡三代，以其突出的治世之才，竭忠尽职，为曹魏政治制度的建设，做出了突出的贡献。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1145,0,14501,14502,14503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [123] = {146,"钟繇",2,2,0,40,1,1,1,146,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"钟繇[yáo]，字元常，三国时期曹魏著名书法家、政治家。少年时就相貌不凡，聪慧过人，历任尚书郎、黄门侍郎等职，助汉献帝东归有功，封东武亭侯。后被曹操委以重任，为司隶校尉，镇守关中，功勋卓著。擅篆、隶、真、行、草多种书体，在书法方面颇有造诣，被后世尊为楷书鼻祖，与东晋书法家王羲之并称为[钟王]。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1146,0,14601,14602,14603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [124] = {147,"曹真",2,2,0,40,1,1,1,147,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"曹真，字子丹，曹魏八虎骑之一。其父为曹操募兵时遇害，遂被曹操收为养子。勇猛过人，被曹操委以执掌虎豹骑的重任。曾大破羌胡联军，平定河西；率军包围江陵，击破吴将孙盛。曹丕病重时，曹真受遗诏辅政。魏明帝曹叡即位后，拜大将军，后率军抵御蜀汉丞相诸葛亮的北伐。后因病去世，谥号元侯。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1147,0,14701,14702,14703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [125] = {148,"韩浩",2,2,0,40,1,1,1,148,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"韩浩，字元嗣[sì]，曹操麾下将领。董卓曾招引韩浩，韩浩不从，因而知名。后夏侯惇奇其才，使韩浩领兵跟从征伐，后被曹操视为心腹将领，被委以执掌禁军的重责。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1148,0,14801,14802,14803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [126] = {220,"马岱",2,3,0,60,1,2,1,220,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"马岱，马超的从弟，三国时期蜀汉将领，早年追随马超大战曹操，反攻陇上，围攻成都，汉中之战等。后在诸葛亮病逝后受杨仪派遣斩杀蜀将魏延。曾率领军队出师北伐，被魏将牛金击败而退还。官至平北将军，陈仓侯。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1220,0,22001,22002,22003,22004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1",0,0,0,},
        [127] = {221,"马谡",2,3,0,60,1,2,1,221,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"马谡[sù]，字幼常，马良之弟，三国时期蜀汉将领。才器过人，好论军计，诸葛亮对他深为器重，每引见谈论，自昼达夜。228年，马谡在诸葛亮北伐时，因违背诸葛亮作战指令，而导致街亭失守，撤军后被诸葛亮斩首，留下挥泪斩马谡的知名典故。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1221,0,22101,22102,22103,22104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [128] = {222,"廖化",2,3,0,60,1,2,1,222,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"廖化，字元俭，以果敢刚直著称，是蜀汉后期的重要将领。相传本为黄巾军，因世乱流落江湖，落草为寇，劫掠为生。后投靠刘备，曾为关羽主簿，关羽败亡后归入孙吴，用诈死之计回归蜀汉，后多次参与蜀汉的北伐，[蜀中无大将，廖化作先锋]的典故即由此而来。蜀汉灭亡后，徙往洛阳，在中途病逝。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1222,0,22201,22202,22203,22204,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [129] = {223,"刘琮",2,3,0,60,1,2,1,223,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"刘琮，东汉末年荆州牧刘表次子，刘琦之弟。刘表死后继承刘表官爵，当曹操大军南下之时，他在蔡瑁等人的劝说之下举荆州而降，被曹操封为青州刺史，后迁谏议大夫，爵封列侯。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1223,0,22301,22302,22303,22304,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [130] = {224,"刘封",2,3,0,60,1,2,1,224,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"刘封，刘备义子。有武艺，性格刚猛，气力过人。随赵云、张飞等扫荡西川，颇有战功，而后又统领孟达攻取上庸，深为刘备信任。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1224,0,22401,22402,22403,22404,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [131] = {225,"张苞",2,3,0,60,1,2,1,225,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"张苞，名将张飞长子，蜀汉后期将领，使用父亲家传蛇矛为兵器，和张飞一样勇猛剽悍。他和关羽次子关兴是关系很好的结拜兄弟，两人并称小关张。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1225,0,22501,22502,22503,22504,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [132] = {226,"司马徽",2,3,0,60,1,2,1,226,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"司马徽，字德操，东汉末年名士，精通道学、奇门、兵法、经学，有水镜先生之称。为人清雅，学识广博，有知人之明，并向刘备推荐了诸葛亮、庞统等人，受到世人的敬重。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1226,0,22601,22602,22603,22604,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [133] = {227,"甘夫人",2,3,0,60,2,2,1,227,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"甘夫人，刘备之妻，刘禅的生母。刘备因早年多次丧偶，甘夫人常代理主持家事。甘夫人随刘备到荆州时，生刘备长子刘禅，后来去世，葬于南郡。刘禅即位后追谥生母甘夫人为昭烈皇后。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1227,0,22701,22702,22703,22704,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [134] = {228,"糜夫人",2,3,0,60,2,2,1,228,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"糜夫人，蜀汉大臣糜竺之妹，刘备之妻。吕布袭取下邳后，徐州富商麋竺大力资助刘备，进献妹妹给刘备作夫人，又送家奴与军资，使刘备军得以重振。《三国演义》中，长坂坡兵败时，她怀抱年仅两岁的刘禅在乱军中走散，被赵云发现；但因为赵云只有一匹马，不肯上马，在将阿斗托付给赵云后投井而亡。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1228,0,22801,22802,22803,22804,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [135] = {229,"夏侯涓",2,3,0,60,2,2,1,229,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"夏侯涓，张飞的妻子，夏侯渊的侄女，夏侯霸的堂妹，两个女儿都是刘禅的皇后。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1229,0,22901,22902,22903,22904,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [136] = {230,"鲍三娘",2,3,0,60,2,2,1,230,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"鲍三娘，相传她是鲍家庄鲍员外的小女儿，自小聪明伶俐，深受喜爱，后来与关羽之子关索成亲。据说关羽一看到这个儿媳妇就非常喜爱，甚至亲自传授鲍三娘武艺，因此也造就了鲍三娘的文武双全。荆州失守后，鲍三娘就跟随关索一同投奔蜀汉，并随诸葛亮征讨南蛮，此后夫妻二人就一直替诸葛亮镇守南中。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1230,0,23001,23002,23003,23004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [137] = {231,"沙摩柯",2,3,0,60,1,2,1,231,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"沙摩柯，五溪蛮族首领，为刘备伐吴的援军。伐吴期间，曾一箭射杀东吴猛将甘宁。后刘备兵败，沙摩柯被东吴大将周泰杀死。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1231,0,23101,23102,23103,23104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [138] = {232,"马良",2,2,0,40,1,2,1,232,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"马良，字季常，蜀汉官员，马谡之兄。因眉毛中有白毛，人称白眉马良，马良兄弟五人都有才华名气，而马良又在五人中最为出色，因此有[马氏五常，白眉最良]的赞誉。刘备东征东吴时，曾派马良招纳五溪少数民族。夷陵之战兵败，马良也遇害身亡。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1232,0,23201,23202,23203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [139] = {233,"孟达",2,2,0,40,1,2,1,233,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"孟达，字子度，扶风郡郿人，三国时期蜀汉将领。本为刘璋属下，后降刘备。关羽围樊城、襄阳时因不发兵救关羽而触怒刘备，于是投奔曹魏。此后又欲反曹魏而归蜀汉，事败而死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1233,0,23301,23302,23303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [140] = {234,"周仓",2,2,0,40,1,2,1,234,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"周仓，字元福，蜀汉大将关羽的护卫。身材高大、黑面虬髯，本是黄巾军出身，关羽千里寻兄之时请求跟随，自此对关羽忠心不二；在关羽兵败被杀后，周仓也自刎而死。在各地的关帝庙中，关羽神像的两侧也经常供奉周仓、关平的神像。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1234,0,23401,23402,23403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [141] = {235,"关兴",2,2,0,40,1,2,1,235,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"关兴，字安国，关羽次子，蜀汉后期重要将领。从小就有好名声，诸葛亮十分器重他，关羽死后继承了汉寿亭侯爵位，关兴随先主刘备一起伐吴，杀死吴将潘璋，夺回其父之刀。后随诸葛亮北伐，和张苞结为兄弟，立下许多战功。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1235,0,23501,23502,23503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [142] = {236,"诸葛瞻",2,2,0,40,1,2,1,236,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"诸葛瞻，字思远，蜀汉丞相诸葛亮之子。自幼聪敏，诸葛亮死后，袭其父武乡侯之爵。邓艾伐蜀时，诸葛瞻镇守绵竹，后交战失利，被重兵包围，自刎殉国。诸葛瞻之子诸葛尚也战死沙场，邓艾怜其忠，将诸葛瞻父子合葬。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1236,0,23601,23602,23603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"",0,0,0,},
        [143] = {237,"简雍",2,2,0,40,1,2,1,237,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"简雍，字宪和，蜀汉刘备帐下谋士，著名说客，刘备围成都时，简雍劝说刘璋投降。擅长辩论、议事，性情简单直接、不拘小节。与刘备同坐时，亦盘腿而坐，不理威仪。和除诸葛亮外的人相处时，他都独占一榻，卧姿对话，从不屈就于人。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1237,0,23701,23702,23703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [144] = {238,"李严",2,2,0,40,1,2,1,238,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"李严，字正方，三国时期蜀汉重臣，与诸葛亮同为刘备临终前的托孤之臣，曾与诸葛亮、法正等人一起制定《蜀科》，后来成为蜀汉的法律体系基础。231年，蜀军北伐时，李严负责督运粮草延误，使诸葛亮不得不退兵，李严为推卸责任反而怪罪诸葛亮，因而获罪，最终被废为平民。诸葛亮死时，李严亦因失去复官机会，大哭病死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1238,0,23801,23802,23803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [145] = {239,"关索",2,2,0,40,1,2,1,239,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"关索，相传为关羽第三子，迎娶鲍三娘为妻，荆州失守后携鲍三娘回归蜀国，并随同诸葛亮南征，此后夫妻二人就一直替诸葛亮镇守南中。至今云南一带仍流传以关索为主角的关索戏。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1239,0,23901,23902,23903,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [146] = {240,"夏侯霸",2,2,0,40,1,2,1,240,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"夏侯霸，字仲权，三国时期魏国和蜀汉后期的重要将领，夏侯渊次子。在魏国官至右将军、讨蜀护军，封爵博昌亭侯，屯驻陇西。249年，司马懿发动政变，诛杀曹爽，夏侯霸从前得到曹爽的厚待，与郭淮不和。曹爽被司马懿杀死后，他心中不安，投奔蜀汉，被任命为车骑将军，多次随姜维伐魏。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1240,0,24001,24002,24003,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [147] = {241,"马云禄",2,2,0,40,1,2,1,241,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"马云禄，马腾之女，赵云之妻，马超之妹。个性纯真率直，自幼习武，枪术非凡，寻常男子也是难以匹敌。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1241,0,24101,24102,24103,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [148] = {242,"黄皓",2,2,0,40,1,2,1,242,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"黄皓，三国时蜀汉宦官。刘禅在位时，十分宠信黄皓，黄皓便阿谀献媚，处心往上爬，董允每每正颜厉色地匡谏刘禅，责备黄皓，黄皓十分惧怕董允，始终不敢为非作歹。董允死后，黄皓总揽朝政、操弄威权，并排挤在北伐前线的大将军姜维。蜀国灭亡后，司马昭因为黄皓祸国殃民，将他凌迟处死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1242,0,24201,24202,24203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [149] = {243,"糜竺",2,2,0,40,1,2,1,243,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"糜竺，字子仲，蜀汉刘备帐下重臣。原为徐州富商，陶谦病死后，奉其遗命迎接刘备，在刘备最潦倒之时给予刘备很大的帮助，使他重新振作。糜竺雍容大方，敦厚文雅，擅骑射，虽从未统领军队，但一直被刘备待以上宾之礼。刘备入主益州后，拜糜竺为安汉将军，地位在诸葛亮之上，为众臣之最。吕蒙袭取荆州，其弟麋芳举城投降，导致关羽兵败身亡，麋竺面缚请罪，刘备劝慰麋竺，对他待遇如初，但不久后即因惭恨病死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1243,0,24301,24302,24303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"",0,0,0,},
        [150] = {244,"张嶷",2,2,0,40,1,2,1,244,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"张嶷[nì]，字伯岐，三国时期蜀汉名将。随马忠多次平定南蛮叛乱，因功封为越巂[xī]太守，甚得民心。后被征召回成都，官至荡寇将军，封关内侯。254年，带病与魏将徐质交战，杀敌过倍，但最终寡不敌众，战死沙场。张嶷死后，越巂郡民无不流涕，并为其立庙，四时祭祀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1244,0,24401,24402,24403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [151] = {245,"张松",2,2,0,40,1,2,1,245,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"张松，字子乔，劝刘璋迎刘备以击张鲁，后为其兄张肃所告发，刘璋怒而将他斩杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1245,0,24501,24502,24503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [152] = {246,"刘璋",2,2,0,40,1,2,1,246,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"刘璋，字季玉，东汉末年割据军阀之一，继父亲刘焉担任益州牧。为人懦弱多疑，听信手下张松、法正之言，迎刘备入益州。214年投降刘备，后被迁往荆州公安，病逝于荆州。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1246,0,24601,24602,24603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [153] = {247,"吴懿",2,2,0,40,1,2,1,247,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"吴懿[yì]，字子远，蜀汉将领，蜀汉穆皇后吴氏兄长。随刘焉入蜀，刘璋时任中郎将。刘备进攻刘璋，吴懿归降刘备，后随蜀汉丞相诸葛亮北伐曹魏，并与魏延在阳溪大破魏将郭淮等人。诸葛亮逝世后，镇守汉中。为人高亢强劲，又因其妹的身份，是当时蜀汉的重要将领。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1247,0,24701,24702,24703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [154] = {248,"刘谌",2,2,0,40,1,2,1,248,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"刘谌[chén]，刘备之孙，刘禅之子，被封为北地王。263年，邓艾军队兵临成都门下，刘禅决定投降，刘谌劝阻无效之后，自杀于昭烈庙。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1248,0,24801,24802,24803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [155] = {320,"程普",2,3,0,60,1,3,1,320,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"程普，字德谋，东吴名将，历仕孙坚、孙策、孙权三代。曾跟随孙坚讨伐过黄巾、董卓，又助孙策平定江东，孙策死后，与张昭等人共同辅佐孙权，并讨伐江东境内的山贼，功勋卓著。赤壁之战与周瑜分任左右都督打败曹操，之后大破曹仁于南郡。程普在东吴诸将中年岁最长，被人们尊称为[程公]。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1320,0,32001,32002,32003,32004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [156] = {321,"顾雍",2,3,0,60,1,3,1,321,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"顾雍，字元叹，东吴重要文臣。幼时拜蔡邕[yōng]为师，学习弹琴和书法，才思敏捷，心静专一，艺业日进，深受蔡邕喜爱。又因受到老师称赞，故字元叹。后入孙权幕府为左司马，后升任丞相，为相十九年，后被评为魏晋八君子之一。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1321,0,32101,32102,32103,32104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1|2",0,0,0,},
        [157] = {322,"吴国太",2,3,0,60,2,3,1,322,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"吴国太，孙坚妻子，孙尚香的母亲，《三国演义》中与乔国老促成刘备与孙尚香的姻缘。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1322,0,32201,32202,32203,32204,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [158] = {323,"孙鲁育",2,3,0,60,2,3,1,323,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"孙鲁育，字小虎，孙权与步练师的幼女，被称作[小公主]。聪慧娇俏，楚楚动人，后下嫁左将军朱据，自此又被称作[朱公主]。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1323,0,32301,32302,32303,32304,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [159] = {324,"孙茹",2,3,0,60,2,3,1,324,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"孙茹，孙坚的小妹，幼时聪慧，深得兄长孙坚喜爱。从外甥孙策渡长江时，因为暂时没足够的船，孙策感到苦恼打算暂时驻军江边，此时孙茹夫人献计以芦苇为筏，化解了孙策的顾虑。吴军遂神不知鬼不觉，以箭一般的速度渡过长江击破刘繇部将张英，立下平江东第一功。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1324,0,32401,32402,32403,32404,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [160] = {325,"朱然",2,3,0,60,1,3,1,325,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"朱然，字义封，东吴名将。曾随吕蒙擒杀关羽，吕蒙死后，朱然代替吕蒙镇守江陵。夷陵之战中，与陆逊合力大破刘备，魏国趁机攻吴，朱然坚守江陵六个月，从此名震魏国。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1325,0,32501,32502,32503,32504,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [161] = {326,"虞翻",2,3,0,60,1,3,1,326,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"虞翻，字仲翔，东吴文臣，著名经学家、哲学家。既可日行三百里，又善使长矛，于经学也颇有造诣，尤其精通《易》学，又兼通医术，可谓文武全才。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1326,0,32601,32602,32603,32604,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1",0,0,0,},
        [162] = {327,"陆抗",2,3,0,60,1,3,1,327,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"陆抗，字幼节，陆逊次子，被誉为吴国最后的名将。二十岁时袭父爵为江陵侯，最大功绩为西陵之战大破晋军，并攻杀叛将西陵督步阐[chǎn]。官至大司马，与陆逊皆是吴国的中流砥柱，并称[逊抗]  。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1327,0,32701,32702,32703,32704,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1",0,0,0,},
        [163] = {328,"徐盛",2,3,0,60,1,3,1,328,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"徐盛，字文向，东吴大将，机智善辨，参加过多起战役，刘备伐吴时，徐盛跟随陆逊攻下蜀军多处屯营；曹休伐吴时，徐盛在形势不利的情况下以少抗多，成功防御。徐盛最大的成就为疑城之计，曹丕大举攻吴，徐盛在建业外围筑上围墙，曹丕被迫退走。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1328,0,32801,32802,32803,32804,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [164] = {329,"诸葛恪",2,3,0,60,1,3,1,329,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"诸葛恪，字元逊，东吴后期权臣，诸葛亮之侄，诸葛瑾长子，官至丞相。诸葛恪体格肥胖，幼小以神童著称，文采飞扬，辩论起来随机应变，没有能应答他的人，孙权见了很惊奇，对诸葛瑾称赞道：“蓝田出产美玉，果然名不虚传。”后来即用[蓝田生玉]比喻贤父生贤子，名门出贤良。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1329,0,32901,32902,32903,32904,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1",0,0,0,},
        [165] = {330,"阚泽",2,3,0,60,1,3,1,330,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"阚[kàn]泽，字德润，东吴重要文臣、大儒。少年时家贫，只得向别人抄书，于是博学多闻。性情谦逊恭谨、笃实慎重，他第一个识破周瑜打黄盖的苦肉计，自告奋勇向曹操献诈降书，是苦肉计中的关键人物。据传，阚泽对圆周率很有研究，祖冲之对圆周率的精确计算就是借鉴了他的成果。曾撰有《乾象历注》一书，今已佚。另有《九章算术》，亦不存。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1330,0,33001,33002,33003,33004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2",0,0,0,},
        [166] = {331,"朱治",2,3,0,60,1,3,1,331,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"朱治，字君理，东吴开国功臣。早年随从孙坚、孙策征伐，又辅助孙权，镇抚山越，佐定东南，功勋卓著。孙权对其即为敬重，每次进见，孙权都亲自迎接。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1331,0,33101,33102,33103,33104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [167] = {332,"孙静",2,2,0,40,1,3,1,332,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"孙静，字幼台，孙坚之弟，孙策孙权之叔。孙坚初起义军，孙静便集合乡里及宗族子弟五六百人作为孙坚的基础队伍，孙策进攻会稽时，孙静献计助孙策击败会稽太守王朗，平定会稽。孙静不愿出外为官，请求留任家乡镇守，后终老故乡。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1332,0,33201,33202,33203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [168] = {333,"凌操",2,2,0,40,1,3,1,333,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"凌操，东吴名将凌统之父，为人侠义有胆气，早年随孙策转战江东，每从征伐，常奋勇当先，是不可多得的水军将领，可惜在讨伐江夏黄祖时，被甘宁射杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1333,0,33301,33302,33303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [169] = {334,"朱恒",2,2,0,40,1,3,1,334,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"朱桓，字休穆，东吴名将。朱桓为人高傲，不喜欢为人所驱使，而又善养士卒，轻财重义，与人一见，数十年不忘，死时部下无不哭啼。主要成就为击败曹仁，斩常雕、俘王双，后又协助陆逊大败曹休。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1334,0,33401,33402,33403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [170] = {335,"蒋钦",2,2,0,40,1,3,1,335,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"蒋钦，字公奕，东吴将领。早年随孙策平定四郡，讨平黟贼，被陈寿盛赞为江表之虎臣。性格豁达，轻财约俭，擅长弓术，曾在赤壁之战与周泰、韩当率领水军在三江口踏江破敌。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1335,0,33501,33502,33503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [171] = {336,"陆绩",2,2,0,40,1,3,1,336,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"陆绩，字公纪，汉末庐江太守陆康之子。自幼聪明过人，知礼节，懂孝悌，尊重长辈，孝敬父母。六岁那年，于九江拜见袁术，袁术赠的橘子，陆绩舍不得全部吃完，深藏三枚于怀中，临行时，橘子滚落地上，袁术嘲笑他，陆绩回答道：“母亲喜欢吃橘子，我想拿回去送给母亲尝尝。”袁术见他小小年纪就懂得孝顺母亲，十分惊奇，这便是陆绩怀橘的典故。陆绩成年后，博学多识，通晓天文、历算，星历算数无不涉览，后事孙权，任偏将军。可惜因病早逝，年仅三十二岁。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1336,0,33601,33602,33603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"",0,0,0,},
        [172] = {337,"留赞",2,2,0,40,1,3,1,337,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"留赞，字正明，东吴将领。年轻时曾亲手斩了黄巾军将领，一只脚因而受伤，他性格刚烈，喜欢读兵书和三史，每每看到古代良将战攻之事，就对书长叹：“今天下大乱，英豪并起，历观前世，富贵无常，而我屈居在这闾巷之间，活着死了有什么区别。我要用刀割开我的脚，如果幸而不死而脚又好了，那我就有用处了，要不就死了算了。”还用刀割自己的脚筋，血流如注，昏过去好长时间。家人都非常害怕，帮他引拽受伤的脚，终于可以慢慢行走。后因为名声，被东吴大将凌统所用，屡有战功，最大功绩为东兴大胜魏军。后随孙峻征淮南，因病撤军，被魏将包围，力战而死，时年七十三岁。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1337,0,33701,33702,33703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [173] = {338,"孙休",2,2,0,40,1,3,1,338,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"孙休，孙权第六子，吴国第三位皇帝，吴大帝。十八岁时，受封为琅琊王，258年，孙綝[chēn]发动政变，罢黜孙亮，迎孙休为帝。后孙休与张布丁奉合谋，除掉孙綝。孙休在位期间，颁布良制，嘉惠百姓，创建国学，促进了东吴的繁荣。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1338,0,33801,33802,33803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [174] = {339,"丁奉",2,2,0,40,1,3,1,339,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"丁奉，字承渊，东吴后期名将。年少时以骁勇善战，奋勇杀敌，屡立功勋，主要成就是[雪中奋短兵]，大破进犯东吴的魏军，以及设计除掉了东吴的权臣孙綝[chēn]。丁奉一生征战，与北方政权从曹操时代交战至司马炎时代，侍奉了孙权至孙皓四位吴国君主，见证了三国的盛衰兴亡。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1339,0,33901,33902,33903,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [175] = {340,"孙鲁班",2,2,0,40,2,3,1,340,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"孙鲁班，字大虎，孙权长女，先后下嫁功臣周瑜之子周循和名将全琮，孙亮继位后，凭借外戚的身份和情夫孙峻排除异己，一度权倾一时，后同少帝谋划诛杀权臣孙綝[chēn]，事泄，被流放。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1340,0,34001,34002,34003,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [176] = {341,"祖茂",2,2,0,40,1,3,1,341,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"祖茂，字大荣，孙坚的心腹将领。孙坚讨伐董卓时，被董卓的骑兵追捕，于是祖茂戴上自己孙坚的红色头巾引开追兵，令孙坚得以逃脱。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1341,0,34101,34102,34103,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [177] = {342,"孙皓",2,2,0,40,1,3,1,342,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"孙皓，字元宗，孙权之孙，吴末帝。在位初期虽施行过明政，但不久即沉溺酒色，专于杀戮，变得昏庸暴虐。280年，吴国被西晋所灭，孙皓投降西晋，被封为归命侯，四年后在洛阳去世。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1342,0,34201,34202,34203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [178] = {343,"孙亮",2,2,0,40,1,3,1,343,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"孙亮，字子明，孙权第七子，吴国的第二位皇帝。十五岁亲政，但一年后就被权臣孙綝[chēn]废除，后被毒杀，终年十八岁。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1343,0,34301,34302,34303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [179] = {344,"岑昏",2,2,0,40,1,3,1,344,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"岑昏，宦官，三国后期吴末帝孙皓的佞臣。官至九卿之位，好兴土木，祸国殃民，常与蜀汉的黄皓并列为误国之奸臣，最后在东吴臣民的声讨中被孙皓处死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1344,0,34401,34402,34403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [180] = {345,"潘璋",2,2,0,40,1,3,1,345,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"潘璋，字文珪[guī]，东吴将领。作战勇猛，不断升迁，其一生为孙权东征西讨，战功无数，其中最主要成就是率部生擒关羽。但其为人奢侈贪财，孙权念其有功未予深究。《三国演义》中，潘璋擒获关羽，并夺取了青龙偃月刀及赤兔马，最后在夷陵之战被为父报仇的关兴所杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1345,0,34501,34502,34503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [181] = {346,"全琮",2,2,0,40,1,3,1,346,0,54,20,25,304,4,1,2,20,1000,0,0,0,2,0,0,"全琮，字子璜，东吴开国功臣。素有谋略，曾参与多场重要战役的谋划。孙权将自己的女儿孙鲁班嫁给了全琮，全琮的家族也成为吴国的名门，但全琮本人并不因此而骄横跋扈，仍然以十分谦恭的态度对待他人。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1346,0,34601,34602,34603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [182] = {347,"孙登",2,2,0,40,1,3,1,347,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"孙登，字子高，孙权长子，孙权称帝时立为皇太子。礼贤下士，谨慎得体，多次劝谏孙权，对时政多有匡弼，可惜年仅三十三岁便英年早逝。临终时仍上疏举荐贤才，希望吴国昌盛，孙权看到奏章后悲伤不已，流泪不止。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1347,0,34701,34702,34703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [183] = {348,"步骘",2,2,0,40,1,3,1,348,0,54,20,25,304,4,1,2,20,1000,0,0,0,1,0,0,"步骘[zhì]，字子山，三国时期东吴重臣。孙权称帝后，拜骠骑将军，都督西陵，后代陆逊为丞相。曾驻守西陵二十年，性情宽弘，很得人心，喜怒不形与声色，无论对内还是对外总是表现得十分恭敬。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1348,0,34801,34802,34803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [184] = {420,"张梁",2,3,0,60,1,4,1,420,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"张梁，东汉末年黄巾起义首领之一，张角的三弟，号称[人公将军]，后遭皇甫嵩率军夜袭战死。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1420,0,42001,42002,42003,42004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [185] = {421,"张宝",2,3,0,60,1,4,1,421,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"张宝，东汉末黄巾起义首领之一，张角的弟弟，张梁的哥哥，号称[地公将军]，后在曲阳被皇甫嵩、郭典击败，被杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1421,0,42101,42102,42103,42104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [186] = {422,"沮授",2,3,0,60,1,4,1,422,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"沮授，袁绍帐下谋士。少有大志，长于谋略，经常对袁绍提出良策，但很多时候袁绍并不听从。官渡之战时袁绍大败，沮授因拒降被曹操处死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1422,0,42201,42202,42203,42204,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"1|2",0,0,0,},
        [187] = {423,"刘表",2,3,0,60,1,4,1,423,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"刘表，字景升，汉末荆州诸侯。姿貌温厚伟壮，少时知名于世，名列八俊。在荆州期间，刘表恩威并著，开经立学，据地数千里，带甲十余万，称雄荆江。先杀孙坚，后又常抗曹操。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1423,0,42301,42302,42303,42304,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [188] = {424,"李儒",2,3,0,60,1,4,1,424,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"李儒，字文优，三国西凉军阀董卓女婿、首席谋士，为董卓所亲信，算无遗策，堪称智囊。董卓趁乱进京，说降吕布，废立皇帝等举动，均离不开其参谋之功。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1424,0,42401,42402,42403,42404,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [189] = {425,"汉献帝",2,3,0,60,1,4,1,425,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"汉献帝，即刘协，字伯和，东汉最后一任皇帝。董卓进京后，废汉少帝刘辩，立刘协为皇帝。董卓死后，曹操控制了刘协，迁都许昌，挟天子以令诸侯。曹操病死后，刘协被曹丕控制，随后被迫禅让于曹丕。最后刘协寿终正寝，享年五十四岁。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1425,0,42501,42502,42503,42504,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [190] = {426,"何太后",2,3,0,60,2,4,1,426,0,72,27,33,405,5,2,2,27,1000,0,0,0,2,0,0,"何太后，大将军何进的妹妹，汉灵帝刘宏第二任皇后，汉少帝刘辩生母。董卓进京后，废黜刘辩，不久毒杀刘辩及何氏。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1426,0,42601,42602,42603,42604,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [191] = {427,"何进",2,3,0,60,1,4,1,427,0,72,27,33,405,5,2,2,27,1000,0,0,0,1,0,0,"何进，字遂高，东汉灵帝时外戚，官至大将军。何进的异母妹有宠于灵帝并被立为皇后，他也随之升迁。黄巾起义时，何进为大将军，总镇京师。后在十常侍之乱中，被张让设伏诛杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1427,0,42701,42702,42703,42704,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [192] = {428,"潘凤",2,3,0,60,1,4,1,428,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"潘凤，擅使大斧，《三国演义》中韩馥部下，十八路诸侯讨伐董卓之时，他奉韩馥之命前往汜水关前挑战董卓部下大将华雄，不敌被斩。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1428,0,42801,42802,42803,42804,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [193] = {429,"王允",2,3,0,60,1,4,1,429,0,72,33,27,405,5,2,2,27,1000,0,0,0,2,0,0,"王允，字子师，东汉末年大臣。出身名门望族，天资聪颖，少年时期便出落为一名满腹经纶、文韬武略无不精通的全才。十九岁开始任公职，秉公为官。最大成就为刺杀董卓，李傕郭汜乱长安时被处死，时年五十六岁。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1429,0,42901,42902,42903,42904,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [194] = {430,"袁谭",2,3,0,60,1,4,1,430,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"袁谭，字显思，袁绍长子，曾攻破田楷、孔融，占据青州袁绍去世后，拥立袁尚为继承人，袁谭不能继位，心怀愤恨，联合曹操共同攻打袁尚。但袁谭并非一心归顺，后来叛变兵败被曹纯麾下虎豹骑所杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1430,0,43001,43002,43003,43004,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [195] = {431,"李傕",2,3,0,60,1,4,1,431,0,72,33,27,405,5,2,2,27,1000,0,0,0,1,0,0,"李傕，字稚然，董卓心腹部将，性格勇猛诡谲，善用兵，有辩才，统领西凉精锐部队飞熊军。董卓死后，采用贾诩之谋，反攻长安，把持朝廷大权。不久，汉献帝被曹操迎往许都，派人征讨李傕，灭其三族。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,3,0,4,2,0,0,1,0,50,0,1431,0,43101,43102,43103,43104,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"1",0,0,0,},
        [196] = {432,"陈登",2,2,0,40,1,4,1,432,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"陈登，字元龙，东汉末年将领、官员。为人爽朗，性格沈静，智谋过人，陶谦病死时陈登拥戴刘备继任徐州牧。后吕布袭取徐州，陈登向曹操献灭吕布之策，被授广陵太守。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1432,0,43201,43202,43203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,"",0,0,0,},
        [197] = {433,"蹋顿",2,2,0,40,1,4,1,433,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"蹋顿，东汉末年辽西乌桓首领。在袁绍与公孙瓒相争之际，蹋顿曾出兵协助袁绍，击破公孙瓒。袁绍死后，袁尚被曹操打败，转而求助蹋顿，后曹操亲自出征乌桓，蹋顿在此战中被曹操的先锋张辽所斩杀。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1433,0,43301,43302,43303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [198] = {434,"陶谦",2,2,0,40,1,4,1,434,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"陶谦，字恭祖，汉末群雄之一。黄巾之乱时，陶谦被朝廷任为徐州刺史，击破徐州黄巾，并推行屯田，恢复生产。后曹操在兖州立足，陶谦派部将张闿护送曹嵩去兖州途中，张闿贪图曹嵩资产而将其杀害，曹操以替父报仇为由，起兵讨伐陶谦，徐州大半几乎遭兵祸所害，以致过度忧劳而逝，陶谦临死前欲将徐州牧让与刘备，但刘备几度推辞，这便是三让徐州的来历。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1434,0,43401,43402,43403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [199] = {435,"纪灵",2,2,0,40,1,4,1,435,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"纪灵，字伏义，袁术帐下将领，勇猛非常，征讨徐州时同关羽大战三十回合未见胜负。曾奉命率军攻打小沛的刘备，在吕布辕门射戟的调停下撤兵。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1435,0,43501,43502,43503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [200] = {436,"祢衡",2,2,0,40,1,4,1,436,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"祢[mí]衡，字正平，东汉末年文人。年少就有文采和辩才，但性格刚直高傲，恃才傲物，与孔融交好。孔融著有《荐祢衡表》，向曹操推荐祢衡，但是祢衡称病不肯去，曹操封他为鼓手，想要羞辱祢衡，却反而被祢衡裸身击鼓而羞辱。后来祢衡骂曹操，曹操就把他遣送给刘表，刘表又把他送去给江夏太守黄祖，最后因和黄祖言语冲突而被杀，时年二十六岁。黄祖对杀害祢衡一事感到十分后悔，便将其加以厚葬。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1436,0,43601,43602,43603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [201] = {437,"卢植",2,2,0,40,1,4,1,437,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"卢植，字子干， 东汉末年经学家、将领。性格刚毅，品德高尚，先后担任九江、庐江太守，平定蛮族叛乱，黄巾起义时曾率军与张角交战。后与马日磾[dī]、蔡邕[yōng]等一起校勘儒学经典书籍，并参与续写《汉记》。刘备与公孙瓒皆为卢植门下弟子。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1437,0,43701,43702,43703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [202] = {438,"马腾",2,2,0,40,1,4,1,438,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"马腾，字寿成，马超之父，东汉末年割据凉州一带的军阀。身材高大，面鼻雄异，贤良忠厚，受众人尊敬。曾被献帝封为征西将军，同韩遂讨伐李傕、郭汜。211年，马超起兵抗拒曹操，马腾为曹操所杀，被夷灭三族，马超因此与曹魏结下刻骨之仇。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1438,0,43801,43802,43803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [203] = {439,"张绣",2,2,0,40,1,4,1,439,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"张绣，骠骑将军张济的从子，汉末割据宛城的军阀。初随张济征伐，张济死后与刘表联合，后降曹操，因邹氏事件而突袭曹操，复与刘表连和。官渡之战前夕，听从贾诩的建议再次投降曹操，参加官渡之战。","蓝将，描述未定","蓝将，描述未定","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1439,0,43901,43902,43903,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [204] = {440,"伏皇后",2,2,0,40,2,4,1,440,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"伏寿，汉献帝皇后，父亲是学者伏完，母为阳安长公主刘华，作为皇后二十年，于建安十九年被曹操幽闭而死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1440,0,44001,44002,44003,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [205] = {441,"高顺",2,2,0,40,1,4,1,441,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"高顺，东汉末年吕布帐下第一猛将，官至中郎将。为人清白有威严，不好饮酒，所统率的部队精锐非常，严守军纪，作战勇猛，攻无不克战无不胜 ，有“陷阵营”之美誉！","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1441,0,44101,44102,44103,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [206] = {442,"张鲁",2,2,0,40,1,4,1,442,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"张鲁，字公祺，东汉末年割据汉中一带的军阀，据传是西汉张良的十世孙，五斗米道的第三代天师，信徒众多。雄据汉中近三十年，成为汉末一支颇有实力的割据势力。后投降曹操，官拜镇南将军。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1442,0,44201,44202,44203,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [207] = {443,"蔡瑁",2,2,0,40,1,4,1,443,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"蔡瑁，字德珪，东汉末年荆州名族，长姐与二姐先后嫁给黄承彦与刘表。刘表病亡后，拥护刘琮继位，后降曹操。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1443,0,44301,44302,44303,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [208] = {444,"郭图",2,2,0,40,1,4,1,444,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"郭图，字公则，东汉末年袁绍帐下谋士。官渡之战时力主趁机偷袭曹营，在此计失败后为免于责罚而归罪于率军偷袭曹营的张郃、高览，致使二人背袁投曹。袁绍死后为其长子袁谭效力，于205年和袁谭一同被曹操所杀。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1444,0,44401,44402,44403,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [209] = {445,"伏完",2,2,0,40,1,4,1,445,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"伏完，东汉末大臣，汉献帝伏皇后之父。汉献帝迁许都后，曹操自任司空，大权在握并独揽。《三国演义》中，汉献帝发觉曹操的野心，与伏皇后及伏完商议，伏完向献帝献计以衣带诏赐国舅董承，以诛杀曹操，其后衣带诏事发，董承等被曹操所杀。后伏完向献帝发送密信以联合刘备、孙权讨伐曹操，但献帝回信被曹操截获，伏完全家皆被斩。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1445,0,44501,44502,44503,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [210] = {446,"蔡夫人",2,2,0,40,2,4,1,446,0,54,25,20,304,4,2,1,20,1000,0,0,0,2,0,0,"蔡夫人，东汉末年荆州牧刘表的后妻，荆襄一带的豪族蔡氏家族的一员，刘琮后母，蔡瑁之姐，黄月英的姨母。刘表死后，与蔡瑁等共排表长子刘琦，奉刘琮为嗣，后投降于曹操。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1446,0,44601,44602,44603,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [211] = {447,"公孙渊",2,2,0,40,1,4,1,447,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"公孙渊，字文懿，三国时辽东地方割据军阀。曾遣使南通孙权，孙权立其为燕王，并遣甲士万人携珍宝前往辽东，公孙渊害怕魏国讨伐，于是斩送吴使首至洛阳。后叛魏自立为燕王，明帝遣司马懿率军讨之，公孙渊兵败身死。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1447,0,44701,44702,44703,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [212] = {448,"刘虞",2,2,0,40,1,4,1,448,0,54,25,20,304,4,2,1,20,1000,0,0,0,1,0,0,"刘虞，字伯安，汉室宗亲，曾任幽州牧，政绩卓著，颇有名望，深得人心。主张以怀柔政策对待当地的游牧民族，与主杀的公孙瓒意见不合而产生矛盾，后被公孙瓒杀害。","绿将，还描不描述？","绿将，还描不描述？","","","",0,"",1,1,2,0,0,0,0,0,1,0,5,0,1448,0,44801,44802,44803,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,"",0,0,0,},
        [213] = {6011,"大刀兵",3,1,0,40,1,1,1,501,0,80,30,20,450,8,3,3,45,1000,0,0,0,1,0,0,"我是刀兵一号，二弟三弟被妖怪抓走了","我是刀兵一号，二弟三弟被妖怪抓走了","我是刀兵一号，二弟三弟被妖怪抓走了","","","",0,"",1,1,0,0,0,1,0,0,1,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [214] = {6014,"长刀军士",3,1,0,40,1,1,1,501,0,80,30,20,450,8,3,3,45,1000,0,0,0,1,0,0,"我是刀兵四号，不要问我为什么没有二号、三号","我是刀兵四号，不要问我为什么没有二号、三号","我是刀兵四号，不要问我为什么没有二号、三号","","","",0,"",1,1,0,0,0,1,0,0,1,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [215] = {6015,"横刀军士",3,1,0,40,1,1,1,501,0,80,30,20,450,8,3,3,45,1000,0,0,0,1,0,0,"我是刀兵五号，听说四号把三号吃了","我是刀兵五号，听说四号把三号吃了","我是刀兵五号，听说四号把三号吃了","","","",0,"",1,1,0,0,0,1,0,0,1,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [216] = {6021,"长枪兵",3,1,0,40,1,1,1,502,0,80,30,20,450,8,3,3,45,1000,0,0,0,1,0,0,"我是枪兵幸运E","我是枪兵幸运E","我是枪兵幸运E","","","",0,"",1,1,0,0,0,1,0,0,1,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [217] = {6031,"斧盾兵",3,1,0,40,1,1,1,503,0,80,30,20,450,8,3,3,45,1000,0,0,0,1,0,0,"我是盾兵幸运F","我是盾兵幸运F","我是盾兵幸运F","","","",0,"",1,1,0,0,0,1,0,0,1,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [218] = {6041,"弓手",3,1,0,40,1,1,1,504,0,80,30,20,450,8,3,3,45,1000,0,0,0,1,0,0,"我是弓兵是挂逼","我是弓兵是挂逼","我是弓兵是挂逼","","","",0,"",1,1,0,0,0,1,0,0,1,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [219] = {4444,"假董卓",0,5,0,100,1,4,6,405,0,150,55,45,750,15,6,5,75,1000,0,0,0,1,1,406,"肥胖，屠夫","肥胖，屠夫","肥胖，屠夫","杀义父","","",0,"",1,1,5,0,12,4,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [220] = {4555,"假张角",0,5,0,100,1,4,4,409,0,135,45,55,750,14,5,6,75,1000,0,0,0,2,1,410,"黄，角，法杖，道士，雷电","黄，角，法杖，道士，雷电","黄，角，法杖，道士，雷电","杀义父","技能：【小荷尖尖】","为己方血量最少的目标治疗。",4555,"泉眼无声惜细流，  树阴照水爱晴柔。小荷才露尖尖角，早有蜻蜓立上头。",1,1,5,0,12,4,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
        [221] = {4666,"张角",0,5,0,100,1,4,4,4666,0,135,45,55,750,14,5,6,75,1000,0,0,0,2,0,0,"黄，角，法杖，道士，雷电","黄，角，法杖，道士，雷电","黄，角，法杖，道士，雷电","杀义父","技能：【小荷尖尖】","为己方血量最少的目标治疗。",4666,"泉眼无声惜细流，  树阴照水爱晴柔。小荷才露尖尖角，早有蜻蜓立上头。",1,1,5,0,12,4,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"",0,0,0,},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [101] = 13,
    [102] = 14,
    [103] = 15,
    [104] = 16,
    [105] = 17,
    [106] = 18,
    [107] = 19,
    [108] = 20,
    [109] = 21,
    [11] = 7,
    [110] = 22,
    [111] = 23,
    [112] = 24,
    [113] = 25,
    [114] = 26,
    [115] = 27,
    [116] = 28,
    [117] = 29,
    [118] = 30,
    [119] = 31,
    [12] = 8,
    [120] = 97,
    [121] = 98,
    [122] = 99,
    [123] = 100,
    [124] = 101,
    [125] = 102,
    [126] = 103,
    [127] = 104,
    [128] = 105,
    [129] = 106,
    [13] = 9,
    [130] = 107,
    [131] = 108,
    [132] = 109,
    [133] = 110,
    [134] = 111,
    [135] = 112,
    [136] = 113,
    [137] = 114,
    [138] = 115,
    [139] = 116,
    [14] = 10,
    [140] = 117,
    [141] = 118,
    [142] = 119,
    [143] = 120,
    [144] = 121,
    [145] = 122,
    [146] = 123,
    [147] = 124,
    [148] = 125,
    [15] = 11,
    [150] = 32,
    [151] = 33,
    [16] = 12,
    [2] = 2,
    [201] = 34,
    [202] = 35,
    [203] = 36,
    [204] = 37,
    [205] = 38,
    [206] = 39,
    [207] = 40,
    [208] = 41,
    [209] = 42,
    [210] = 43,
    [211] = 44,
    [212] = 45,
    [213] = 46,
    [214] = 47,
    [215] = 48,
    [216] = 49,
    [217] = 50,
    [218] = 51,
    [219] = 52,
    [220] = 126,
    [221] = 127,
    [222] = 128,
    [223] = 129,
    [224] = 130,
    [225] = 131,
    [226] = 132,
    [227] = 133,
    [228] = 134,
    [229] = 135,
    [230] = 136,
    [231] = 137,
    [232] = 138,
    [233] = 139,
    [234] = 140,
    [235] = 141,
    [236] = 142,
    [237] = 143,
    [238] = 144,
    [239] = 145,
    [240] = 146,
    [241] = 147,
    [242] = 148,
    [243] = 149,
    [244] = 150,
    [245] = 151,
    [246] = 152,
    [247] = 153,
    [248] = 154,
    [250] = 53,
    [251] = 54,
    [3] = 3,
    [301] = 55,
    [302] = 56,
    [303] = 57,
    [304] = 58,
    [305] = 59,
    [306] = 60,
    [307] = 61,
    [308] = 62,
    [309] = 63,
    [310] = 64,
    [311] = 65,
    [312] = 66,
    [313] = 67,
    [314] = 68,
    [315] = 69,
    [316] = 70,
    [317] = 71,
    [318] = 72,
    [319] = 73,
    [320] = 155,
    [321] = 156,
    [322] = 157,
    [323] = 158,
    [324] = 159,
    [325] = 160,
    [326] = 161,
    [327] = 162,
    [328] = 163,
    [329] = 164,
    [330] = 165,
    [331] = 166,
    [332] = 167,
    [333] = 168,
    [334] = 169,
    [335] = 170,
    [336] = 171,
    [337] = 172,
    [338] = 173,
    [339] = 174,
    [340] = 175,
    [341] = 176,
    [342] = 177,
    [343] = 178,
    [344] = 179,
    [345] = 180,
    [346] = 181,
    [347] = 182,
    [348] = 183,
    [350] = 74,
    [351] = 75,
    [4] = 4,
    [401] = 76,
    [402] = 77,
    [403] = 78,
    [404] = 79,
    [405] = 80,
    [406] = 81,
    [407] = 82,
    [408] = 83,
    [409] = 84,
    [410] = 85,
    [411] = 86,
    [412] = 87,
    [413] = 88,
    [414] = 89,
    [415] = 90,
    [416] = 91,
    [417] = 92,
    [418] = 93,
    [419] = 94,
    [420] = 184,
    [421] = 185,
    [422] = 186,
    [423] = 187,
    [424] = 188,
    [425] = 189,
    [426] = 190,
    [427] = 191,
    [428] = 192,
    [429] = 193,
    [430] = 194,
    [431] = 195,
    [432] = 196,
    [433] = 197,
    [434] = 198,
    [435] = 199,
    [436] = 200,
    [437] = 201,
    [438] = 202,
    [439] = 203,
    [440] = 204,
    [441] = 205,
    [442] = 206,
    [443] = 207,
    [444] = 208,
    [4444] = 219,
    [445] = 209,
    [446] = 210,
    [447] = 211,
    [448] = 212,
    [450] = 95,
    [451] = 96,
    [4555] = 220,
    [4666] = 221,
    [5] = 5,
    [6] = 6,
    [6011] = 213,
    [6014] = 214,
    [6015] = 215,
    [6021] = 216,
    [6031] = 217,
    [6041] = 218,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in hero")
        return t._raw[__key_map[k]]
    end
}

-- 
function hero.length()
    return #hero._data
end

-- 
function hero.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function hero.indexOf(index)
    if index == nil or not hero._data[index] then
        return nil
    end

    return setmetatable({_raw = hero._data[index]}, mt)
end

--
function hero.get(id)
    
    return hero.indexOf(__index_id[id])
        
end

--
function hero.set(id, tkey, nvalue)
    local record = hero.get(id)
    if record then
        local keyIndex = __key_map[tkey]
        if keyIndex then
            record._raw[keyIndex] = nvalue
        end
    end
end

--
function hero.index()
    return __index_id
end

return hero